[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:6:39
 import Registration from "../../models/registration.model.js";
 
 // Helper to get team IDs for the current user
-async function getUserTeamIds(userId) {
-    const teams = await Team.find({
-      $or: [{ leader: userId }, { "members.user": userId, "members.status": "Approved" }],
-    }).select("_id").lean();
-    return teams.map((t) => t._id);
-}
+async function getUserTeamIds(userId) {}
 
 export const getDashboardStats = async (req, res) => {
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.status": "Approved", "members.user": "user123"}]}

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:8:13
 // Helper to get team IDs for the current user
 async function getUserTeamIds(userId) {
     const teams = await Team.find({
-      $or: [{ leader: userId }, { "members.user": userId, "members.status": "Approved" }],
+      $or: [{}, { "members.user": userId, "members.status": "Approved" }],
     }).select("_id").lean();
     return teams.map((t) => t._id);
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,8 @@
  Object {
    "$or": Array [

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:8:33
 // Helper to get team IDs for the current user
 async function getUserTeamIds(userId) {
     const teams = await Team.find({
-      $or: [{ leader: userId }, { "members.user": userId, "members.status": "Approved" }],
+      $or: [{ leader: userId }, {}],
     }).select("_id").lean();
     return teams.map((t) => t._id);
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "$or": Array [
      Object {

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:9:15
 async function getUserTeamIds(userId) {
     const teams = await Team.find({
       $or: [{ leader: userId }, { "members.user": userId, "members.status": "Approved" }],
-    }).select("_id").lean();
+    }).select("").lean();
     return teams.map((t) => t._id);
 }
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "_id"
Received: ""

Number of calls: 1

[Killed] ArrowFunction
controllers/organizer_controllers/analytics.controller.js:10:22
     const teams = await Team.find({
       $or: [{ leader: userId }, { "members.user": userId, "members.status": "Approved" }],
     }).select("_id").lean();
-    return teams.map((t) => t._id);
+    return teams.map(() => undefined);
 }
 
killedBy: Analytics Controller - getDashboardStats should return zero stats when teams have no events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "createdBy": Object {
      "$in": Array [

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:18:41
         const userId = req.user.id;
         const teamIds = await getUserTeamIds(userId);
 
-        const events = await Event.find({ createdBy: { $in: teamIds } })
+        const events = await Event.find({})
             .select('status ratings registrations')
             .lean();
killedBy: Analytics Controller - getDashboardStats should return zero stats when teams have no events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "createdBy": Object {
-     "$in": Array [

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:18:54
         const userId = req.user.id;
         const teamIds = await getUserTeamIds(userId);
 
-        const events = await Event.find({ createdBy: { $in: teamIds } })
+        const events = await Event.find({ createdBy: {} })
             .select('status ratings registrations')
             .lean();
killedBy: Analytics Controller - getDashboardStats should return zero stats when teams have no events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "createdBy": Object {
-     "$in": Array [

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:19:21
         const teamIds = await getUserTeamIds(userId);
 
         const events = await Event.find({ createdBy: { $in: teamIds } })
-            .select('status ratings registrations')
+            .select("")
             .lean();
 
killedBy: Analytics Controller - getDashboardStats should return correct stats for events with no ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "status ratings registrations"
Received: ""

Number of calls: 1

[Killed] ArrowFunction
controllers/organizer_controllers/analytics.controller.js:23:99
             .lean();
 
         const totalEvents = events.length;
-        const totalRegistrations = await Registration.countDocuments({ eventId: { $in: events.map(e => e._id) } });
+        const totalRegistrations = await Registration.countDocuments({ eventId: { $in: events.map(() => undefined) } });
 
         let totalRatings = 0;
killedBy: Analytics Controller - getDashboardStats should return correct stats for events with no ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "eventId": Object {
      "$in": Array [

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:23:81
             .lean();
 
         const totalEvents = events.length;
-        const totalRegistrations = await Registration.countDocuments({ eventId: { $in: events.map(e => e._id) } });
+        const totalRegistrations = await Registration.countDocuments({ eventId: {} });
 
         let totalRatings = 0;
killedBy: Analytics Controller - getDashboardStats should return correct stats for events with no ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "eventId": Object {
-     "$in": Array [

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:27:33
 
         let totalRatings = 0;
         let ratedEventsCount = 0;
-        events.forEach(event => {
-            if (event.ratings && event.ratings.length > 0) {
-                const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
-                totalRatings += eventTotalRating / event.ratings.length;
-                ratedEventsCount++;
-            }
-        });
+        events.forEach(event => {});
 
         const avgRating = ratedEventsCount > 0 ? (totalRatings / ratedEventsCount).toFixed(1) : 0;
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] ConditionalExpression
controllers/organizer_controllers/analytics.controller.js:28:17
         let totalRatings = 0;
         let ratedEventsCount = 0;
         events.forEach(event => {
-            if (event.ratings && event.ratings.length > 0) {
+            if (true) {
                 const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
                 totalRatings += eventTotalRating / event.ratings.length;
killedBy: Analytics Controller - getDashboardStats should return correct stats for events with no ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": 0,

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:28:60
         let totalRatings = 0;
         let ratedEventsCount = 0;
         events.forEach(event => {
-            if (event.ratings && event.ratings.length > 0) {
-                const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
-                totalRatings += eventTotalRating / event.ratings.length;
-                ratedEventsCount++;
-            }
+            if (event.ratings && event.ratings.length > 0) {}
         });
 
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] ArithmeticOperator
controllers/organizer_controllers/analytics.controller.js:29:75
         let ratedEventsCount = 0;
         events.forEach(event => {
             if (event.ratings && event.ratings.length > 0) {
-                const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
+                const eventTotalRating = event.ratings.reduce((acc, r) => acc - r.rating, 0);
                 totalRatings += eventTotalRating / event.ratings.length;
                 ratedEventsCount++;
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] ArrowFunction
controllers/organizer_controllers/analytics.controller.js:29:63
         let ratedEventsCount = 0;
         events.forEach(event => {
             if (event.ratings && event.ratings.length > 0) {
-                const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
+                const eventTotalRating = event.ratings.reduce(() => undefined, 0);
                 totalRatings += eventTotalRating / event.ratings.length;
                 ratedEventsCount++;
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] AssignmentOperator
controllers/organizer_controllers/analytics.controller.js:30:17
         events.forEach(event => {
             if (event.ratings && event.ratings.length > 0) {
                 const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
-                totalRatings += eventTotalRating / event.ratings.length;
+                totalRatings -= eventTotalRating / event.ratings.length;
                 ratedEventsCount++;
             }
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] ArithmeticOperator
controllers/organizer_controllers/analytics.controller.js:30:33
         events.forEach(event => {
             if (event.ratings && event.ratings.length > 0) {
                 const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
-                totalRatings += eventTotalRating / event.ratings.length;
+                totalRatings += eventTotalRating * event.ratings.length;
                 ratedEventsCount++;
             }
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] UpdateOperator
controllers/organizer_controllers/analytics.controller.js:31:17
             if (event.ratings && event.ratings.length > 0) {
                 const eventTotalRating = event.ratings.reduce((acc, r) => acc + r.rating, 0);
                 totalRatings += eventTotalRating / event.ratings.length;
-                ratedEventsCount++;
+                ratedEventsCount--;
             }
         });
killedBy: Analytics Controller - getDashboardStats should calculate average rating correctly for events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": "4.1",

[Killed] EqualityOperator
controllers/organizer_controllers/analytics.controller.js:35:27
             }
         });
 
-        const avgRating = ratedEventsCount > 0 ? (totalRatings / ratedEventsCount).toFixed(1) : 0;
+        const avgRating = ratedEventsCount <= 0 ? (totalRatings / ratedEventsCount).toFixed(1) : 0;
 
         // Placeholder for attendance until check-in is fully implemented
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": 0,

[Killed] ConditionalExpression
controllers/organizer_controllers/analytics.controller.js:35:27
             }
         });
 
-        const avgRating = ratedEventsCount > 0 ? (totalRatings / ratedEventsCount).toFixed(1) : 0;
+        const avgRating = true ? (totalRatings / ratedEventsCount).toFixed(1) : 0;
 
         // Placeholder for attendance until check-in is fully implemented
killedBy: Analytics Controller - getDashboardStats should return zero stats when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "avgAttendance": 89,
-   "avgRating": 0,

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:40:21
         // Placeholder for attendance until check-in is fully implemented
         const avgAttendance = 89; // Mock data for now
 
-        console.log(`Dashboard Stats - Events: ${totalEvents}, Registrations: ${totalRegistrations}, Avg Attendance: ${avgAttendance}, Avg Rating: ${avgRating}`);
+        console.log(``);
         res.status(200).json({
             totalEvents,
killedBy: Analytics Controller - getDashboardStats should return correct stats for events with no ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Dashboard Stats - Events: 2, Registrations: 25, Avg Attendance: 89, Avg Rating: 0"
Received: ""

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:47:21
             avgAttendance,
             avgRating,
         });
-    } catch (error) {
-        res.status(500).json({ message: "Failed to fetch dashboard stats", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Analytics Controller - getDashboardStats should handle errors when Team.find fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:48:41
             avgRating,
         });
     } catch (error) {
-        res.status(500).json({ message: "Failed to fetch dashboard stats", error: error.message });
+        res.status(500).json({ message: "", error: error.message });
     }
 };
killedBy: Analytics Controller - getDashboardStats should handle errors when Team.find fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database connection failed",
-   "message": "Failed to fetch dashboard stats",

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:52:56
     }
 };
 
-export const getEventWiseRatings = async (req, res) => {
-    try {
-        const userId = req.user.id;
-        const teamIds = await getUserTeamIds(userId);
-
-        const events = await Event.find({ createdBy: { $in: teamIds }, 'ratings.0': { $exists: true } })
-            .select('title ratings')
-            .lean();
-
-        const ratingsData = events.map(event => {
-            const avgRating = event.ratings.reduce((acc, r) => acc + r.rating, 0) / event.ratings.length;
-            return {
-                name: event.title,
-                rating: parseFloat(avgRating.toFixed(1)),
-            };
-        });
-
-        res.status(200).json(ratingsData);
-    } catch (error) {
-        res.status(500).json({ message: "Failed to fetch event-wise ratings", error: error.message });
-    }
-};
+export const getEventWiseRatings = async (req, res) => {};
 
 export const getAttendanceRatio = async (req, res) => {
killedBy: Analytics Controller - getEventWiseRatings should return empty array when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.status": "Approved", "members.user": "user123"}]}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:53:9
 };
 
 export const getEventWiseRatings = async (req, res) => {
-    try {
-        const userId = req.user.id;
-        const teamIds = await getUserTeamIds(userId);
-
-        const events = await Event.find({ createdBy: { $in: teamIds }, 'ratings.0': { $exists: true } })
-            .select('title ratings')
-            .lean();
-
-        const ratingsData = events.map(event => {
-            const avgRating = event.ratings.reduce((acc, r) => acc + r.rating, 0) / event.ratings.length;
-            return {
-                name: event.title,
-                rating: parseFloat(avgRating.toFixed(1)),
-            };
-        });
-
-        res.status(200).json(ratingsData);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Failed to fetch event-wise ratings", error: error.message });
     }
killedBy: Analytics Controller - getEventWiseRatings should return empty array when user has no teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.status": "Approved", "members.user": "user123"}]}

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/analytics.controller.js:57:96
         const userId = req.user.id;
         const teamIds = await getUserTeamIds(userId);
 
-        const events = await Event.find({ createdBy: { $in: teamIds }, 'ratings.0': { $exists: true } })
+        const events = await Event.find({ createdBy: { $in: teamIds }, 'ratings.0': { $exists: false } })
             .select('title ratings')
             .lean();
killedBy: Analytics Controller - getEventWiseRatings should return empty array when teams have no events with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,8 +4,8 @@
        "team1",
        "team2",

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:61:49
             .select('title ratings')
             .lean();
 
-        const ratingsData = events.map(event => {
-            const avgRating = event.ratings.reduce((acc, r) => acc + r.rating, 0) / event.ratings.length;
-            return {
-                name: event.title,
-                rating: parseFloat(avgRating.toFixed(1)),
-            };
-        });
+        const ratingsData = events.map(event => {});
 
         res.status(200).json(ratingsData);
killedBy: Analytics Controller - getEventWiseRatings should return ratings data for single event with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   Object {
-     "name": "Tech Conference",

[Killed] ArrowFunction
controllers/organizer_controllers/analytics.controller.js:62:52
             .lean();
 
         const ratingsData = events.map(event => {
-            const avgRating = event.ratings.reduce((acc, r) => acc + r.rating, 0) / event.ratings.length;
+            const avgRating = event.ratings.reduce(() => undefined, 0) / event.ratings.length;
             return {
                 name: event.title,
killedBy: Analytics Controller - getEventWiseRatings should return ratings data for single event with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
    Object {
      "name": "Tech Conference",

[Killed] ArithmeticOperator
controllers/organizer_controllers/analytics.controller.js:62:64
             .lean();
 
         const ratingsData = events.map(event => {
-            const avgRating = event.ratings.reduce((acc, r) => acc + r.rating, 0) / event.ratings.length;
+            const avgRating = event.ratings.reduce((acc, r) => acc - r.rating, 0) / event.ratings.length;
             return {
                 name: event.title,
killedBy: Analytics Controller - getEventWiseRatings should return ratings data for single event with ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
    Object {
      "name": "Tech Conference",

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:70:21
         });
 
         res.status(200).json(ratingsData);
-    } catch (error) {
-        res.status(500).json({ message: "Failed to fetch event-wise ratings", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Analytics Controller - getEventWiseRatings should handle errors when Team.find fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:71:30
 
         res.status(200).json(ratingsData);
     } catch (error) {
-        res.status(500).json({ message: "Failed to fetch event-wise ratings", error: error.message });
+        res.status(500).json({});
     }
 };
killedBy: Analytics Controller - getEventWiseRatings should handle errors when Team.find fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Database error",
-   "message": "Failed to fetch event-wise ratings",

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:75:55
     }
 };
 
-export const getAttendanceRatio = async (req, res) => {
-    // This is a complex query and is mocked for now.
-    // A real implementation would require aggregation pipelines on registration and check-in data.
-    const attendanceRatioData = [
-        { month: 'Jan', registered: 450, attended: 398 },
-        { month: 'Feb', registered: 380, attended: 345 },
-        { month: 'Mar', registered: 520, attended: 490 },
-        { month: 'Apr', registered: 600, attended: 565 },
-        { month: 'May', registered: 480, attended: 430 },
-        { month: 'Jun', registered: 550, attended: 520 },
-    ];
-    res.status(200).json(attendanceRatioData);
-};
+export const getAttendanceRatio = async (req, res) => {};
 
 export const getEventPerformance = async (req, res) => {
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ArrayDeclaration
controllers/organizer_controllers/analytics.controller.js:78:33
 export const getAttendanceRatio = async (req, res) => {
     // This is a complex query and is mocked for now.
     // A real implementation would require aggregation pipelines on registration and check-in data.
-    const attendanceRatioData = [
-        { month: 'Jan', registered: 450, attended: 398 },
-        { month: 'Feb', registered: 380, attended: 345 },
-        { month: 'Mar', registered: 520, attended: 490 },
-        { month: 'Apr', registered: 600, attended: 565 },
-        { month: 'May', registered: 480, attended: 430 },
-        { month: 'Jun', registered: 550, attended: 520 },
-    ];
+    const attendanceRatioData = [];
     res.status(200).json(attendanceRatioData);
 };
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Object {
-     "attended": 398,

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:79:18
     // This is a complex query and is mocked for now.
     // A real implementation would require aggregation pipelines on registration and check-in data.
     const attendanceRatioData = [
-        { month: 'Jan', registered: 450, attended: 398 },
+        { month: "", registered: 450, attended: 398 },
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:79:9
     // This is a complex query and is mocked for now.
     // A real implementation would require aggregation pipelines on registration and check-in data.
     const attendanceRatioData = [
-        { month: 'Jan', registered: 450, attended: 398 },
+        {},
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,7 @@
  Array [
-   Object {

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:80:18
     // A real implementation would require aggregation pipelines on registration and check-in data.
     const attendanceRatioData = [
         { month: 'Jan', registered: 450, attended: 398 },
-        { month: 'Feb', registered: 380, attended: 345 },
+        { month: "", registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
         { month: 'Apr', registered: 600, attended: 565 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      "month": "Jan",
      "registered": 450,

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:80:9
     // A real implementation would require aggregation pipelines on registration and check-in data.
     const attendanceRatioData = [
         { month: 'Jan', registered: 450, attended: 398 },
-        { month: 'Feb', registered: 380, attended: 345 },
+        {},
         { month: 'Mar', registered: 520, attended: 490 },
         { month: 'Apr', registered: 600, attended: 565 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,15 +2,11 @@
    Object {
      "attended": 398,

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:82:18
         { month: 'Jan', registered: 450, attended: 398 },
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
-        { month: 'Apr', registered: 600, attended: 565 },
+        { month: "", registered: 600, attended: 565 },
         { month: 'May', registered: 480, attended: 430 },
         { month: 'Jun', registered: 550, attended: 520 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -14,11 +14,11 @@
      "month": "Mar",
      "registered": 520,

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:82:9
         { month: 'Jan', registered: 450, attended: 398 },
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
-        { month: 'Apr', registered: 600, attended: 565 },
+        {},
         { month: 'May', registered: 480, attended: 430 },
         { month: 'Jun', registered: 550, attended: 520 },
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,15 +12,11 @@
    Object {
      "attended": 490,

[Killed] ObjectLiteral
controllers/organizer_controllers/analytics.controller.js:83:9
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
         { month: 'Apr', registered: 600, attended: 565 },
-        { month: 'May', registered: 480, attended: 430 },
+        {},
         { month: 'Jun', registered: 550, attended: 520 },
     ];
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,15 +17,11 @@
    Object {
      "attended": 565,
