[NoCoverage] BlockStatement
controllers/admin.controller.js:9:102
 import SponsorAd from '../models/sponsorad.model.js';
 import Inbox from '../models/inbox.model.js';
 
-const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {
-    try {
-        const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
-        const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
-
-        const newInboxEntity = new Inbox({
-            type: 'announcement', 
-            title: title,
-            description: message,
-            from: fromAdminId, 
-            to: [toUserId],    
-            status: 'Sent',
-            message: message,
-        });
-        await newInboxEntity.save();
-    } catch (error) {
-        console.error("Failed to create suspension notification:", error.message);
-    }
-};
+const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {};
 
 export const handleCollegeRegistration = async (req, res) => {

[NoCoverage] BlockStatement
controllers/admin.controller.js:10:9
 import Inbox from '../models/inbox.model.js';
 
 const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {
-    try {
-        const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
-        const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
-
-        const newInboxEntity = new Inbox({
-            type: 'announcement', 
-            title: title,
-            description: message,
-            from: fromAdminId, 
-            to: [toUserId],    
-            status: 'Sent',
-            message: message,
-        });
-        await newInboxEntity.save();
-    } catch (error) {
+    try {} catch (error) {
         console.error("Failed to create suspension notification:", error.message);
     }

[NoCoverage] ConditionalExpression
controllers/admin.controller.js:11:23
 
 const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {
     try {
-        const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
+        const title = false ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
         const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
 

[NoCoverage] EqualityOperator
controllers/admin.controller.js:11:23
 
 const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {
     try {
-        const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
+        const title = action !== 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
         const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
 

[NoCoverage] StringLiteral
controllers/admin.controller.js:12:25
 const createSuspensionNotification = async (fromAdminId, toUserId, entityName, modelType, action) => {
     try {
         const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
-        const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
+        const message = ``;
 
         const newInboxEntity = new Inbox({

[NoCoverage] ObjectLiteral
controllers/admin.controller.js:14:42
         const title = action === 'suspended' ? `URGENT: ${entityName} Halted` : `${entityName} is Active Again`;
         const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
 
-        const newInboxEntity = new Inbox({
-            type: 'announcement', 
-            title: title,
-            description: message,
-            from: fromAdminId, 
-            to: [toUserId],    
-            status: 'Sent',
-            message: message,
-        });
+        const newInboxEntity = new Inbox({});
         await newInboxEntity.save();
     } catch (error) {

[NoCoverage] StringLiteral
controllers/admin.controller.js:15:19
         const message = `Your associated entity (${entityName}, type: ${modelType}) has been forcibly ${action} by a System Administrator. Please contact the Admin for details.`;
 
         const newInboxEntity = new Inbox({
-            type: 'announcement', 
+            type: "", 
             title: title,
             description: message,

[NoCoverage] StringLiteral
controllers/admin.controller.js:20:21
             description: message,
             from: fromAdminId, 
             to: [toUserId],    
-            status: 'Sent',
+            status: "",
             message: message,
         });

[NoCoverage] BlockStatement
controllers/admin.controller.js:24:21
             message: message,
         });
         await newInboxEntity.save();
-    } catch (error) {
-        console.error("Failed to create suspension notification:", error.message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/admin.controller.js:25:23
         });
         await newInboxEntity.save();
     } catch (error) {
-        console.error("Failed to create suspension notification:", error.message);
+        console.error("", error.message);
     }
 };

[Killed] BlockStatement
controllers/admin.controller.js:35:57
         const { status } = req.body;
         const adminId = req.user.id;
 
-        if (!['Approved', 'Rejected'].includes(status)) {
-            return res.status(400).json({ message: "Invalid status provided. Must be 'Approved' or 'Rejected'." });
-        }
+        if (!['Approved', 'Rejected'].includes(status)) {}
 
         const updatedCollege = await College.findOneAndUpdate(
killedBy: Admin Controller handleCollegeRegistration should return 400 if status is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/admin.controller.js:35:13
         const { status } = req.body;
         const adminId = req.user.id;
 
-        if (!['Approved', 'Rejected'].includes(status)) {
+        if (['Approved', 'Rejected'].includes(status)) {
             return res.status(400).json({ message: "Invalid status provided. Must be 'Approved' or 'Rejected'." });
         }
killedBy: Admin Controller handleCollegeRegistration should return 400 if status is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
controllers/admin.controller.js:36:41
         const adminId = req.user.id;
 
         if (!['Approved', 'Rejected'].includes(status)) {
-            return res.status(400).json({ message: "Invalid status provided. Must be 'Approved' or 'Rejected'." });
+            return res.status(400).json({});
         }
 
killedBy: Admin Controller handleCollegeRegistration should return 400 if status is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid status provided. Must be 'Approved' or 'Rejected'.",
- }

[Killed] BooleanLiteral
controllers/admin.controller.js:50:13
             },
             { new: true, runValidators: true }
         ).select('-__v'); 
-        if (!updatedCollege) {
+        if (updatedCollege) {
             const college = await College.findById(collegeId);
             if (college && college.status !== 'Pending') {
killedBy: Admin Controller handleCollegeRegistration should successfully approve college registration
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/admin.controller.js:50:13
             },
             { new: true, runValidators: true }
         ).select('-__v'); 
-        if (!updatedCollege) {
+        if (true) {
             const college = await College.findById(collegeId);
             if (college && college.status !== 'Pending') {
killedBy: Admin Controller handleCollegeRegistration should successfully approve college registration
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] EqualityOperator
controllers/admin.controller.js:52:28
         ).select('-__v'); 
         if (!updatedCollege) {
             const college = await College.findById(collegeId);
-            if (college && college.status !== 'Pending') {
+            if (college && college.status === 'Pending') {
                 return res.status(409).json({ 
                     message: `Conflict: College registration is already ${college.status}. Cannot be updated from Pending.` 
killedBy: Admin Controller handleCollegeRegistration should return 409 if college is already processed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] LogicalOperator
controllers/admin.controller.js:52:17
         ).select('-__v'); 
         if (!updatedCollege) {
             const college = await College.findById(collegeId);
-            if (college && college.status !== 'Pending') {
+            if (college || college.status !== 'Pending') {
                 return res.status(409).json({ 
                     message: `Conflict: College registration is already ${college.status}. Cannot be updated from Pending.` 
killedBy: Admin Controller handleCollegeRegistration should return 404 if college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:65:21
             college: updatedCollege
         });
 
-    } catch (error) {
-        console.error("Error handling college registration:", error);
-        if (error.name === 'CastError') {
-            return res.status(400).json({ message: "Invalid College ID format." });
-        }
-        res.status(500).json({ message: 'Server error.', error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller handleCollegeRegistration should return 400 for invalid college ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
controllers/admin.controller.js:67:13
 
     } catch (error) {
         console.error("Error handling college registration:", error);
-        if (error.name === 'CastError') {
+        if (true) {
             return res.status(400).json({ message: "Invalid College ID format." });
         }
killedBy: Admin Controller handleCollegeRegistration should return 500 on server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 400

Number of calls: 1

[Killed] EqualityOperator
controllers/admin.controller.js:67:13
 
     } catch (error) {
         console.error("Error handling college registration:", error);
-        if (error.name === 'CastError') {
+        if (error.name !== 'CastError') {
             return res.status(400).json({ message: "Invalid College ID format." });
         }
killedBy: Admin Controller handleCollegeRegistration should return 400 for invalid college ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:74:57
     }
 };
 
-export const getAllEventsForAdmin = async (req, res) => {
-    try {
-        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: -1 });
-        res.status(200).json(events);
-    } catch (error) {
-        console.error("Error fetching all events for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching events.' });
-    }
-};
+export const getAllEventsForAdmin = async (req, res) => {};
 
 export const getAllUsersForAdmin = async (req, res) => {
killedBy: Admin Controller getAllEventsForAdmin should return all events successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] BlockStatement
controllers/admin.controller.js:75:9
 };
 
 export const getAllEventsForAdmin = async (req, res) => {
-    try {
-        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: -1 });
-        res.status(200).json(events);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching all events for admin:", error);
         res.status(500).json({ message: 'Server error while fetching events.' });
killedBy: Admin Controller getAllEventsForAdmin should return all events successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] UnaryOperator
controllers/admin.controller.js:76:121
 
 export const getAllEventsForAdmin = async (req, res) => {
     try {
-        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: -1 });
+        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: +1 });
         res.status(200).json(events);
     } catch (error) {
killedBy: Admin Controller getAllEventsForAdmin should return all events successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "createdAt": -1,
+   "createdAt": 1,

[Killed] MethodExpression
controllers/admin.controller.js:76:30
 
 export const getAllEventsForAdmin = async (req, res) => {
     try {
-        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: -1 });
+        const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name');
         res.status(200).json(events);
     } catch (error) {
killedBy: Admin Controller getAllEventsForAdmin should return all events successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": -1}

Number of calls: 0

[Killed] BlockStatement
controllers/admin.controller.js:78:21
     try {
         const events = await Event.find({}).populate('college', 'name').populate('createdBy', 'name').sort({ createdAt: -1 });
         res.status(200).json(events);
-    } catch (error) {
-        console.error("Error fetching all events for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching events.' });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller getAllEventsForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/admin.controller.js:80:30
         res.status(200).json(events);
     } catch (error) {
         console.error("Error fetching all events for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching events.' });
+        res.status(500).json({});
     }
 };
killedBy: Admin Controller getAllEventsForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Server error while fetching events.",
- }

[Killed] StringLiteral
controllers/admin.controller.js:80:41
         res.status(200).json(events);
     } catch (error) {
         console.error("Error fetching all events for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching events.' });
+        res.status(500).json({ message: "" });
     }
 };
killedBy: Admin Controller getAllEventsForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Server error while fetching events.",
+   "message": "",

[Killed] BlockStatement
controllers/admin.controller.js:84:56
     }
 };
 
-export const getAllUsersForAdmin = async (req, res) => {
-    try {
-        // Fetch all users except the admin making the request
-        const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
-        res.status(200).json(users);
-    } catch (error) {
-        console.error("Error fetching all users for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching users.' });
-    }
-};
+export const getAllUsersForAdmin = async (req, res) => {};
 
 export const getAllAdsForAdmin = async (req, res) => {
killedBy: Admin Controller getAllUsersForAdmin should return all users except current admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": {"$ne": "adminId123"}}

Number of calls: 0

[Killed] BlockStatement
controllers/admin.controller.js:85:9
 };
 
 export const getAllUsersForAdmin = async (req, res) => {
-    try {
-        // Fetch all users except the admin making the request
-        const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
-        res.status(200).json(users);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching all users for admin:", error);
         res.status(500).json({ message: 'Server error while fetching users.' });
killedBy: Admin Controller getAllUsersForAdmin should return all users except current admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": {"$ne": "adminId123"}}

Number of calls: 0

[Killed] MethodExpression
controllers/admin.controller.js:87:29
 export const getAllUsersForAdmin = async (req, res) => {
     try {
         // Fetch all users except the admin making the request
-        const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
+        const users = await User.find({
+  _id: {
+    $ne: req.user.id
+  }
+}).populate('college', 'name');
         res.status(200).json(users);
     } catch (error) {
killedBy: Admin Controller getAllUsersForAdmin should return all users except current admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": -1}

Number of calls: 0

[Killed] UnaryOperator
controllers/admin.controller.js:87:116
 export const getAllUsersForAdmin = async (req, res) => {
     try {
         // Fetch all users except the admin making the request
-        const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
+        const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: +1 });
         res.status(200).json(users);
     } catch (error) {
killedBy: Admin Controller getAllUsersForAdmin should return all users except current admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "createdAt": -1,
+   "createdAt": 1,

[Killed] BlockStatement
controllers/admin.controller.js:89:21
         // Fetch all users except the admin making the request
         const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
         res.status(200).json(users);
-    } catch (error) {
-        console.error("Error fetching all users for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching users.' });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller getAllUsersForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/admin.controller.js:90:23
         const users = await User.find({ _id: { $ne: req.user.id } }).populate('college', 'name').sort({ createdAt: -1 });
         res.status(200).json(users);
     } catch (error) {
-        console.error("Error fetching all users for admin:", error);
+        console.error("", error);
         res.status(500).json({ message: 'Server error while fetching users.' });
     }

[Killed] ObjectLiteral
controllers/admin.controller.js:91:30
         res.status(200).json(users);
     } catch (error) {
         console.error("Error fetching all users for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching users.' });
+        res.status(500).json({});
     }
 };
killedBy: Admin Controller getAllUsersForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Server error while fetching users.",
- }

[Killed] BlockStatement
controllers/admin.controller.js:95:54
     }
 };
 
-export const getAllAdsForAdmin = async (req, res) => {
-    try {
-        const ads = await SponsorAd.find({})
-            .populate({
-                path: 'sponsorId',
-                select: 'profile.name _id',
-                // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
-                transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
-                    return doc;
-                }
-            })
-            .sort({ createdAt: -1 });
-        res.status(200).json(ads);
-    } catch (error) {
-        console.error("Error fetching all ads for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching ads.' });
-    }
-};
+export const getAllAdsForAdmin = async (req, res) => {};
 
 
killedBy: Admin Controller getAllAdsForAdmin should return all ads with sponsor info
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] BlockStatement
controllers/admin.controller.js:96:9
 };
 
 export const getAllAdsForAdmin = async (req, res) => {
-    try {
-        const ads = await SponsorAd.find({})
-            .populate({
-                path: 'sponsorId',
-                select: 'profile.name _id',
-                // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
-                transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
-                    return doc;
-                }
-            })
-            .sort({ createdAt: -1 });
-        res.status(200).json(ads);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching all ads for admin:", error);
         res.status(500).json({ message: 'Server error while fetching ads.' });
killedBy: Admin Controller getAllAdsForAdmin should return all ads with sponsor info
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] MethodExpression
controllers/admin.controller.js:97:27
 
 export const getAllAdsForAdmin = async (req, res) => {
     try {
-        const ads = await SponsorAd.find({})
-            .populate({
-                path: 'sponsorId',
-                select: 'profile.name _id',
-                // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
-                transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
-                    return doc;
-                }
-            })
-            .sort({ createdAt: -1 });
+        const ads = await SponsorAd.find({}).populate({
+  path: 'sponsorId',
+  select: 'profile.name _id',
+  // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
+  transform: doc => {
+    if (!doc) return {
+      _id: null,
+      profile: {
+        name: 'Deleted Sponsor'
+      }
+    };
+    return doc;
+  }
+});
         res.status(200).json(ads);
     } catch (error) {
killedBy: Admin Controller getAllAdsForAdmin should return all ads with sponsor info
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": -1}

Number of calls: 0

[Killed] StringLiteral
controllers/admin.controller.js:100:25
         const ads = await SponsorAd.find({})
             .populate({
                 path: 'sponsorId',
-                select: 'profile.name _id',
+                select: "",
                 // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
                 transform: (doc) => {
killedBy: Admin Controller getAllAdsForAdmin should return all ads with sponsor info
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": "sponsorId",
-   "select": "profile.name _id",

[Killed] BlockStatement
controllers/admin.controller.js:102:37
                 path: 'sponsorId',
                 select: 'profile.name _id',
                 // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
-                transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
-                    return doc;
-                }
+                transform: (doc) => {}
             })
             .sort({ createdAt: -1 });
killedBy: Admin Controller getAllAdsForAdmin should handle deleted sponsor transform
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": null, "profile": {"name": "Deleted Sponsor"}}
Received: undefined

[Killed] ConditionalExpression
controllers/admin.controller.js:103:25
                 select: 'profile.name _id',
                 // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
                 transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
+                    if (true) return { _id: null, profile: { name: 'Deleted Sponsor' } };
                     return doc;
                 }
killedBy: Admin Controller getAllAdsForAdmin should handle existing sponsor transform
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "_id": "sponsor1",
+   "_id": null,

[Killed] BooleanLiteral
controllers/admin.controller.js:103:25
                 select: 'profile.name _id',
                 // The transform function must handle cases where the sponsor document might be null (e.g., deleted user)
                 transform: (doc) => {
-                    if (!doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
+                    if (doc) return { _id: null, profile: { name: 'Deleted Sponsor' } };
                     return doc;
                 }
killedBy: Admin Controller getAllAdsForAdmin should handle deleted sponsor transform
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_id": null, "profile": {"name": "Deleted Sponsor"}}
Received: null

[Killed] BlockStatement
controllers/admin.controller.js:109:21
             })
             .sort({ createdAt: -1 });
         res.status(200).json(ads);
-    } catch (error) {
-        console.error("Error fetching all ads for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching ads.' });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller getAllAdsForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/admin.controller.js:111:41
         res.status(200).json(ads);
     } catch (error) {
         console.error("Error fetching all ads for admin:", error);
-        res.status(500).json({ message: 'Server error while fetching ads.' });
+        res.status(500).json({ message: "" });
     }
 };
killedBy: Admin Controller getAllAdsForAdmin should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Server error while fetching ads.",
+   "message": "",

[Killed] StringLiteral
controllers/admin.controller.js:127:25
         const suspendedCollege = await College.findOneAndUpdate(
             {
                 _id: collegeId,
-                status: 'Approved' 
+                status: "" 
             },
             {
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "_id": "college123",
-   "status": "Approved",
