[Killed] ObjectLiteral
controllers/admin.controller.js:135:13
                     approvedBy: adminId 
                 }
             },
-            { new: true }
+            {}
         );
 
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"_id": "college123", "status": "Approved"},
  {"$set": {"approvedBy": "adminId123", "status": "Suspended"}},
- Object {

[Killed] BlockStatement
controllers/admin.controller.js:138:32
             { new: true }
         );
 
-        if (!suspendedCollege) {
-            // Check the current status of the college to give a specific error message
-            const collegeCheck = await College.findById(collegeId).select('status');
-            
-            if (collegeCheck) {
-                if (collegeCheck.status === 'Suspended') {
-                    // NEW CHECK: Conflict if status is already Suspended
-                    return res.status(409).json({
-                        message: `Conflict: College registration is already Suspended. No action taken.`
-                    });
-                }
-                if (collegeCheck.status !== 'Approved') {
-                    // Conflict if status is Rejected or Pending (the original check)
-                    return res.status(409).json({ 
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Approved colleges can be suspended.` 
-                    });
-                }
-            }
-            
-            // If ID is valid but no document found (deleted, or ID is wrong)
-            return res.status(404).json({ message: "College registration not found." });
-        }
+        if (!suspendedCollege) {}
         
         // --- 2. Suspension of Related Entities (UpdateMany) ---
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college is already suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received
       1: 200
       2: 500

Number of calls: 2

[Killed] BooleanLiteral
controllers/admin.controller.js:138:13
             { new: true }
         );
 
-        if (!suspendedCollege) {
+        if (suspendedCollege) {
             // Check the current status of the college to give a specific error message
             const collegeCheck = await College.findById(collegeId).select('status');
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"college": "college123", "status": {"$ne": "suspended"}}, {"$set": {"status": "suspended"}}

Number of calls: 0

[Killed] ConditionalExpression
controllers/admin.controller.js:142:17
             // Check the current status of the college to give a specific error message
             const collegeCheck = await College.findById(collegeId).select('status');
             
-            if (collegeCheck) {
+            if (true) {
                 if (collegeCheck.status === 'Suspended') {
                     // NEW CHECK: Conflict if status is already Suspended
killedBy: Admin Controller suspendCollegeAndEntities should return 404 if college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:142:31
             // Check the current status of the college to give a specific error message
             const collegeCheck = await College.findById(collegeId).select('status');
             
-            if (collegeCheck) {
-                if (collegeCheck.status === 'Suspended') {
-                    // NEW CHECK: Conflict if status is already Suspended
-                    return res.status(409).json({
-                        message: `Conflict: College registration is already Suspended. No action taken.`
-                    });
-                }
-                if (collegeCheck.status !== 'Approved') {
-                    // Conflict if status is Rejected or Pending (the original check)
-                    return res.status(409).json({ 
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Approved colleges can be suspended.` 
-                    });
-                }
-            }
+            if (collegeCheck) {}
             
             // If ID is valid but no document found (deleted, or ID is wrong)
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college is already suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/admin.controller.js:143:21
             const collegeCheck = await College.findById(collegeId).select('status');
             
             if (collegeCheck) {
-                if (collegeCheck.status === 'Suspended') {
+                if (true) {
                     // NEW CHECK: Conflict if status is already Suspended
                     return res.status(409).json({
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college status is not Approved
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Conflict: College status is currently \"Pending\". Only Approved colleges can be suspended.",
+   "message": "Conflict: College registration is already Suspended. No action taken.",

[Killed] ConditionalExpression
controllers/admin.controller.js:143:21
             const collegeCheck = await College.findById(collegeId).select('status');
             
             if (collegeCheck) {
-                if (collegeCheck.status === 'Suspended') {
+                if (false) {
                     // NEW CHECK: Conflict if status is already Suspended
                     return res.status(409).json({
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college is already suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Conflict: College registration is already Suspended. No action taken.",
+   "message": "Conflict: College status is currently \"Suspended\". Only Approved colleges can be suspended.",

[Killed] StringLiteral
controllers/admin.controller.js:146:34
                 if (collegeCheck.status === 'Suspended') {
                     // NEW CHECK: Conflict if status is already Suspended
                     return res.status(409).json({
-                        message: `Conflict: College registration is already Suspended. No action taken.`
+                        message: ``
                     });
                 }
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college is already suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Conflict: College registration is already Suspended. No action taken.",
+   "message": "",

[Killed] ConditionalExpression
controllers/admin.controller.js:149:21
                         message: `Conflict: College registration is already Suspended. No action taken.`
                     });
                 }
-                if (collegeCheck.status !== 'Approved') {
+                if (false) {
                     // Conflict if status is Rejected or Pending (the original check)
                     return res.status(409).json({ 
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college status is not Approved
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:149:57
                         message: `Conflict: College registration is already Suspended. No action taken.`
                     });
                 }
-                if (collegeCheck.status !== 'Approved') {
-                    // Conflict if status is Rejected or Pending (the original check)
-                    return res.status(409).json({ 
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Approved colleges can be suspended.` 
-                    });
-                }
+                if (collegeCheck.status !== 'Approved') {}
             }
             
killedBy: Admin Controller suspendCollegeAndEntities should return 409 if college status is not Approved
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] ObjectLiteral
controllers/admin.controller.js:164:43
         // --- 2. Suspension of Related Entities (UpdateMany) ---
         
         const userResult = await User.updateMany(
-            { college: collegeId, status: { $ne: 'suspended' } }, // Optional: Only update if not already suspended
+            { college: collegeId, status: {} }, // Optional: Only update if not already suspended
             { $set: { status: 'suspended' } } 
         );
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "college": "college123",
-   "status": Object {

[Killed] ObjectLiteral
controllers/admin.controller.js:165:13
         
         const userResult = await User.updateMany(
             { college: collegeId, status: { $ne: 'suspended' } }, // Optional: Only update if not already suspended
-            { $set: { status: 'suspended' } } 
+            {} 
         );
 
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"college": "college123", "status": {"$ne": "suspended"}},
- Object {
-   "$set": Object {

[Killed] StringLiteral
controllers/admin.controller.js:165:31
         
         const userResult = await User.updateMany(
             { college: collegeId, status: { $ne: 'suspended' } }, // Optional: Only update if not already suspended
-            { $set: { status: 'suspended' } } 
+            { $set: { status: "" } } 
         );
 
killedBy: Admin Controller suspendCollegeAndEntities should successfully suspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"college": "college123", "status": {"$ne": "suspended"}},
  Object {
    "$set": Object {

[Killed] BlockStatement
controllers/admin.controller.js:183:21
             }
         });
 
-    } catch (error) {
-        console.error("Error suspending college and entities:", error);
-        if (error.name === 'CastError') {
-            return res.status(400).json({ message: "Invalid College ID format." });
-        }
-        res.status(500).json({ message: 'Server error.', error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller suspendCollegeAndEntities should return 400 for invalid college ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Survived] StringLiteral
controllers/admin.controller.js:184:23
         });
 
     } catch (error) {
-        console.error("Error suspending college and entities:", error);
+        console.error("", error);
         if (error.name === 'CastError') {
             return res.status(400).json({ message: "Invalid College ID format." });

[Killed] ConditionalExpression
controllers/admin.controller.js:185:13
 
     } catch (error) {
         console.error("Error suspending college and entities:", error);
-        if (error.name === 'CastError') {
+        if (false) {
             return res.status(400).json({ message: "Invalid College ID format." });
         }
killedBy: Admin Controller suspendCollegeAndEntities should return 400 for invalid college ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/admin.controller.js:185:13
 
     } catch (error) {
         console.error("Error suspending college and entities:", error);
-        if (error.name === 'CastError') {
+        if (error.name !== 'CastError') {
             return res.status(400).json({ message: "Invalid College ID format." });
         }
killedBy: Admin Controller suspendCollegeAndEntities should return 400 for invalid college ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] StringLiteral
controllers/admin.controller.js:188:41
         if (error.name === 'CastError') {
             return res.status(400).json({ message: "Invalid College ID format." });
         }
-        res.status(500).json({ message: 'Server error.', error: error.message });
+        res.status(500).json({ message: "", error: error.message });
     }
 };
killedBy: Admin Controller suspendCollegeAndEntities should return 500 on server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database error",
-   "message": "Server error.",

[Killed] StringLiteral
controllers/admin.controller.js:205:29
             },
             {
                 $set: { 
-                    status: 'Approved', // Revert to Approved status
+                    status: "", // Revert to Approved status
                     approvedBy: adminId 
                 }
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"_id": "college123", "status": "Suspended"},
  Object {
    "$set": Object {

[Killed] ConditionalExpression
controllers/admin.controller.js:212:13
             { new: true }
         );
 
-        if (!unsuspendedCollege) {
+        if (false) {
             const collegeCheck = await College.findById(collegeId).select('status');
             if (collegeCheck) {
killedBy: Admin Controller unsuspendCollegeAndEntities should return 409 if college status is not Suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received
       1: 200
       2: 500

Number of calls: 2

[Killed] BlockStatement
controllers/admin.controller.js:212:34
             { new: true }
         );
 
-        if (!unsuspendedCollege) {
-            const collegeCheck = await College.findById(collegeId).select('status');
-            if (collegeCheck) {
-                if (collegeCheck.status !== 'Suspended') {
-                    return res.status(409).json({
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Suspended colleges can be unsuspended.`
-                    });
-                }
-            }
-            return res.status(404).json({ message: "Suspended college registration not found." });
-        }
+        if (!unsuspendedCollege) {}
         
         // --- 2. Un-suspension of Related Entities ---
killedBy: Admin Controller unsuspendCollegeAndEntities should return 409 if college status is not Suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received
       1: 200
       2: 500

Number of calls: 2

[Survived] StringLiteral
controllers/admin.controller.js:213:75
         );
 
         if (!unsuspendedCollege) {
-            const collegeCheck = await College.findById(collegeId).select('status');
+            const collegeCheck = await College.findById(collegeId).select("");
             if (collegeCheck) {
                 if (collegeCheck.status !== 'Suspended') {

[Killed] BlockStatement
controllers/admin.controller.js:214:31
 
         if (!unsuspendedCollege) {
             const collegeCheck = await College.findById(collegeId).select('status');
-            if (collegeCheck) {
-                if (collegeCheck.status !== 'Suspended') {
-                    return res.status(409).json({
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Suspended colleges can be unsuspended.`
-                    });
-                }
-            }
+            if (collegeCheck) {}
             return res.status(404).json({ message: "Suspended college registration not found." });
         }
killedBy: Admin Controller unsuspendCollegeAndEntities should return 409 if college status is not Suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/admin.controller.js:214:17
 
         if (!unsuspendedCollege) {
             const collegeCheck = await College.findById(collegeId).select('status');
-            if (collegeCheck) {
+            if (true) {
                 if (collegeCheck.status !== 'Suspended') {
                     return res.status(409).json({
killedBy: Admin Controller unsuspendCollegeAndEntities should return 404 if college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:215:58
         if (!unsuspendedCollege) {
             const collegeCheck = await College.findById(collegeId).select('status');
             if (collegeCheck) {
-                if (collegeCheck.status !== 'Suspended') {
-                    return res.status(409).json({
-                        message: `Conflict: College status is currently "${collegeCheck.status}". Only Suspended colleges can be unsuspended.`
-                    });
-                }
+                if (collegeCheck.status !== 'Suspended') {}
             }
             return res.status(404).json({ message: "Suspended college registration not found." });
killedBy: Admin Controller unsuspendCollegeAndEntities should return 409 if college status is not Suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/admin.controller.js:215:21
         if (!unsuspendedCollege) {
             const collegeCheck = await College.findById(collegeId).select('status');
             if (collegeCheck) {
-                if (collegeCheck.status !== 'Suspended') {
+                if (false) {
                     return res.status(409).json({
                         message: `Conflict: College status is currently "${collegeCheck.status}". Only Suspended colleges can be unsuspended.`
killedBy: Admin Controller unsuspendCollegeAndEntities should return 409 if college status is not Suspended
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 404

Number of calls: 1

[Killed] ObjectLiteral
controllers/admin.controller.js:221:41
                     });
                 }
             }
-            return res.status(404).json({ message: "Suspended college registration not found." });
+            return res.status(404).json({});
         }
         
killedBy: Admin Controller unsuspendCollegeAndEntities should return 404 if college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Suspended college registration not found.",
- }

[Killed] StringLiteral
controllers/admin.controller.js:226:43
         
         // --- 2. Un-suspension of Related Entities ---
         const userResult = await User.updateMany(
-            { college: collegeId, status: 'suspended' },
+            { college: collegeId, status: "" },
             { $set: { status: 'active' } } 
         );
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "college": "college123",
-   "status": "suspended",

[Killed] ObjectLiteral
controllers/admin.controller.js:227:13
         // --- 2. Un-suspension of Related Entities ---
         const userResult = await User.updateMany(
             { college: collegeId, status: 'suspended' },
-            { $set: { status: 'active' } } 
+            {} 
         );
 
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"college": "college123", "status": "suspended"},
- Object {
-   "$set": Object {

[Killed] ObjectLiteral
controllers/admin.controller.js:233:13
         // Note: You might have different 'active' states for events (e.g., 'Published'). Adjust if needed.
         const eventResult = await Event.updateMany(
             { college: collegeId, status: 'suspended' },
-            { $set: { status: 'published' } } 
+            {} 
         );
 
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"college": "college123", "status": "suspended"},
- Object {
-   "$set": Object {

[Killed] StringLiteral
controllers/admin.controller.js:233:31
         // Note: You might have different 'active' states for events (e.g., 'Published'). Adjust if needed.
         const eventResult = await Event.updateMany(
             { college: collegeId, status: 'suspended' },
-            { $set: { status: 'published' } } 
+            { $set: { status: "" } } 
         );
 
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"college": "college123", "status": "suspended"},
  Object {
    "$set": Object {

[Killed] StringLiteral
controllers/admin.controller.js:237:22
         );
 
         res.status(200).json({
-            message: `College '${unsuspendedCollege.name}' successfully unsuspended, and related entities reactivated.`,
+            message: ``,
             summary: { collegeId, usersUnsuspended: userResult.modifiedCount, eventsUnsuspended: eventResult.modifiedCount }
         });
killedBy: Admin Controller unsuspendCollegeAndEntities should successfully unsuspend college and related entities
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "message": "College 'Test College' successfully unsuspended, and related entities reactivated.",

[Killed] BlockStatement
controllers/admin.controller.js:241:21
             summary: { collegeId, usersUnsuspended: userResult.modifiedCount, eventsUnsuspended: eventResult.modifiedCount }
         });
 
-    } catch (error) {
-        console.error("Error unsuspending college and entities:", error);
-        res.status(500).json({ message: 'Server error.', error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Controller unsuspendCollegeAndEntities should return 500 on server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/admin.controller.js:243:41
 
     } catch (error) {
         console.error("Error unsuspending college and entities:", error);
-        res.status(500).json({ message: 'Server error.', error: error.message });
+        res.status(500).json({ message: "", error: error.message });
     }
 };
killedBy: Admin Controller unsuspendCollegeAndEntities should return 500 on server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database error",
-   "message": "Server error.",

[Killed] ObjectLiteral
controllers/admin.controller.js:253:29
         const { targetStatus } = req.body; 
         const adminId = req.user.id;
 
-        const validModels = {
-            'user': { Model: User, activeStatus: 'active', suspendedStatus: 'suspended' },
-            'event': { Model: Event, activeStatus: 'published', suspendedStatus: 'suspended' },
-            'ad': { Model: SponsorAd, activeStatus: 'Published', suspendedStatus: 'Suspended' }
-        };
+        const validModels = {};
 
         const config = validModels[modelType];
killedBy: Admin Controller toggleSuspension should suspend a user and send notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user123", {"status": "suspended"}, {"new": true, "runValidators": true}

Number of calls: 0

[Survived] StringLiteral
controllers/admin.controller.js:255:52
 
         const validModels = {
             'user': { Model: User, activeStatus: 'active', suspendedStatus: 'suspended' },
-            'event': { Model: Event, activeStatus: 'published', suspendedStatus: 'suspended' },
+            'event': { Model: Event, activeStatus: "", suspendedStatus: 'suspended' },
             'ad': { Model: SponsorAd, activeStatus: 'Published', suspendedStatus: 'Suspended' }
         };

[Killed] ObjectLiteral
controllers/admin.controller.js:256:19
         const validModels = {
             'user': { Model: User, activeStatus: 'active', suspendedStatus: 'suspended' },
             'event': { Model: Event, activeStatus: 'published', suspendedStatus: 'suspended' },
-            'ad': { Model: SponsorAd, activeStatus: 'Published', suspendedStatus: 'Suspended' }
+            'ad': {}
         };
 
killedBy: Admin Controller toggleSuspension should suspend an ad and notify sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ad123", {"status": "Suspended"}, {"new": true, "runValidators": true}

Number of calls: 0

[Killed] StringLiteral
controllers/admin.controller.js:256:53
         const validModels = {
             'user': { Model: User, activeStatus: 'active', suspendedStatus: 'suspended' },
             'event': { Model: Event, activeStatus: 'published', suspendedStatus: 'suspended' },
-            'ad': { Model: SponsorAd, activeStatus: 'Published', suspendedStatus: 'Suspended' }
+            'ad': { Model: SponsorAd, activeStatus: "", suspendedStatus: 'Suspended' }
         };
 
killedBy: Admin Controller toggleSuspension should activate an ad
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "ad123",
  Object {
-   "status": "Published",

[Killed] ConditionalExpression
controllers/admin.controller.js:260:13
         };
 
         const config = validModels[modelType];
-        if (!config || !['suspended', 'active', 'Published', 'Suspended'].includes(targetStatus)) {
+        if (false) {
             return res.status(400).json({ message: "Invalid model type or targetStatus specified." });
         }
killedBy: Admin Controller toggleSuspension should return 400 for invalid model type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/admin.controller.js:260:99
         };
 
         const config = validModels[modelType];
-        if (!config || !['suspended', 'active', 'Published', 'Suspended'].includes(targetStatus)) {
-            return res.status(400).json({ message: "Invalid model type or targetStatus specified." });
-        }
+        if (!config || !['suspended', 'active', 'Published', 'Suspended'].includes(targetStatus)) {}
         
         let finalStatus;
killedBy: Admin Controller toggleSuspension should return 400 for invalid model type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] StringLiteral
controllers/admin.controller.js:261:52
 
         const config = validModels[modelType];
         if (!config || !['suspended', 'active', 'Published', 'Suspended'].includes(targetStatus)) {
-            return res.status(400).json({ message: "Invalid model type or targetStatus specified." });
+            return res.status(400).json({ message: "" });
         }
         
killedBy: Admin Controller toggleSuspension should return 400 for invalid model type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Invalid model type or targetStatus specified.",
+   "message": "",

[Killed] ConditionalExpression
controllers/admin.controller.js:265:13
         }
         
         let finalStatus;
-        if (modelType === 'ad') {
+        if (false) {
             finalStatus = targetStatus === 'suspended' ? config.suspendedStatus : config.activeStatus;
         } else {
killedBy: Admin Controller toggleSuspension should suspend an ad and notify sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "ad123",
  Object {
-   "status": "Suspended",
