[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:83:18
         { month: 'Feb', registered: 380, attended: 345 },
         { month: 'Mar', registered: 520, attended: 490 },
         { month: 'Apr', registered: 600, attended: 565 },
-        { month: 'May', registered: 480, attended: 430 },
+        { month: "", registered: 480, attended: 430 },
         { month: 'Jun', registered: 550, attended: 520 },
     ];
killedBy: Analytics Controller - getAttendanceRatio should return mocked attendance ratio data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -19,11 +19,11 @@
      "month": "Apr",
      "registered": 600,

[Killed] BlockStatement
controllers/organizer_controllers/analytics.controller.js:89:56
     res.status(200).json(attendanceRatioData);
 };
 
-export const getEventPerformance = async (req, res) => {
-    // This is a complex query and is mocked for now.
-    // A real implementation would require aggregation pipelines on ratings data.
-    const eventPerformanceData = [
-        { name: 'Excellent', value: 45, color: '#2D3E7E' },
-        { name: 'Good', value: 35, color: '#FDB913' },
-        { name: 'Average', value: 15, color: '#FF9F1C' },
-        { name: 'Poor', value: 5, color: '#F24333' },
-    ];
-    res.status(200).json(eventPerformanceData);
-};
+export const getEventPerformance = async (req, res) => {};
killedBy: Analytics Controller - getEventPerformance should return mocked event performance data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:95:46
     const eventPerformanceData = [
         { name: 'Excellent', value: 45, color: '#2D3E7E' },
         { name: 'Good', value: 35, color: '#FDB913' },
-        { name: 'Average', value: 15, color: '#FF9F1C' },
+        { name: 'Average', value: 15, color: "" },
         { name: 'Poor', value: 5, color: '#F24333' },
     ];
killedBy: Analytics Controller - getEventPerformance should return mocked event performance data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,11 +8,11 @@
      "color": "#FDB913",
      "name": "Good",

[Killed] StringLiteral
controllers/organizer_controllers/analytics.controller.js:96:42
         { name: 'Excellent', value: 45, color: '#2D3E7E' },
         { name: 'Good', value: 35, color: '#FDB913' },
         { name: 'Average', value: 15, color: '#FF9F1C' },
-        { name: 'Poor', value: 5, color: '#F24333' },
+        { name: 'Poor', value: 5, color: "" },
     ];
     res.status(200).json(eventPerformanceData);
killedBy: Analytics Controller - getEventPerformance should return mocked event performance data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,10 +13,10 @@
      "color": "#FF9F1C",
      "name": "Average",
