[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:12:9
 
     const query = { status: "published" };
 
-    if (search) {
+    if (true) {
       query.title = { $regex: search, $options: 'i' };
     }
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,9 +1,13 @@
  Array [
    Object {

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:12:17
 
     const query = { status: "published" };
 
-    if (search) {
-      query.title = { $regex: search, $options: 'i' };
-    }
+    if (search) {}
 
     if (categoryTags) {
killedBy: getListOfAllEvents should filter by search term
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"$options": "i", "$regex": "Hackathon"}
Received: undefined

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:16:9
       query.title = { $regex: search, $options: 'i' };
     }
 
-    if (categoryTags) {
+    if (false) {
       const tags = Array.isArray(categoryTags) ? categoryTags : categoryTags.split(',');
       if (tags.length > 0) {
killedBy: getListOfAllEvents should filter by categoryTags (single string)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"$in": ["Tech"]}
Received: undefined

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:16:9
       query.title = { $regex: search, $options: 'i' };
     }
 
-    if (categoryTags) {
+    if (true) {
       const tags = Array.isArray(categoryTags) ? categoryTags : categoryTags.split(',');
       if (tags.length > 0) {
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:18:11
 
     if (categoryTags) {
       const tags = Array.isArray(categoryTags) ? categoryTags : categoryTags.split(',');
-      if (tags.length > 0) {
+      if (false) {
         query.categoryTags = { $in: tags };
       }
killedBy: getListOfAllEvents should filter by categoryTags (single string)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"$in": ["Tech"]}
Received: undefined

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:18:28
 
     if (categoryTags) {
       const tags = Array.isArray(categoryTags) ? categoryTags : categoryTags.split(',');
-      if (tags.length > 0) {
-        query.categoryTags = { $in: tags };
-      }
+      if (tags.length > 0) {}
     }
 
killedBy: getListOfAllEvents should filter by categoryTags (single string)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"$in": ["Tech"]}
Received: undefined

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:24:7
     }
 
     const events = await Event.aggregate([
-      { $match: query },
+      {},
       {
         $addFields: {
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,7 @@
  Array [
-   Object {

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:27:39
       { $match: query },
       {
         $addFields: {
-          registrationCount: { $size: "$registrations" }
+          registrationCount: { $size: "" }
         }
       },
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,11 +5,11 @@
      },
    },

[Killed] UnaryOperator
controllers/event_controllers/event.general.controller.js:30:29
           registrationCount: { $size: "$registrations" }
         }
       },
-      { $sort: { createdAt: -1 } },
+      { $sort: { createdAt: +1 } },
       { $skip: (parseInt(page) - 1) * parseInt(limit) },
       { $limit: parseInt(limit) },
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,11 +11,11 @@
        },
      },

[Killed] ArithmeticOperator
controllers/event_controllers/event.general.controller.js:31:16
         }
       },
       { $sort: { createdAt: -1 } },
-      { $skip: (parseInt(page) - 1) * parseInt(limit) },
+      { $skip: (parseInt(page) - 1) / parseInt(limit) },
       { $limit: parseInt(limit) },
       { $project: { title: 1, description: 1, categoryTags: 1, venue: 1, timeline: 1, gallery: 1, registrationCount: 1, createdAt: 1 } }
killedBy: getListOfAllEvents should handle pagination calculation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0.1

[Killed] ArithmeticOperator
controllers/event_controllers/event.general.controller.js:31:17
         }
       },
       { $sort: { createdAt: -1 } },
-      { $skip: (parseInt(page) - 1) * parseInt(limit) },
+      { $skip: (parseInt(page) + 1) * parseInt(limit) },
       { $limit: parseInt(limit) },
       { $project: { title: 1, description: 1, categoryTags: 1, venue: 1, timeline: 1, gallery: 1, registrationCount: 1, createdAt: 1 } }
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -15,11 +15,11 @@
      "$sort": Object {
        "createdAt": -1,

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:38:26
 
     const totalEvents = await Event.countDocuments(query);
 
-    res.status(200).json({
-      success: true,
-      data: events,
-      pagination: {
-        page: parseInt(page),
-        pages: Math.ceil(totalEvents / parseInt(limit)),
-        total: totalEvents,
-      },
-    });
+    res.status(200).json({});
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch events", error: error.message });
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Array [
-     Object {

[Killed] ArithmeticOperator
controllers/event_controllers/event.general.controller.js:43:26
       data: events,
       pagination: {
         page: parseInt(page),
-        pages: Math.ceil(totalEvents / parseInt(limit)),
+        pages: Math.ceil(totalEvents * parseInt(limit)),
         total: totalEvents,
       },
killedBy: getListOfAllEvents should fetch events with default pagination and no filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,10 @@
        "title": "Event 1",
      },

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:47:19
         total: totalEvents,
       },
     });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch events", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: getListOfAllEvents should return 500 if aggregation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:48:37
       },
     });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch events", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch events", error: error.message });
   }
 };
killedBy: getListOfAllEvents should return 500 if aggregation fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:56:17
 export const getEventDetailsByID = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId)
-      .populate({
-        path: "createdBy",
-        populate: [{ path: "leader", select: "profile" }, { path: "members.user", select: "profile" }]
-      })
+      .populate({})
       .populate({ path: 'subEvents.subevent', select: 'title description timeline' })
       .populate("ratings.by", "profile")
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "createdBy", "populate": [{"path": "leader", "select": "profile"}, {"path": "members.user", "select": "profile"}]}
Received
       1
        - Object {
        -   "path": "createdBy",
        -   "populate": Array [

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:58:91
     const event = await Event.findById(req.params.eventId)
       .populate({
         path: "createdBy",
-        populate: [{ path: "leader", select: "profile" }, { path: "members.user", select: "profile" }]
+        populate: [{ path: "leader", select: "profile" }, { path: "members.user", select: "" }]
       })
       .populate({ path: 'subEvents.subevent', select: 'title description timeline' })
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "createdBy", "populate": [{"path": "leader", "select": "profile"}, {"path": "members.user", "select": "profile"}]}
Received
       1
        @@ -5,9 +5,9 @@
                "path": "leader",
                "select": "profile",

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:64:17
       .populate("ratings.by", "profile")
       .populate({
         path: 'sponsors.sponsor',
-        select: 'profile sponsorDetails email'
+        select: ""
       })
       .lean(); // Use .lean() for performance and to allow modification
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "sponsors.sponsor", "select": "profile sponsorDetails email"}
Received
       1
          Object {
        -   "path": "sponsors.sponsor",
        -   "select": "profile sponsorDetails email",

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:68:9
       })
       .lean(); // Use .lean() for performance and to allow modification
 
-    if (!event) {
+    if (false) {
       return res.status(404).json({ success: false, message: "Event not found" });
     }
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:68:17
       })
       .lean(); // Use .lean() for performance and to allow modification
 
-    if (!event) {
-      return res.status(404).json({ success: false, message: "Event not found" });
-    }
+    if (!event) {}
 
     // Manually fetch and attach ads for each approved sponsor
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:69:46
       .lean(); // Use .lean() for performance and to allow modification
 
     if (!event) {
-      return res.status(404).json({ success: false, message: "Event not found" });
+      return res.status(404).json({ success: true, message: "Event not found" });
     }
 
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:69:35
       .lean(); // Use .lean() for performance and to allow modification
 
     if (!event) {
-      return res.status(404).json({ success: false, message: "Event not found" });
+      return res.status(404).json({});
     }
 
killedBy: getEventDetailsByID should return 404 if event not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
controllers/event_controllers/event.general.controller.js:73:27
     }
 
     // Manually fetch and attach ads for each approved sponsor
-    if (event.sponsors && event.sponsors.length > 0) {
+    if (event.sponsors && event.sponsors.length >= 0) {
       const approvedSponsorIds = event.sponsors
         .filter(s => s.status === 'Approved' && s.sponsor)
killedBy: getEventDetailsByID should return event details without sponsors logic if sponsors array is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"sponsorId": {"$in": []}, "status": "Published"}

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:73:54
     }
 
     // Manually fetch and attach ads for each approved sponsor
-    if (event.sponsors && event.sponsors.length > 0) {
-      const approvedSponsorIds = event.sponsors
-        .filter(s => s.status === 'Approved' && s.sponsor)
-        .map(s => s.sponsor._id);
-
-      const ads = await SponsorAd.find({
-        sponsorId: { $in: approvedSponsorIds },
-        status: 'Published'
-      }).select('sponsorId poster title').lean();
-
-      const adsBySponsor = ads.reduce((acc, ad) => {
-        const sponsorId = ad.sponsorId.toString();
-        if (!acc[sponsorId]) acc[sponsorId] = [];
-        acc[sponsorId].push(ad);
-        return acc;
-      }, {});
-
-      event.sponsors.forEach(s => {
-        if (s.sponsor) s.sponsor.ads = adsBySponsor[s.sponsor._id.toString()] || [];
-      });
-    }
+    if (event.sponsors && event.sponsors.length > 0) {}
 
     res.status(200).json({ success: true, event });
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"sponsorId": {"$in": ["s1"]}, "status": "Published"}

Number of calls: 0

[Killed] MethodExpression
controllers/event_controllers/event.general.controller.js:74:34
 
     // Manually fetch and attach ads for each approved sponsor
     if (event.sponsors && event.sponsors.length > 0) {
-      const approvedSponsorIds = event.sponsors
-        .filter(s => s.status === 'Approved' && s.sponsor)
+      const approvedSponsorIds = event.sponsors
         .map(s => s.sponsor._id);
 
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "sponsorId": Object {
      "$in": Array [

[Killed] ArrowFunction
controllers/event_controllers/event.general.controller.js:75:17
     // Manually fetch and attach ads for each approved sponsor
     if (event.sponsors && event.sponsors.length > 0) {
       const approvedSponsorIds = event.sponsors
-        .filter(s => s.status === 'Approved' && s.sponsor)
+        .filter(() => undefined)
         .map(s => s.sponsor._id);
 
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "sponsorId": Object {
-     "$in": Array [

[Killed] EqualityOperator
controllers/event_controllers/event.general.controller.js:75:22
     // Manually fetch and attach ads for each approved sponsor
     if (event.sponsors && event.sponsors.length > 0) {
       const approvedSponsorIds = event.sponsors
-        .filter(s => s.status === 'Approved' && s.sponsor)
+        .filter(s => s.status !== 'Approved' && s.sponsor)
         .map(s => s.sponsor._id);
 
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "sponsorId": Object {
      "$in": Array [

[Killed] ArrowFunction
controllers/event_controllers/event.general.controller.js:76:14
     if (event.sponsors && event.sponsors.length > 0) {
       const approvedSponsorIds = event.sponsors
         .filter(s => s.status === 'Approved' && s.sponsor)
-        .map(s => s.sponsor._id);
+        .map(() => undefined);
 
       const ads = await SponsorAd.find({
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "sponsorId": Object {
      "$in": Array [

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:78:40
         .filter(s => s.status === 'Approved' && s.sponsor)
         .map(s => s.sponsor._id);
 
-      const ads = await SponsorAd.find({
-        sponsorId: { $in: approvedSponsorIds },
-        status: 'Published'
-      }).select('sponsorId poster title').lean();
+      const ads = await SponsorAd.find({}).select('sponsorId poster title').lean();
 
       const adsBySponsor = ads.reduce((acc, ad) => {
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "sponsorId": Object {
-     "$in": Array [

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:81:17
       const ads = await SponsorAd.find({
         sponsorId: { $in: approvedSponsorIds },
         status: 'Published'
-      }).select('sponsorId poster title').lean();
+      }).select("").lean();
 
       const adsBySponsor = ads.reduce((acc, ad) => {
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "sponsorId poster title"
Received: ""

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:83:52
         status: 'Published'
       }).select('sponsorId poster title').lean();
 
-      const adsBySponsor = ads.reduce((acc, ad) => {
-        const sponsorId = ad.sponsorId.toString();
-        if (!acc[sponsorId]) acc[sponsorId] = [];
-        acc[sponsorId].push(ad);
-        return acc;
-      }, {});
+      const adsBySponsor = ads.reduce((acc, ad) => {}, {});
 
       event.sponsors.forEach(s => {
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: TypeError: Cannot read properties of undefined (reading 'sponsors')

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:85:13
 
       const adsBySponsor = ads.reduce((acc, ad) => {
         const sponsorId = ad.sponsorId.toString();
-        if (!acc[sponsorId]) acc[sponsorId] = [];
+        if (acc[sponsorId]) acc[sponsorId] = [];
         acc[sponsorId].push(ad);
         return acc;
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: TypeError: Cannot read properties of undefined (reading 'sponsors')

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:85:13
 
       const adsBySponsor = ads.reduce((acc, ad) => {
         const sponsorId = ad.sponsorId.toString();
-        if (!acc[sponsorId]) acc[sponsorId] = [];
+        if (false) acc[sponsorId] = [];
         acc[sponsorId].push(ad);
         return acc;
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: TypeError: Cannot read properties of undefined (reading 'sponsors')

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:90:35
         return acc;
       }, {});
 
-      event.sponsors.forEach(s => {
-        if (s.sponsor) s.sponsor.ads = adsBySponsor[s.sponsor._id.toString()] || [];
-      });
+      event.sponsors.forEach(s => {});
     }
 
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"poster": "img.jpg", "sponsorId": "s1", "title": "Ad 1"}]
Received: undefined

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:91:40
       }, {});
 
       event.sponsors.forEach(s => {
-        if (s.sponsor) s.sponsor.ads = adsBySponsor[s.sponsor._id.toString()] || [];
+        if (s.sponsor) s.sponsor.ads = true;
       });
     }
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"poster": "img.jpg", "sponsorId": "s1", "title": "Ad 1"}]
Received: true

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:91:40
       }, {});
 
       event.sponsors.forEach(s => {
-        if (s.sponsor) s.sponsor.ads = adsBySponsor[s.sponsor._id.toString()] || [];
+        if (s.sponsor) s.sponsor.ads = false;
       });
     }
killedBy: getEventDetailsByID should fetch and attach ads for approved sponsors
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"poster": "img.jpg", "sponsorId": "s1", "title": "Ad 1"}]
Received: false

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:95:37
       });
     }
 
-    res.status(200).json({ success: true, event });
+    res.status(200).json({ success: false, event });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch event details", error: error.message });
killedBy: getEventDetailsByID should return event details without sponsors logic if sponsors array is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:96:19
     }
 
     res.status(200).json({ success: true, event });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch event details", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: getEventDetailsByID should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:97:37
 
     res.status(200).json({ success: true, event });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch event details", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch event details", error: error.message });
   }
 };
killedBy: getEventDetailsByID should return 500 on DB error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:102:57
 };
 
 
-export const addCheckInByTimeline = async (req, res) => {
-  try {
-    const { eventId } = req.params;
-    const { participantId, timelineTitle, status } = req.body;
-
-    const registration = await Registration.findOne({ eventId, userId: participantId });
-    if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
-
-    const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
-    if (checkIn) {
-      checkIn.status = status;
-      checkIn.checkedInAt = new Date();
-    } else {
-      registration.checkIns.push({ timelineTitle, status, checkedInAt: new Date() });
-    }
-
-    await registration.save();
-    res.status(200).json({ success: true, message: `Check-in ${status} for ${timelineTitle}`, registration });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to update check-in", error: error.message });
-  }
-};
+export const addCheckInByTimeline = async (req, res) => {};
 
 
killedBy: addCheckInByTimeline should return 404 if registration not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"eventId": "evt1", "userId": "usr1"}

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:103:7
 
 
 export const addCheckInByTimeline = async (req, res) => {
-  try {
-    const { eventId } = req.params;
-    const { participantId, timelineTitle, status } = req.body;
-
-    const registration = await Registration.findOne({ eventId, userId: participantId });
-    if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
-
-    const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
-    if (checkIn) {
-      checkIn.status = status;
-      checkIn.checkedInAt = new Date();
-    } else {
-      registration.checkIns.push({ timelineTitle, status, checkedInAt: new Date() });
-    }
-
-    await registration.save();
-    res.status(200).json({ success: true, message: `Check-in ${status} for ${timelineTitle}`, registration });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to update check-in", error: error.message });
   }
killedBy: addCheckInByTimeline should return 404 if registration not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"eventId": "evt1", "userId": "usr1"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:108:9
     const { participantId, timelineTitle, status } = req.body;
 
     const registration = await Registration.findOne({ eventId, userId: participantId });
-    if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
+    if (false) return res.status(404).json({ success: false, message: "Participant not registered" });
 
     const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
killedBy: addCheckInByTimeline should return 404 if registration not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:108:9
     const { participantId, timelineTitle, status } = req.body;
 
     const registration = await Registration.findOne({ eventId, userId: participantId });
-    if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
+    if (true) return res.status(404).json({ success: false, message: "Participant not registered" });
 
     const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Present"
Received: "Absent"

[Killed] ArrowFunction
controllers/event_controllers/event.general.controller.js:110:48
     const registration = await Registration.findOne({ eventId, userId: participantId });
     if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
 
-    const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
+    const checkIn = registration.checkIns.find(() => undefined);
     if (checkIn) {
       checkIn.status = status;
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Present"
Received: "Absent"

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:110:53
     const registration = await Registration.findOne({ eventId, userId: participantId });
     if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
 
-    const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
+    const checkIn = registration.checkIns.find(c => false);
     if (checkIn) {
       checkIn.status = status;
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Present"
Received: "Absent"

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:111:18
     if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
 
     const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
-    if (checkIn) {
-      checkIn.status = status;
-      checkIn.checkedInAt = new Date();
-    } else {
+    if (checkIn) {} else {
       registration.checkIns.push({ timelineTitle, status, checkedInAt: new Date() });
     }
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Present"
Received: "Absent"
