[Killed] EqualityOperator
controllers/admin.controller.js:366:20
         if (modelType === 'event') {
             const team = await Team.findById(reportedEntity.createdBy).select('leader');
             ownerId = team ? team.leader : null;
-        } else if (modelType === 'ad') {
+        } else if (modelType !== 'ad') {
             ownerId = reportedEntity.sponsorId;
         } else {
killedBy: Admin Controller createReport should create report for user and notify admins and user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Report filed successfully. Admin and User have been notified."
Received: "Report filed successfully. Admins have been notified."

[Killed] BlockStatement
controllers/admin.controller.js:368:16
             ownerId = team ? team.leader : null;
         } else if (modelType === 'ad') {
             ownerId = reportedEntity.sponsorId;
-        } else {
-            ownerId = reportedEntity._id;
-        }
+        } else {}
         
         // 4. Assemble Recipients Array
killedBy: Admin Controller createReport should create report for user and notify admins and user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Report filed successfully. Admin and User have been notified."
Received: "Report filed successfully. Admins have been notified."

[Killed] LogicalOperator
controllers/admin.controller.js:374:13
         
         // 4. Assemble Recipients Array
         const recipients = [...adminIds]; // Start with ALL Admin IDs
-        if (ownerId && !recipients.some(id => id.equals(ownerId))) { 
+        if (ownerId || !recipients.some(id => id.equals(ownerId))) { 
              recipients.push(ownerId); // Notify the responsible party
         }
killedBy: Admin Controller createReport should create report for event without team leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] MethodExpression
controllers/admin.controller.js:374:25
         
         // 4. Assemble Recipients Array
         const recipients = [...adminIds]; // Start with ALL Admin IDs
-        if (ownerId && !recipients.some(id => id.equals(ownerId))) { 
+        if (ownerId && !recipients.every(id => id.equals(ownerId))) { 
              recipients.push(ownerId); // Notify the responsible party
         }

[Survived] MethodExpression
controllers/admin.controller.js:381:37
         // 5. Create the Inbox Entity (Report)
         const newReport = new Inbox({
             type: 'message',
-            title: `Report Filed: ${modelType.toUpperCase()} - ${entityName}`,
+            title: `Report Filed: ${modelType.toLowerCase()} - ${entityName}`,
             description: `Reason: ${reason}`,
             from: reporterId, // 🛑 FIX APPLIED: FROM the user who submitted the report

[Survived] ConditionalExpression
controllers/admin.controller.js:386:27
             from: reporterId, // 🛑 FIX APPLIED: FROM the user who submitted the report
             to: recipients, // Array of ALL Admin IDs + Owner ID
             status: 'Pending', // Status is Pending for review
-            relatedEvent: modelType === 'event' ? reportedEntity._id : undefined,
+            relatedEvent: true ? reportedEntity._id : undefined,
             // ... (other related fields can be added here) ...
         });

[Survived] ConditionalExpression
controllers/admin.controller.js:386:27
             from: reporterId, // 🛑 FIX APPLIED: FROM the user who submitted the report
             to: recipients, // Array of ALL Admin IDs + Owner ID
             status: 'Pending', // Status is Pending for review
-            relatedEvent: modelType === 'event' ? reportedEntity._id : undefined,
+            relatedEvent: false ? reportedEntity._id : undefined,
             // ... (other related fields can be added here) ...
         });

[Killed] ObjectLiteral
controllers/admin.controller.js:396:30
             ? `Report filed successfully. Admin and ${config.ownerType} have been notified.`
             : `Report filed successfully. Admins have been notified.`;
 
-        res.status(201).json({
-            message: notificationMessage,
-            reportId: newReport._id
-        });
+        res.status(201).json({});
 
     } catch (error) {
killedBy: Admin Controller createReport should create report for event and notify admins and team leader
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Report filed successfully. Admin and Team Leader have been notified."
Received: undefined

[Killed] BlockStatement
controllers/admin.controller.js:401:21
             reportId: newReport._id
         });
 
-    } catch (error) {
-        console.error("Error filing report:", error);
-        if (error.name === 'CastError') {
-            return res.status(400).json({ message: "Invalid ID format provided." });
-        }
-        res.status(500).json({ message: 'Server error.', error: error.message });
-    }
+    } catch (error) {}
 };
killedBy: Admin Controller createReport should return 400 for invalid ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
controllers/admin.controller.js:403:13
 
     } catch (error) {
         console.error("Error filing report:", error);
-        if (error.name === 'CastError') {
+        if (false) {
             return res.status(400).json({ message: "Invalid ID format provided." });
         }
killedBy: Admin Controller createReport should return 400 for invalid ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/admin.controller.js:403:13
 
     } catch (error) {
         console.error("Error filing report:", error);
-        if (error.name === 'CastError') {
+        if (error.name !== 'CastError') {
             return res.status(400).json({ message: "Invalid ID format provided." });
         }
killedBy: Admin Controller createReport should return 400 for invalid ID format (CastError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1
