[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:111:9
     if (!registration) return res.status(404).json({ success: false, message: "Participant not registered" });
 
     const checkIn = registration.checkIns.find(c => c.timelineTitle === timelineTitle);
-    if (checkIn) {
+    if (false) {
       checkIn.status = status;
       checkIn.checkedInAt = new Date();
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Present"
Received: "Absent"

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:114:12
     if (checkIn) {
       checkIn.status = status;
       checkIn.checkedInAt = new Date();
-    } else {
-      registration.checkIns.push({ timelineTitle, status, checkedInAt: new Date() });
-    }
+    } else {}
 
     await registration.save();
killedBy: addCheckInByTimeline should push new check-in if not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:119:37
     }
 
     await registration.save();
-    res.status(200).json({ success: true, message: `Check-in ${status} for ${timelineTitle}`, registration });
+    res.status(200).json({ success: false, message: `Check-in ${status} for ${timelineTitle}`, registration });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to update check-in", error: error.message });
killedBy: addCheckInByTimeline should update existing check-in status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:120:19
 
     await registration.save();
     res.status(200).json({ success: true, message: `Check-in ${status} for ${timelineTitle}`, registration });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to update check-in", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: addCheckInByTimeline should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:121:37
     await registration.save();
     res.status(200).json({ success: true, message: `Check-in ${status} for ${timelineTitle}`, registration });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to update check-in", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to update check-in", error: error.message });
   }
 };
killedBy: addCheckInByTimeline should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:126:58
 };
 
 
-export const getAnnouncementsByEID = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("announcements");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({ success: true, announcements: event.announcements || [] });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
-  }
-};
+export const getAnnouncementsByEID = async (req, res) => {};
 
 // ✅ Get sponsors
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:127:7
 
 
 export const getAnnouncementsByEID = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("announcements");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({ success: true, announcements: event.announcements || [] });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
   }
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:128:67
 
 export const getAnnouncementsByEID = async (req, res) => {
   try {
-    const event = await Event.findById(req.params.eventId).select("announcements");
+    const event = await Event.findById(req.params.eventId).select("");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "announcements"
Received: ""

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:129:56
 export const getAnnouncementsByEID = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("announcements");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (!event) return res.status(404).json({ success: true, message: "Event not found" });
 
     res.status(200).json({ success: true, announcements: event.announcements || [] });
killedBy: getAnnouncementsByEID should return 404 if event not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:129:9
 export const getAnnouncementsByEID = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("announcements");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (event) return res.status(404).json({ success: false, message: "Event not found" });
 
     res.status(200).json({ success: true, announcements: event.announcements || [] });
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:131:58
     const event = await Event.findById(req.params.eventId).select("announcements");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    res.status(200).json({ success: true, announcements: event.announcements || [] });
+    res.status(200).json({ success: true, announcements: true });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["A1", "A2"]
Received: true

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:131:37
     const event = await Event.findById(req.params.eventId).select("announcements");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    res.status(200).json({ success: true, announcements: event.announcements || [] });
+    res.status(200).json({ success: false, announcements: event.announcements || [] });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
killedBy: getAnnouncementsByEID should return announcements if event exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:132:19
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     res.status(200).json({ success: true, announcements: event.announcements || [] });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: getAnnouncementsByEID should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:133:37
 
     res.status(200).json({ success: true, announcements: event.announcements || [] });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch announcements", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch announcements", error: error.message });
   }
 };
killedBy: getAnnouncementsByEID should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:138:69
 };
 
 // ✅ Get sponsors
-export const getListOfEventSponsorsWithListOf = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("sponsors");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({ success: true, sponsors: event.sponsors || [] });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
-  }
-};
+export const getListOfEventSponsorsWithListOf = async (req, res) => {};
 
 
killedBy: getListOfEventSponsorsWithListOf should return sponsors if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

[Timeout] BlockStatement
controllers/event_controllers/event.general.controller.js:139:7
 
 // ✅ Get sponsors
 export const getListOfEventSponsorsWithListOf = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("sponsors");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({ success: true, sponsors: event.sponsors || [] });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
   }

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:141:9
 export const getListOfEventSponsorsWithListOf = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("sponsors");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (event) return res.status(404).json({ success: false, message: "Event not found" });
 
     res.status(200).json({ success: true, sponsors: event.sponsors || [] });
killedBy: getListOfEventSponsorsWithListOf should return sponsors if event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:141:56
 export const getListOfEventSponsorsWithListOf = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("sponsors");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (!event) return res.status(404).json({ success: true, message: "Event not found" });
 
     res.status(200).json({ success: true, sponsors: event.sponsors || [] });
killedBy: getListOfEventSponsorsWithListOf should return 404 if event not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
controllers/event_controllers/event.general.controller.js:143:53
     const event = await Event.findById(req.params.eventId).select("sponsors");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    res.status(200).json({ success: true, sponsors: event.sponsors || [] });
+    res.status(200).json({ success: true, sponsors: event.sponsors && [] });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
killedBy: getListOfEventSponsorsWithListOf should return sponsors if event exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   Object {
-     "name": "S1",

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:143:53
     const event = await Event.findById(req.params.eventId).select("sponsors");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    res.status(200).json({ success: true, sponsors: event.sponsors || [] });
+    res.status(200).json({ success: true, sponsors: false });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
killedBy: getListOfEventSponsorsWithListOf should return sponsors if event exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"name": "S1"}]
Received: false

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:144:19
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     res.status(200).json({ success: true, sponsors: event.sponsors || [] });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: getListOfEventSponsorsWithListOf should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Timeout] BooleanLiteral
controllers/event_controllers/event.general.controller.js:145:37
 
     res.status(200).json({ success: true, sponsors: event.sponsors || [] });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch sponsors", error: error.message });
   }
 };

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:145:53
 
     res.status(200).json({ success: true, sponsors: event.sponsors || [] });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch sponsors", error: error.message });
+    res.status(500).json({ success: false, message: "", error: error.message });
   }
 };
killedBy: getListOfEventSponsorsWithListOf should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Failed to fetch sponsors"
Received: ""

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:151:7
 
 
 export const addRatingReviewByEID = async (req, res) => {
-  try {
-    const { rating, review } = req.body;
-    const { eventId } = req.params;
-
-    const event = await Event.findById(eventId);
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
-    if (alreadyRated)
-      return res.status(400).json({ success: false, message: "You already submitted a review" });
-
-    event.ratings.push({
-      by: req.user.id,
-      rating,
-      review,
-      createdAt: new Date(),
-    });
-
-    await event.save();
-
-    res.status(201).json({ success: true, message: "Review added successfully", ratings: event.ratings });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to add review", error: error.message });
   }
killedBy: addRatingReviewByEID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:156:9
     const { eventId } = req.params;
 
     const event = await Event.findById(eventId);
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (true) return res.status(404).json({ success: false, message: "Event not found" });
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
killedBy: addRatingReviewByEID should return 400 if user already rated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:156:56
     const { eventId } = req.params;
 
     const event = await Event.findById(eventId);
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (!event) return res.status(404).json({ success: true, message: "Event not found" });
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
killedBy: addRatingReviewByEID should return 404 if event not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
controllers/event_controllers/event.general.controller.js:158:50
     const event = await Event.findById(eventId);
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
+    const alreadyRated = event.ratings.some(r => r.by.toString() !== req.user.id);
     if (alreadyRated)
       return res.status(400).json({ success: false, message: "You already submitted a review" });
killedBy: addRatingReviewByEID should return 400 if user already rated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ArrowFunction
controllers/event_controllers/event.general.controller.js:158:45
     const event = await Event.findById(eventId);
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
-    const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
+    const alreadyRated = event.ratings.some(() => undefined);
     if (alreadyRated)
       return res.status(400).json({ success: false, message: "You already submitted a review" });
killedBy: addRatingReviewByEID should return 400 if user already rated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/event.general.controller.js:159:9
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
-    if (alreadyRated)
+    if (true)
       return res.status(400).json({ success: false, message: "You already submitted a review" });
 
killedBy: addRatingReviewByEID should successfully add a review
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Timeout] ConditionalExpression
controllers/event_controllers/event.general.controller.js:159:9
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
-    if (alreadyRated)
+    if (false)
       return res.status(400).json({ success: false, message: "You already submitted a review" });
 

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:160:46
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
     if (alreadyRated)
-      return res.status(400).json({ success: false, message: "You already submitted a review" });
+      return res.status(400).json({ success: true, message: "You already submitted a review" });
 
     event.ratings.push({
killedBy: addRatingReviewByEID should return 400 if user already rated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:160:35
 
     const alreadyRated = event.ratings.some(r => r.by.toString() === req.user.id);
     if (alreadyRated)
-      return res.status(400).json({ success: false, message: "You already submitted a review" });
+      return res.status(400).json({});
 
     event.ratings.push({
killedBy: addRatingReviewByEID should return 400 if user already rated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:162:24
     if (alreadyRated)
       return res.status(400).json({ success: false, message: "You already submitted a review" });
 
-    event.ratings.push({
-      by: req.user.id,
-      rating,
-      review,
-      createdAt: new Date(),
-    });
+    event.ratings.push({});
 
     await event.save();
killedBy: addRatingReviewByEID should successfully add a review
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 1

- Object {
-   "by": "user123",
-   "rating": 5,

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:171:37
 
     await event.save();
 
-    res.status(201).json({ success: true, message: "Review added successfully", ratings: event.ratings });
+    res.status(201).json({ success: false, message: "Review added successfully", ratings: event.ratings });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to add review", error: error.message });
killedBy: addRatingReviewByEID should successfully add a review
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:172:19
     await event.save();
 
     res.status(201).json({ success: true, message: "Review added successfully", ratings: event.ratings });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to add review", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: addRatingReviewByEID should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:173:37
 
     res.status(201).json({ success: true, message: "Review added successfully", ratings: event.ratings });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to add review", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to add review", error: error.message });
   }
 };
killedBy: addRatingReviewByEID should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:173:26
 
     res.status(201).json({ success: true, message: "Review added successfully", ratings: event.ratings });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to add review", error: error.message });
+    res.status(500).json({});
   }
 };
killedBy: addRatingReviewByEID should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:178:63
 };
 
 
-export const getListOfRatingReviewByEID = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
-
-    res.status(200).json({ success: true, reviews: event.ratings });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
-  }
-};
+export const getListOfRatingReviewByEID = async (req, res) => {};
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:179:7
 
 
 export const getListOfRatingReviewByEID = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
-
-    res.status(200).json({ success: true, reviews: event.ratings });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
   }
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:180:69
 
 export const getListOfRatingReviewByEID = async (req, res) => {
   try {
-    const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
+    const event = await Event.findById(req.params.eventId).populate("", "profile");
 
     res.status(200).json({ success: true, reviews: event.ratings });
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ratings.by", "profile"
Received: "", "profile"

Number of calls: 1

[Killed] StringLiteral
controllers/event_controllers/event.general.controller.js:180:83
 
 export const getListOfRatingReviewByEID = async (req, res) => {
   try {
-    const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
+    const event = await Event.findById(req.params.eventId).populate("ratings.by", "");
 
     res.status(200).json({ success: true, reviews: event.ratings });
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ratings.by", "profile"
Received: "ratings.by", ""

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:182:37
   try {
     const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
 
-    res.status(200).json({ success: true, reviews: event.ratings });
+    res.status(200).json({ success: false, reviews: event.ratings });
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:182:26
   try {
     const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
 
-    res.status(200).json({ success: true, reviews: event.ratings });
+    res.status(200).json({});
   } catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
killedBy: getListOfRatingReviewByEID should fetch reviews successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
controllers/event_controllers/event.general.controller.js:183:19
     const event = await Event.findById(req.params.eventId).populate("ratings.by", "profile");
 
     res.status(200).json({ success: true, reviews: event.ratings });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
-  }
+  } catch (error) {}
 };
killedBy: getListOfRatingReviewByEID should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/event.general.controller.js:184:37
 
     res.status(200).json({ success: true, reviews: event.ratings });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch reviews", error: error.message });
   }
 };
killedBy: getListOfRatingReviewByEID should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/event_controllers/event.general.controller.js:184:26
 
     res.status(200).json({ success: true, reviews: event.ratings });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch reviews", error: error.message });
+    res.status(500).json({});
   }
 };
killedBy: getListOfRatingReviewByEID should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
