[Killed] BlockStatement
controllers/auth.controller.js:9:50
 import { randomInt } from 'crypto';
 import mongoose from 'mongoose';
 
-const generateTokenAndSetCookie = (res, user) => {
-  const token = jwt.sign({ id: user._id, email: user.email, role: user.role }, process.env.JWTKEY, {
-    expiresIn: '7d',
-  });
-
-  res.cookie('token', token, {
-    httpOnly: true,
-    secure: process.env.NODE_ENV === 'production',
-    sameSite: 'strict',
-    maxAge: 7 * 24 * 60 * 60 * 1000, // 7 days
-  });
-
-  return token;
-};
+const generateTokenAndSetCookie = (res, user) => {};
 
 export const register = async (req, res) => {
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", "mocked_token", ObjectContaining {"httpOnly": true, "maxAge": 604800000, "secure": false}

Number of calls: 0

[Killed] ArithmeticOperator
controllers/auth.controller.js:18:13
     httpOnly: true,
     secure: process.env.NODE_ENV === 'production',
     sameSite: 'strict',
-    maxAge: 7 * 24 * 60 * 60 * 1000, // 7 days
+    maxAge: 7 * 24 * 60 / 60 * 1000, // 7 days
   });
 
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", "mocked_token", ObjectContaining {"httpOnly": true, "maxAge": 604800000, "secure": false}
Received: "token", "mocked_token", {"httpOnly": true, "maxAge": 168000, "sameSite": "strict", "secure": false}

Number of calls: 1

[Killed] ArithmeticOperator
controllers/auth.controller.js:18:13
     httpOnly: true,
     secure: process.env.NODE_ENV === 'production',
     sameSite: 'strict',
-    maxAge: 7 * 24 * 60 * 60 * 1000, // 7 days
+    maxAge: 7 * 24 / 60 * 60 * 1000, // 7 days
   });
 
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", "mocked_token", ObjectContaining {"httpOnly": true, "maxAge": 604800000, "secure": false}
Received: "token", "mocked_token", {"httpOnly": true, "maxAge": 168000, "sameSite": "strict", "secure": false}

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:28:9
   try {
     const { username, email, password, college, role } = req.body;
 
-    if (!username || !email || !password || !role) {
+    if (username || !email || !password || !role) {
       return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
     }
killedBy: Auth Controller - Register should fail with only username missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] LogicalOperator
controllers/auth.controller.js:28:9
   try {
     const { username, email, password, college, role } = req.body;
 
-    if (!username || !email || !password || !role) {
+    if ((!username || !email) && !password || !role) {
       return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
     }
killedBy: Auth Controller - Register should fail with only username missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:29:46
     const { username, email, password, college, role } = req.body;
 
     if (!username || !email || !password || !role) {
-      return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
+      return res.status(400).json({ success: true, message: 'Username, email, password, and role are required' });
     }
 
killedBy: Auth Controller - Register should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Username, email, password, and role are required",
-   "success": false,

[Killed] ObjectLiteral
controllers/auth.controller.js:29:35
     const { username, email, password, college, role } = req.body;
 
     if (!username || !email || !password || !role) {
-      return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
+      return res.status(400).json({});
     }
 
killedBy: Auth Controller - Register should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Username, email, password, and role are required",
-   "success": false,

[Killed] EqualityOperator
controllers/auth.controller.js:32:10
       return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
     }
 
-    if ((role === 'student' || role === 'organizer') && !college) {
+    if ((role !== 'student' || role === 'organizer') && !college) {
       return res.status(400).json({ success: false, message: 'College is required for student and organizer roles' });
     }
killedBy: Auth Controller - Register should return 400 if role is student/organizer but college is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] LogicalOperator
controllers/auth.controller.js:32:10
       return res.status(400).json({ success: false, message: 'Username, email, password, and role are required' });
     }
 
-    if ((role === 'student' || role === 'organizer') && !college) {
+    if ((role === 'student' && role === 'organizer') && !college) {
       return res.status(400).json({ success: false, message: 'College is required for student and organizer roles' });
     }
killedBy: Auth Controller - Register should return 400 if role is student/organizer but college is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:33:46
     }
 
     if ((role === 'student' || role === 'organizer') && !college) {
-      return res.status(400).json({ success: false, message: 'College is required for student and organizer roles' });
+      return res.status(400).json({ success: true, message: 'College is required for student and organizer roles' });
     }
 
killedBy: Auth Controller - Register should return 400 if role is student/organizer but college is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "College is required for student and organizer roles",
-   "success": false,

[Killed] BlockStatement
controllers/auth.controller.js:36:63
       return res.status(400).json({ success: false, message: 'College is required for student and organizer roles' });
     }
 
-    if (college && !mongoose.Types.ObjectId.isValid(college)) {
-      return res.status(400).json({ success: false, message: 'Invalid college selection' });
-    }
+    if (college && !mongoose.Types.ObjectId.isValid(college)) {}
 
     const existingUser = await User.findOne({ email, role });
killedBy: Auth Controller - Register should return 400 if college ID is provided but invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/auth.controller.js:36:9
       return res.status(400).json({ success: false, message: 'College is required for student and organizer roles' });
     }
 
-    if (college && !mongoose.Types.ObjectId.isValid(college)) {
+    if (true) {
       return res.status(400).json({ success: false, message: 'Invalid college selection' });
     }
killedBy: Auth Controller - Register should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "e", "role": "admin"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:37:46
     }
 
     if (college && !mongoose.Types.ObjectId.isValid(college)) {
-      return res.status(400).json({ success: false, message: 'Invalid college selection' });
+      return res.status(400).json({ success: true, message: 'Invalid college selection' });
     }
 
killedBy: Auth Controller - Register should return 400 if college ID is provided but invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid college selection",
-   "success": false,

[Killed] BlockStatement
controllers/auth.controller.js:41:23
     }
 
     const existingUser = await User.findOne({ email, role });
-    if (existingUser) {
-      return res.status(409).json({ success: false, message: 'User with this email and role already exists' });
-    }
+    if (existingUser) {}
 
     const passwordHash = await bcrypt.hash(password, Number(process.env.HASHROUND));
killedBy: Auth Controller - Register should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/auth.controller.js:41:9
     }
 
     const existingUser = await User.findOne({ email, role });
-    if (existingUser) {
+    if (true) {
       return res.status(409).json({ success: false, message: 'User with this email and role already exists' });
     }
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"college": "valid_id", "email": "e", "passwordHash": "hashed_pass", "profile": {"name": "u"}, "role": "student"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:42:46
 
     const existingUser = await User.findOne({ email, role });
     if (existingUser) {
-      return res.status(409).json({ success: false, message: 'User with this email and role already exists' });
+      return res.status(409).json({ success: true, message: 'User with this email and role already exists' });
     }
 
killedBy: Auth Controller - Register should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User with this email and role already exists",
-   "success": false,

[Killed] ConditionalExpression
controllers/auth.controller.js:56:9
       }
     };
 
-    if (role === 'student' || role === 'organizer') {
+    if (false || role === 'organizer') {
       userData.college = college;
     }
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"college": "valid_id", "email": "e", "passwordHash": "hashed_pass", "profile": {"name": "u"}, "role": "student"}
Received: {"email": "e", "passwordHash": "hashed_pass", "profile": {"name": "u"}, "role": "student"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/auth.controller.js:56:9
       }
     };
 
-    if (role === 'student' || role === 'organizer') {
+    if (false) {
       userData.college = college;
     }
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"college": "valid_id", "email": "e", "passwordHash": "hashed_pass", "profile": {"name": "u"}, "role": "student"}
Received: {"email": "e", "passwordHash": "hashed_pass", "profile": {"name": "u"}, "role": "student"}

Number of calls: 1

[Killed] ObjectLiteral
controllers/auth.controller.js:69:26
     delete userObject.passwordHash;
     delete userObject.__v;
 
-    res.status(201).json({
-      success: true,
-      message: 'User registered successfully',
-      token,
-      user: userObject,
-    });
+    res.status(201).json({});
   } catch (err) {
     console.error('Registration error:', err);
killedBy: Auth Controller - Register should register a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "User registered successfully", "success": true, "token": "mocked_token", "user": ObjectContaining {"email": "e", "id": "new_id", "role": "student"}}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/auth.controller.js:75:17
       token,
       user: userObject,
     });
-  } catch (err) {
-    console.error('Registration error:', err);
-    res.status(500).json({ success: false, message: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Auth Controller - Register should handle database errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:77:37
     });
   } catch (err) {
     console.error('Registration error:', err);
-    res.status(500).json({ success: false, message: err.message });
+    res.status(500).json({ success: true, message: err.message });
   }
 };
killedBy: Auth Controller - Register should handle database errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "DB Error",
-   "success": false,

[Killed] BooleanLiteral
controllers/auth.controller.js:84:32
 export const login = async (req, res) => {
   try {
     const { email, password, role } = req.body;
-    if (!email || !password || !role) {
+    if (!email || !password || role) {
       return res.status(400).json({ success: false, message: 'Email, password, and role are required' });
     }
killedBy: Auth Controller - Login & Logout should return 401 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "e", "role": "r"}

Number of calls: 0

[Killed] LogicalOperator
controllers/auth.controller.js:84:9
 export const login = async (req, res) => {
   try {
     const { email, password, role } = req.body;
-    if (!email || !password || !role) {
+    if ((!email || !password) && !role) {
       return res.status(400).json({ success: false, message: 'Email, password, and role are required' });
     }
killedBy: Auth Controller - Login & Logout should fail with only email missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:85:46
   try {
     const { email, password, role } = req.body;
     if (!email || !password || !role) {
-      return res.status(400).json({ success: false, message: 'Email, password, and role are required' });
+      return res.status(400).json({ success: true, message: 'Email, password, and role are required' });
     }
 
killedBy: Auth Controller - Login & Logout should return 400 if missing fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Email, password, and role are required",
-   "success": false,

[Killed] StringLiteral
controllers/auth.controller.js:85:62
   try {
     const { email, password, role } = req.body;
     if (!email || !password || !role) {
-      return res.status(400).json({ success: false, message: 'Email, password, and role are required' });
+      return res.status(400).json({ success: false, message: "" });
     }
 
killedBy: Auth Controller - Login & Logout should return 400 if missing fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Email, password, and role are required",
+   "message": "",

[Survived] BooleanLiteral
controllers/auth.controller.js:89:80
     }
 
     const user = await User.findOne({ email, role });
-    const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : false;
+    const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : true;
 
     if (!user || !isMatch) {

[Killed] ConditionalExpression
controllers/auth.controller.js:91:9
     const user = await User.findOne({ email, role });
     const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : false;
 
-    if (!user || !isMatch) {
+    if (false) {
       return res.status(401).json({ success: false, message: 'Invalid credentials' });
     }
killedBy: Auth Controller - Login & Logout should return 401 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/auth.controller.js:91:28
     const user = await User.findOne({ email, role });
     const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : false;
 
-    if (!user || !isMatch) {
-      return res.status(401).json({ success: false, message: 'Invalid credentials' });
-    }
+    if (!user || !isMatch) {}
 
     const userObject = user.toObject();
killedBy: Auth Controller - Login & Logout should return 401 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:92:46
     const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : false;
 
     if (!user || !isMatch) {
-      return res.status(401).json({ success: false, message: 'Invalid credentials' });
+      return res.status(401).json({ success: true, message: 'Invalid credentials' });
     }
 
killedBy: Auth Controller - Login & Logout should return 401 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid credentials",
-   "success": false,

[Killed] ObjectLiteral
controllers/auth.controller.js:92:35
     const isMatch = user ? await bcrypt.compare(password, user.passwordHash) : false;
 
     if (!user || !isMatch) {
-      return res.status(401).json({ success: false, message: 'Invalid credentials' });
+      return res.status(401).json({});
     }
 
killedBy: Auth Controller - Login & Logout should return 401 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid credentials",
-   "success": false,

[Killed] StringLiteral
controllers/auth.controller.js:105:16
 
     res.status(200).json({
       success: true,
-      message: 'Login successful',
+      message: "",
       token,
       user: userObject,
killedBy: Auth Controller - Login & Logout should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Login successful", "success": true, "token": "mocked_token", "user": ObjectContaining {"email": "e", "id": "uid", "role": "r"}}
Received: {"message": "", "success": true, "token": "mocked_token", "user": {"email": "e", "id": "uid", "role": "r"}}

Number of calls: 1

[Killed] BlockStatement
controllers/auth.controller.js:109:17
       token,
       user: userObject,
     });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ success: false, message: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Auth Controller - Login & Logout should handle login errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:111:37
     });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ success: false, message: err.message });
+    res.status(500).json({ success: true, message: err.message });
   }
 };
killedBy: Auth Controller - Login & Logout should handle login errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Err",
-   "success": false,

[Killed] BlockStatement
controllers/auth.controller.js:115:43
   }
 };
 
-export const logout = async (req, res) => {
-  try {
-    res.clearCookie('token', {
-      httpOnly: true,
-      secure: process.env.NODE_ENV === 'production',
-      sameSite: 'strict',
-      path: '/',
-    });
-
-    res.json({ success: true, message: "logout succsefully" });
-  }
-  catch (err) {
-    res.status(500).json({ success: false, message: err.message });
-  }
-}
+export const logout = async (req, res) => {}
 
 export const requestPasswordReset = async (req, res) => {
killedBy: Auth Controller - Login & Logout should logout successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", ObjectContaining {"httpOnly": true, "path": "/", "sameSite": "strict"}

Number of calls: 0

[Killed] BlockStatement
controllers/auth.controller.js:116:7
 };
 
 export const logout = async (req, res) => {
-  try {
-    res.clearCookie('token', {
-      httpOnly: true,
-      secure: process.env.NODE_ENV === 'production',
-      sameSite: 'strict',
-      path: '/',
-    });
-
-    res.json({ success: true, message: "logout succsefully" });
-  }
+  try {}
   catch (err) {
     res.status(500).json({ success: false, message: err.message });
killedBy: Auth Controller - Login & Logout should logout successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", ObjectContaining {"httpOnly": true, "path": "/", "sameSite": "strict"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:124:25
       path: '/',
     });
 
-    res.json({ success: true, message: "logout succsefully" });
+    res.json({ success: false, message: "logout succsefully" });
   }
   catch (err) {
killedBy: Auth Controller - Login & Logout should logout successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "logout succsefully",
-   "success": true,

[Killed] BlockStatement
controllers/auth.controller.js:126:15
 
     res.json({ success: true, message: "logout succsefully" });
   }
-  catch (err) {
-    res.status(500).json({ success: false, message: err.message });
-  }
+  catch (err) {}
 }
 
killedBy: Auth Controller - Login & Logout should handle logout errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/auth.controller.js:127:37
     res.json({ success: true, message: "logout succsefully" });
   }
   catch (err) {
-    res.status(500).json({ success: false, message: err.message });
+    res.status(500).json({ success: true, message: err.message });
   }
 }
killedBy: Auth Controller - Login & Logout should handle logout errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Err",
-   "success": false,

[Killed] ObjectLiteral
controllers/auth.controller.js:127:26
     res.json({ success: true, message: "logout succsefully" });
   }
   catch (err) {
-    res.status(500).json({ success: false, message: err.message });
+    res.status(500).json({});
   }
 }
killedBy: Auth Controller - Login & Logout should handle logout errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Err",
-   "success": false,

[Killed] BlockStatement
controllers/auth.controller.js:137:34
 
     // If user is authenticated, get from token, otherwise require email/role
     let user;
-    if (req.user && req.user.id) {
-      // Authenticated user
-      user = await User.findById(req.user.id);
-      if (!user) {
-        return res.status(404).json({ success: false, message: "User not found" });
-      }
-    } else {
+    if (req.user && req.user.id) {} else {
       if (!email || !role) {
         return res.status(400).json({ success: false, message: "Email and role are required" });
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should use req.user.id if present
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ConditionalExpression
controllers/auth.controller.js:137:9
 
     // If user is authenticated, get from token, otherwise require email/role
     let user;
-    if (req.user && req.user.id) {
+    if (true) {
       // Authenticated user
       user = await User.findById(req.user.id);
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should fail if not authenticated and missing email/role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/auth.controller.js:140:11
     if (req.user && req.user.id) {
       // Authenticated user
       user = await User.findById(req.user.id);
-      if (!user) {
+      if (false) {
         return res.status(404).json({ success: false, message: "User not found" });
       }
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should return 404 if authenticated user ID not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:140:11
     if (req.user && req.user.id) {
       // Authenticated user
       user = await User.findById(req.user.id);
-      if (!user) {
+      if (user) {
         return res.status(404).json({ success: false, message: "User not found" });
       }
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should use req.user.id if present
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BooleanLiteral
controllers/auth.controller.js:141:48
       // Authenticated user
       user = await User.findById(req.user.id);
       if (!user) {
-        return res.status(404).json({ success: false, message: "User not found" });
+        return res.status(404).json({ success: true, message: "User not found" });
       }
     } else {
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should return 404 if authenticated user ID not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User not found",
-   "success": false,

[Killed] StringLiteral
controllers/auth.controller.js:141:64
       // Authenticated user
       user = await User.findById(req.user.id);
       if (!user) {
-        return res.status(404).json({ success: false, message: "User not found" });
+        return res.status(404).json({ success: false, message: "" });
       }
     } else {
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should return 404 if authenticated user ID not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "User not found",
+   "message": "",

[Killed] BlockStatement
controllers/auth.controller.js:143:12
       if (!user) {
         return res.status(404).json({ success: false, message: "User not found" });
       }
-    } else {
-      if (!email || !role) {
-        return res.status(400).json({ success: false, message: "Email and role are required" });
-      }
-
-      user = await User.findOne({ email, role });
-      if (!user) {
-        return res.status(200).json({ success: true, message: "If an account with that email and role exists, an OTP has been sent." });
-      }
-    }
+    } else {}
 
     const toEmail = user.email;
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should fail if not authenticated and missing email/role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:144:11
         return res.status(404).json({ success: false, message: "User not found" });
       }
     } else {
-      if (!email || !role) {
+      if (email || !role) {
         return res.status(400).json({ success: false, message: "Email and role are required" });
       }
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should return 200 (privacy) if unauthenticated email not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
controllers/auth.controller.js:144:11
         return res.status(404).json({ success: false, message: "User not found" });
       }
     } else {
-      if (!email || !role) {
+      if (false) {
         return res.status(400).json({ success: false, message: "Email and role are required" });
       }
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should fail if not authenticated and missing email/role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/auth.controller.js:145:48
       }
     } else {
       if (!email || !role) {
-        return res.status(400).json({ success: false, message: "Email and role are required" });
+        return res.status(400).json({ success: true, message: "Email and role are required" });
       }
 
killedBy: Auth Controller - Password Reset (Authenticated/Manual) should fail if not authenticated and missing email/role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Email and role are required",
-   "success": false,
