[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:206:55
     // Fetch and inject the college from the team leader
     if (eventPayload.createdBy) {
       const team = await Team.findById(eventPayload.createdBy).populate('leader');
-      if (team && team.leader && team.leader.college) {
-        eventPayload.college = team.leader.college;
-      } else {
+      if (team && team.leader && team.leader.college) {} else {
         // If college is required and not found, we should fail fast.
         return res.status(400).json({ message: "Could not determine college from team leader. Event cannot be published." });
killedBy: Organizer Dashboard Controller publishEvent should publish a new event and index it via AI service
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"college": "ABC", "status": "published"}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:208:14
       const team = await Team.findById(eventPayload.createdBy).populate('leader');
       if (team && team.leader && team.leader.college) {
         eventPayload.college = team.leader.college;
-      } else {
-        // If college is required and not found, we should fail fast.
-        return res.status(400).json({ message: "Could not determine college from team leader. Event cannot be published." });
-      }
+      } else {}
     }
 
killedBy: Organizer Dashboard Controller publishEvent should return 400 if college cannot be determined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:218:23
     let event;
     let message;
 
-    if (req.body._id) {
-      event = await Event.findByIdAndUpdate(req.body._id, eventPayload, { new: true, runValidators: true }).populate(populateEventDetails);
-      if (!event) {
-        return res.status(404).json({ message: "Event not found to publish." });
-      }
-      message = "Event published successfully";
-    } else {
+    if (req.body._id) {} else {
       event = await Event.create(eventPayload);
       await event.populate(populateEventDetails);
killedBy: Organizer Dashboard Controller publishEvent should return 404 when updating non-existent event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.manage.controller.js:220:11
 
     if (req.body._id) {
       event = await Event.findByIdAndUpdate(req.body._id, eventPayload, { new: true, runValidators: true }).populate(populateEventDetails);
-      if (!event) {
+      if (true) {
         return res.status(404).json({ message: "Event not found to publish." });
       }
killedBy: Organizer Dashboard Controller publishEvent should update and publish existing event
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:220:19
 
     if (req.body._id) {
       event = await Event.findByIdAndUpdate(req.body._id, eventPayload, { new: true, runValidators: true }).populate(populateEventDetails);
-      if (!event) {
-        return res.status(404).json({ message: "Event not found to publish." });
-      }
+      if (!event) {}
       message = "Event published successfully";
     } else {
killedBy: Organizer Dashboard Controller publishEvent should return 404 when updating non-existent event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:224:12
         return res.status(404).json({ message: "Event not found to publish." });
       }
       message = "Event published successfully";
-    } else {
-      event = await Event.create(eventPayload);
-      await event.populate(populateEventDetails);
-      message = "Event created and published successfully";
-    }
+    } else {}
 
     // Notify the AI service to add the event to its index
killedBy: Organizer Dashboard Controller publishEvent should publish a new event and index it via AI service
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"college": "ABC", "status": "published"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:231:9
     }
 
     // Notify the AI service to add the event to its index
-    try {
-      await pythonClient.post(`/recommend/add/${event._id}`);
-    } catch (aiError) {
+    try {} catch (aiError) {
       console.error(`AI Service: Failed to index published event ${event._id}`, aiError.message);
     }
killedBy: Organizer Dashboard Controller publishEvent should publish a new event and index it via AI service
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommend/add/evt1"

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:232:31
 
     // Notify the AI service to add the event to its index
     try {
-      await pythonClient.post(`/recommend/add/${event._id}`);
+      await pythonClient.post(``);
     } catch (aiError) {
       console.error(`AI Service: Failed to index published event ${event._id}`, aiError.message);
killedBy: Organizer Dashboard Controller publishEvent should publish a new event and index it via AI service
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommend/add/evt1"
Received: ""

Number of calls: 1

[Survived] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:233:23
     // Notify the AI service to add the event to its index
     try {
       await pythonClient.post(`/recommend/add/${event._id}`);
-    } catch (aiError) {
-      console.error(`AI Service: Failed to index published event ${event._id}`, aiError.message);
-    }
+    } catch (aiError) {}
     res.status(200).json({ message, event });
 

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:238:17
     }
     res.status(200).json({ message, event });
 
-  } catch (err) {
-    console.error(err);
-    res
-      .status(500)
-      .json({ message: "Failed to publish event", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Dashboard Controller publishEvent should handle general errors in publishEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/event.manage.controller.js:242:13
     console.error(err);
     res
       .status(500)
-      .json({ message: "Failed to publish event", error: err.message });
+      .json({});
   }
 };
killedBy: Organizer Dashboard Controller publishEvent should handle general errors in publishEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Failed to publish event"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:246:49
   }
 };
 
-export const getEventById = async (req, res) => {
-  try {
-    const { id } = req.params;
-    const event = await Event.findById(id).select('+poc').populate(populateEventDetails);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-    res.status(200).json(event);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to fetch event", error: err.message });
-  }
-};
+export const getEventById = async (req, res) => {};
 
 export const editEvent = async (req, res) => {
killedBy: Organizer Dashboard Controller getEventById should return event details
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:247:7
 };
 
 export const getEventById = async (req, res) => {
-  try {
-    const { id } = req.params;
-    const event = await Event.findById(id).select('+poc').populate(populateEventDetails);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-    res.status(200).json(event);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to fetch event", error: err.message });
killedBy: Organizer Dashboard Controller getEventById should return event details
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:250:17
   try {
     const { id } = req.params;
     const event = await Event.findById(id).select('+poc').populate(populateEventDetails);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
+    if (!event) {}
     res.status(200).json(event);
   } catch (err) {
killedBy: Organizer Dashboard Controller getEventById should return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.manage.controller.js:250:9
   try {
     const { id } = req.params;
     const event = await Event.findById(id).select('+poc').populate(populateEventDetails);
-    if (!event) {
+    if (event) {
       return res.status(404).json({ message: "Event not found" });
     }
killedBy: Organizer Dashboard Controller getEventById should return event details
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:251:46
     const { id } = req.params;
     const event = await Event.findById(id).select('+poc').populate(populateEventDetails);
     if (!event) {
-      return res.status(404).json({ message: "Event not found" });
+      return res.status(404).json({ message: "" });
     }
     res.status(200).json(event);
killedBy: Organizer Dashboard Controller getEventById should return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Event not found"}
Received: {"message": ""}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:254:17
       return res.status(404).json({ message: "Event not found" });
     }
     res.status(200).json(event);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to fetch event", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Dashboard Controller getEventById should handle errors in getEventById
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:260:46
   }
 };
 
-export const editEvent = async (req, res) => {
-  try {
-    const updateData = getEventPayload(req.body);
-
-    const event = await Event.findByIdAndUpdate(req.params.id, updateData, {
-      new: true,
-      runValidators: true,
-    }).populate(populateEventDetails);
-
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-    res.status(200).json({ message: "Event updated successfully", event });
-  } catch (err) {
-    console.error(err);
-    res
-      .status(500)
-      .json({ message: "Failed to update event", error: err.message });
-  }
-};
+export const editEvent = async (req, res) => {};
 
 export const completeEvent = async (req, res) => {
killedBy: Organizer Dashboard Controller editEvent should update event
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:261:7
 };
 
 export const editEvent = async (req, res) => {
-  try {
-    const updateData = getEventPayload(req.body);
-
-    const event = await Event.findByIdAndUpdate(req.params.id, updateData, {
-      new: true,
-      runValidators: true,
-    }).populate(populateEventDetails);
-
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-    res.status(200).json({ message: "Event updated successfully", event });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res
killedBy: Organizer Dashboard Controller editEvent should update event
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
controllers/organizer_controllers/event.manage.controller.js:265:12
     const updateData = getEventPayload(req.body);
 
     const event = await Event.findByIdAndUpdate(req.params.id, updateData, {
-      new: true,
+      new: false,
       runValidators: true,
     }).populate(populateEventDetails);

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:269:17
       runValidators: true,
     }).populate(populateEventDetails);
 
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
+    if (!event) {}
     res.status(200).json({ message: "Event updated successfully", event });
   } catch (err) {
killedBy: Organizer Dashboard Controller editEvent should return 404 if event missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
controllers/organizer_controllers/event.manage.controller.js:270:35
     }).populate(populateEventDetails);
 
     if (!event) {
-      return res.status(404).json({ message: "Event not found" });
+      return res.status(404).json({});
     }
     res.status(200).json({ message: "Event updated successfully", event });
killedBy: Organizer Dashboard Controller editEvent should return 404 if event missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Event not found"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:273:17
       return res.status(404).json({ message: "Event not found" });
     }
     res.status(200).json({ message: "Event updated successfully", event });
-  } catch (err) {
-    console.error(err);
-    res
-      .status(500)
-      .json({ message: "Failed to update event", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Dashboard Controller editEvent should handle errors in editEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:286:53
     const { id } = req.params;
     const userId = req.user.id;
 
-    const event = await Event.findById(id).populate('createdBy');
+    const event = await Event.findById(id).populate("");
 
     if (!event) {

[Killed] ConditionalExpression
controllers/organizer_controllers/event.manage.controller.js:288:9
 
     const event = await Event.findById(id).populate('createdBy');
 
-    if (!event) {
+    if (true) {
       return res.status(404).json({ message: "Event not found" });
     }
killedBy: Organizer Dashboard Controller completeEvent should complete event if user is team leader
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "completed"
Received: "published"

[Killed] EqualityOperator
controllers/organizer_controllers/event.manage.controller.js:293:9
     }
 
     // Authorization check: Only the team leader can complete the event.
-    if (event.createdBy.leader.toString() !== userId) {
+    if (event.createdBy.leader.toString() === userId) {
       return res.status(403).json({ message: "Forbidden: Only the team leader can complete this event." });
     }
killedBy: Organizer Dashboard Controller completeEvent should complete event if user is team leader
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "completed"
Received: "published"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.manage.controller.js:293:9
     }
 
     // Authorization check: Only the team leader can complete the event.
-    if (event.createdBy.leader.toString() !== userId) {
+    if (true) {
       return res.status(403).json({ message: "Forbidden: Only the team leader can complete this event." });
     }
killedBy: Organizer Dashboard Controller completeEvent should complete event if user is team leader
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "completed"
Received: "published"

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:301:9
     await event.save();
 
     // Notify the AI service to remove the event from its index
-    try {
-      await pythonClient.delete(`/recommend/delete/${event._id}`);
-    } catch (aiError) {
+    try {} catch (aiError) {
       console.error(`AI Service: Failed to de-index completed event ${event._id}`, aiError.message);
     }
killedBy: Organizer Dashboard Controller completeEvent should complete event if user is team leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommend/delete/evt1"

Number of calls: 0

[Survived] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:303:23
     // Notify the AI service to remove the event from its index
     try {
       await pythonClient.delete(`/recommend/delete/${event._id}`);
-    } catch (aiError) {
-      console.error(`AI Service: Failed to de-index completed event ${event._id}`, aiError.message);
-    }
+    } catch (aiError) {}
 
     // Repopulate to send back consistent data

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:304:21
     try {
       await pythonClient.delete(`/recommend/delete/${event._id}`);
     } catch (aiError) {
-      console.error(`AI Service: Failed to de-index completed event ${event._id}`, aiError.message);
+      console.error(``, aiError.message);
     }
 

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:310:37
     // Repopulate to send back consistent data
     const updatedEvent = await Event.findById(id).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
-    res.status(200).json({ message: "Event marked as completed.", event: updatedEvent });
+    res.status(200).json({ message: "", event: updatedEvent });
   } catch (err) {
     console.error(err);

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:311:17
     const updatedEvent = await Event.findById(id).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
     res.status(200).json({ message: "Event marked as completed.", event: updatedEvent });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to complete event", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Dashboard Controller completeEvent should handle errors in completeEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:317:48
   }
 };
 
-export const deleteEvent = async (req, res) => {
-  try {
-    const event = await Event.findByIdAndDelete(req.params.id);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-
-    res.status(200).json({ message: "Event deleted successfully" });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to delete event", error: err.message });
-  }
-};
+export const deleteEvent = async (req, res) => {};
 
 export const getPotentialSubEvents = async (req, res) => {
killedBy: Organizer Dashboard Controller deleteEvent should delete event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:318:7
 };
 
 export const deleteEvent = async (req, res) => {
-  try {
-    const event = await Event.findByIdAndDelete(req.params.id);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
-
-    res.status(200).json({ message: "Event deleted successfully" });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to delete event", error: err.message });
killedBy: Organizer Dashboard Controller deleteEvent should delete event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/event.manage.controller.js:320:9
 export const deleteEvent = async (req, res) => {
   try {
     const event = await Event.findByIdAndDelete(req.params.id);
-    if (!event) {
+    if (event) {
       return res.status(404).json({ message: "Event not found" });
     }
killedBy: Organizer Dashboard Controller deleteEvent should delete event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:320:17
 export const deleteEvent = async (req, res) => {
   try {
     const event = await Event.findByIdAndDelete(req.params.id);
-    if (!event) {
-      return res.status(404).json({ message: "Event not found" });
-    }
+    if (!event) {}
 
     res.status(200).json({ message: "Event deleted successfully" });
killedBy: Organizer Dashboard Controller deleteEvent should return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:325:17
     }
 
     res.status(200).json({ message: "Event deleted successfully" });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to delete event", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Dashboard Controller deleteEvent should handle errors in deleteEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/event.manage.controller.js:327:26
     res.status(200).json({ message: "Event deleted successfully" });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ message: "Failed to delete event", error: err.message });
+    res.status(500).json({});
   }
 };
killedBy: Organizer Dashboard Controller deleteEvent should handle errors in deleteEvent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Failed to delete event"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:331:58
   }
 };
 
-export const getPotentialSubEvents = async (req, res) => {
-  try {
-    const { teamId } = req.params;
-    const team = await Team.findById(teamId).populate({
-      path: 'leader',
-      select: 'college' // Explicitly select the college field
-    });
-
-    if (!team || !team.leader || !team.leader.college) {
-      console.log('Could not find college from team leader. Team:', team);
-      return res.status(200).json([]); // Return empty if college cannot be determined
-    }
-
-    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', 'name');
-    res.status(200).json(potentialEvents);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to fetch potential sub-events", error: err.message });
-  }
-};
+export const getPotentialSubEvents = async (req, res) => {};
killedBy: Organizer Dashboard Controller getPotentialSubEvents should return events from the same college
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"college": "College A", "status": "published"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:332:7
 };
 
 export const getPotentialSubEvents = async (req, res) => {
-  try {
-    const { teamId } = req.params;
-    const team = await Team.findById(teamId).populate({
-      path: 'leader',
-      select: 'college' // Explicitly select the college field
-    });
-
-    if (!team || !team.leader || !team.leader.college) {
-      console.log('Could not find college from team leader. Team:', team);
-      return res.status(200).json([]); // Return empty if college cannot be determined
-    }
-
-    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', 'name');
-    res.status(200).json(potentialEvents);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to fetch potential sub-events", error: err.message });
killedBy: Organizer Dashboard Controller getPotentialSubEvents should return events from the same college
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"college": "College A", "status": "published"}

Number of calls: 0

[Killed] LogicalOperator
controllers/organizer_controllers/event.manage.controller.js:339:9
       select: 'college' // Explicitly select the college field
     });
 
-    if (!team || !team.leader || !team.leader.college) {
+    if ((!team || !team.leader) && !team.leader.college) {
       console.log('Could not find college from team leader. Team:', team);
       return res.status(200).json([]); // Return empty if college cannot be determined
killedBy: Organizer Dashboard Controller getPotentialSubEvents should return empty array if team/college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] LogicalOperator
controllers/organizer_controllers/event.manage.controller.js:339:9
       select: 'college' // Explicitly select the college field
     });
 
-    if (!team || !team.leader || !team.leader.college) {
+    if (!team && !team.leader || !team.leader.college) {
       console.log('Could not find college from team leader. Team:', team);
       return res.status(200).json([]); // Return empty if college cannot be determined
killedBy: Organizer Dashboard Controller getPotentialSubEvents should return empty array if team/college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:340:19
     });
 
     if (!team || !team.leader || !team.leader.college) {
-      console.log('Could not find college from team leader. Team:', team);
+      console.log("", team);
       return res.status(200).json([]); // Return empty if college cannot be determined
     }

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:344:165
       return res.status(200).json([]); // Return empty if college cannot be determined
     }
 
-    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', 'name');
+    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', "");
     res.status(200).json(potentialEvents);
   } catch (err) {

[Survived] StringLiteral
controllers/organizer_controllers/event.manage.controller.js:344:152
       return res.status(200).json([]); // Return empty if college cannot be determined
     }
 
-    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', 'name');
+    const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate("", 'name');
     res.status(200).json(potentialEvents);
   } catch (err) {

[Killed] BlockStatement
controllers/organizer_controllers/event.manage.controller.js:346:17
 
     const potentialEvents = await Event.find({ college: team.leader.college, status: 'published' }).select('_id title description createdBy').populate('createdBy', 'name');
     res.status(200).json(potentialEvents);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to fetch potential sub-events", error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: Organizer Dashboard Controller getPotentialSubEvents should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
