[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:8:9
 export const createTeamForEvent = async (req, res) => {
   try {
     let {name, description, members} = req.body;
-    if (!name?.trim()) {
+    if (name?.trim()) {
       return res.status(400).json({ message: "Team name is required" });
     }
killedBy: Organizer Team Controller createTeamForEvent should return 400 if name is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:8:9
 export const createTeamForEvent = async (req, res) => {
   try {
     let {name, description, members} = req.body;
-    if (!name?.trim()) {
+    if (false) {
       return res.status(400).json({ message: "Team name is required" });
     }
killedBy: Organizer Team Controller createTeamForEvent should return 400 if name is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] MethodExpression
controllers/organizer_controllers/event.team.controller.js:11:12
     if (!name?.trim()) {
       return res.status(400).json({ message: "Team name is required" });
     }
-    name = name.trim();
+    name = name;
 
     const leaderId = req.user.id;

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:15:59
 
     const leaderId = req.user.id;
 
-    const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: 'i' } });
+    const existing = await Team.findOne({ name: { $regex: ``, $options: 'i' } });
     if (existing) {
       return res.status(409).json({ message: "Team name already exists" });

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:15:82
 
     const leaderId = req.user.id;
 
-    const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: 'i' } });
+    const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: "" } });
     if (existing) {
       return res.status(409).json({ message: "Team name already exists" });

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:16:9
     const leaderId = req.user.id;
 
     const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: 'i' } });
-    if (existing) {
+    if (false) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Organizer Team Controller createTeamForEvent should return 409 if team name exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:16:9
     const leaderId = req.user.id;
 
     const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: 'i' } });
-    if (existing) {
+    if (true) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Organizer Team Controller createTeamForEvent should trim team name before creating
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 409

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:17:35
 
     const existing = await Team.findOne({ name: { $regex: `^${name}$`, $options: 'i' } });
     if (existing) {
-      return res.status(409).json({ message: "Team name already exists" });
+      return res.status(409).json({});
     }
 

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:22:9
 
     // Prepare members array with status "Pending"
     const teamMembers = [];
-    if (members && Array.isArray(members)) {
+    if (false) {
       for (const member of members) {
         // Assuming members array contains { user: userId, role: role }
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:22:44
 
     // Prepare members array with status "Pending"
     const teamMembers = [];
-    if (members && Array.isArray(members)) {
-      for (const member of members) {
-        // Assuming members array contains { user: userId, role: role }
-        const { user: userId, role } = member;
-        const userToInvite = await User.findById(userId);
-        if (!userToInvite) {
-          console.error(`User with id ${userId} not found`);
-          continue;
-        }
-        teamMembers.push({ user: userId, role: role || "volunteer", status: "Pending" });
-      }
-    }
+    if (members && Array.isArray(members)) {}
 
     const team = await Team.create({ name, description, leader: leaderId, members: teamMembers });
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:23:37
     // Prepare members array with status "Pending"
     const teamMembers = [];
     if (members && Array.isArray(members)) {
-      for (const member of members) {
-        // Assuming members array contains { user: userId, role: role }
-        const { user: userId, role } = member;
-        const userToInvite = await User.findById(userId);
-        if (!userToInvite) {
-          console.error(`User with id ${userId} not found`);
-          continue;
-        }
-        teamMembers.push({ user: userId, role: role || "volunteer", status: "Pending" });
-      }
+      for (const member of members) {}
     }
 
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:27:13
         // Assuming members array contains { user: userId, role: role }
         const { user: userId, role } = member;
         const userToInvite = await User.findById(userId);
-        if (!userToInvite) {
+        if (true) {
           console.error(`User with id ${userId} not found`);
           continue;
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:27:13
         // Assuming members array contains { user: userId, role: role }
         const { user: userId, role } = member;
         const userToInvite = await User.findById(userId);
-        if (!userToInvite) {
+        if (userToInvite) {
           console.error(`User with id ${userId} not found`);
           continue;
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:28:25
         const { user: userId, role } = member;
         const userToInvite = await User.findById(userId);
         if (!userToInvite) {
-          console.error(`User with id ${userId} not found`);
+          console.error(``);
           continue;
         }

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:31:48
           console.error(`User with id ${userId} not found`);
           continue;
         }
-        teamMembers.push({ user: userId, role: role || "volunteer", status: "Pending" });
+        teamMembers.push({ user: userId, role: false, status: "Pending" });
       }
     }
killedBy: Organizer Team Controller createTeamForEvent should use default volunteer role when role not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"members": ArrayContaining [ObjectContaining {"role": "volunteer"}]}
Received: {"description": undefined, "leader": "user123", "members": [{"role": false, "status": "Pending", "user": "u2"}], "name": "Team"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:31:48
           console.error(`User with id ${userId} not found`);
           continue;
         }
-        teamMembers.push({ user: userId, role: role || "volunteer", status: "Pending" });
+        teamMembers.push({ user: userId, role: true, status: "Pending" });
       }
     }
killedBy: Organizer Team Controller createTeamForEvent should use default volunteer role when role not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"members": ArrayContaining [ObjectContaining {"role": "volunteer"}]}
Received: {"description": undefined, "leader": "user123", "members": [{"role": true, "status": "Pending", "user": "u2"}], "name": "Team"}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:38:39
     const team = await Team.create({ name, description, leader: leaderId, members: teamMembers });
 
     // Send invites to each member
-    for (const member of teamMembers) {
-      const existingInvitation = await InboxEntity.findOne({
-        relatedTeam: team._id,
-        to: member.user,
-        status: "Pending",
-        type: "team_invite"
-      });
-
-      if (!existingInvitation) {
-        await InboxEntity.create({
-          type: "team_invite",
-          title: `Invitation to join team: ${team.name}`,
-          description: `You have been invited to join ${team.name} as a ${member.role}.`,
-          from: leaderId,
-          to: member.user,
-          status: "Pending",
-          relatedTeam: team._id,
-          relatedTeamModel: "Team",
-          role: member.role,
-        });
-      }
-    }
+    for (const member of teamMembers) {}
 
     res.status(201).json({ message: "Team created successfully and invites sent", team });
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:39:60
 
     // Send invites to each member
     for (const member of teamMembers) {
-      const existingInvitation = await InboxEntity.findOne({
-        relatedTeam: team._id,
-        to: member.user,
-        status: "Pending",
-        type: "team_invite"
-      });
+      const existingInvitation = await InboxEntity.findOne({});
 
       if (!existingInvitation) {

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:46:11
         type: "team_invite"
       });
 
-      if (!existingInvitation) {
+      if (false) {
         await InboxEntity.create({
           type: "team_invite",
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:46:11
         type: "team_invite"
       });
 
-      if (!existingInvitation) {
+      if (existingInvitation) {
         await InboxEntity.create({
           type: "team_invite",
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:47:34
       });
 
       if (!existingInvitation) {
-        await InboxEntity.create({
-          type: "team_invite",
-          title: `Invitation to join team: ${team.name}`,
-          description: `You have been invited to join ${team.name} as a ${member.role}.`,
-          from: leaderId,
-          to: member.user,
-          status: "Pending",
-          relatedTeam: team._id,
-          relatedTeamModel: "Team",
-          role: member.role,
-        });
+        await InboxEntity.create({});
       }
     }
killedBy: Organizer Team Controller createTeamForEvent should create team and invite members
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": "u2", "type": "team_invite"}
Received: {}

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:53:19
           description: `You have been invited to join ${team.name} as a ${member.role}.`,
           from: leaderId,
           to: member.user,
-          status: "Pending",
+          status: "",
           relatedTeam: team._id,
           relatedTeamModel: "Team",

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:61:37
       }
     }
 
-    res.status(201).json({ message: "Team created successfully and invites sent", team });
+    res.status(201).json({ message: "", team });
   } catch (err) {
     console.error(err);

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:62:17
     }
 
     res.status(201).json({ message: "Team created successfully and invites sent", team });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to create team", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller createTeamForEvent should handle DB errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:64:26
     res.status(201).json({ message: "Team created successfully and invites sent", team });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ message: "Failed to create team", error: err.message });
+    res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:68:48
   }
 };
 
-export const getTeamList = async (req, res) => {
-  try {
-    const teams = await Team.find({}).populate('members.user', 'profile.name username email').populate('leader', 'profile.name username email');
-    res.status(200).json(teams);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve team list", error: err.message });
-  }
-};
+export const getTeamList = async (req, res) => {};
 
 export const getAllUserDetails = async (req, res) => {
killedBy: Organizer Team Controller getTeamList should return teams list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:69:7
 };
 
 export const getTeamList = async (req, res) => {
-  try {
-    const teams = await Team.find({}).populate('members.user', 'profile.name username email').populate('leader', 'profile.name username email');
-    res.status(200).json(teams);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to retrieve team list", error: err.message });
killedBy: Organizer Team Controller getTeamList should return teams list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:70:104
 
 export const getTeamList = async (req, res) => {
   try {
-    const teams = await Team.find({}).populate('members.user', 'profile.name username email').populate('leader', 'profile.name username email');
+    const teams = await Team.find({}).populate('members.user', 'profile.name username email').populate("", 'profile.name username email');
     res.status(200).json(teams);
   } catch (err) {

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:72:17
   try {
     const teams = await Team.find({}).populate('members.user', 'profile.name username email').populate('leader', 'profile.name username email');
     res.status(200).json(teams);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve team list", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller getTeamList should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:78:54
   }
 };
 
-export const getAllUserDetails = async (req, res) => {
-  try {
-    const users = await User.find({ role: { $eq: "organizer" } }, 'profile username email'); // Fetch only necessary fields
-    return res.status(200).json(users);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve users", error: err.message });
-  }
-};
+export const getAllUserDetails = async (req, res) => {};
 
 export const respondToInvitation = async (req, res) => {
killedBy: Organizer Team Controller getAllUserDetails should return organizers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:79:7
 };
 
 export const getAllUserDetails = async (req, res) => {
-  try {
-    const users = await User.find({ role: { $eq: "organizer" } }, 'profile username email'); // Fetch only necessary fields
-    return res.status(200).json(users);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to retrieve users", error: err.message });
killedBy: Organizer Team Controller getAllUserDetails should return organizers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:80:50
 
 export const getAllUserDetails = async (req, res) => {
   try {
-    const users = await User.find({ role: { $eq: "organizer" } }, 'profile username email'); // Fetch only necessary fields
+    const users = await User.find({ role: { $eq: "" } }, 'profile username email'); // Fetch only necessary fields
     return res.status(200).json(users);
   } catch (err) {

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:80:35
 
 export const getAllUserDetails = async (req, res) => {
   try {
-    const users = await User.find({ role: { $eq: "organizer" } }, 'profile username email'); // Fetch only necessary fields
+    const users = await User.find({}, 'profile username email'); // Fetch only necessary fields
     return res.status(200).json(users);
   } catch (err) {

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:82:17
   try {
     const users = await User.find({ role: { $eq: "organizer" } }, 'profile username email'); // Fetch only necessary fields
     return res.status(200).json(users);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve users", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller getAllUserDetails should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:93:9
     const { invitationId, decision } = req.body;
     const userId = req.user.id;
 
-    if (!invitationId || !decision || !["Approved", "Rejected"].includes(decision)) {
+    if (false) {
       return res.status(400).json({ message: "A valid invitationId and decision ('Approved' or 'Rejected') are required" });
     }
killedBy: Organizer Team Controller respondToInvitation should return 400 for invalid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:93:9
     const { invitationId, decision } = req.body;
     const userId = req.user.id;
 
-    if (!invitationId || !decision || !["Approved", "Rejected"].includes(decision)) {
+    if (false || !["Approved", "Rejected"].includes(decision)) {
       return res.status(400).json({ message: "A valid invitationId and decision ('Approved' or 'Rejected') are required" });
     }
killedBy: Organizer Team Controller respondToInvitation should return 400 when invitationId is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:97:50
       return res.status(400).json({ message: "A valid invitationId and decision ('Approved' or 'Rejected') are required" });
     }
 
-    const invitation = await InboxEntity.findOne({
-      _id: invitationId,
-      status: "Pending",
-      type: "team_invite"
-    });
+    const invitation = await InboxEntity.findOne({});
 
     if (!invitation) {

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:103:9
       type: "team_invite"
     });
 
-    if (!invitation) {
+    if (false) {
       return res.status(404).json({ message: "Invitation not found or has already been addressed" });
     }
killedBy: Organizer Team Controller respondToInvitation should return 404 if invitation not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:103:22
       type: "team_invite"
     });
 
-    if (!invitation) {
-      return res.status(404).json({ message: "Invitation not found or has already been addressed" });
-    }
+    if (!invitation) {}
 
     if (invitation.to.toString() !== userId.toString()) {
killedBy: Organizer Team Controller respondToInvitation should return 404 if invitation not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:104:35
     });
 
     if (!invitation) {
-      return res.status(404).json({ message: "Invitation not found or has already been addressed" });
+      return res.status(404).json({});
     }
 

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:107:57
       return res.status(404).json({ message: "Invitation not found or has already been addressed" });
     }
 
-    if (invitation.to.toString() !== userId.toString()) {
-      return res.status(403).json({ message: "You are not authorized to respond to this invitation" });
-    }
+    if (invitation.to.toString() !== userId.toString()) {}
 
     invitation.status = decision;
killedBy: Organizer Team Controller respondToInvitation should return 403 if unauthorized
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:107:9
       return res.status(404).json({ message: "Invitation not found or has already been addressed" });
     }
 
-    if (invitation.to.toString() !== userId.toString()) {
+    if (true) {
       return res.status(403).json({ message: "You are not authorized to respond to this invitation" });
     }
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:108:46
     }
 
     if (invitation.to.toString() !== userId.toString()) {
-      return res.status(403).json({ message: "You are not authorized to respond to this invitation" });
+      return res.status(403).json({ message: "" });
     }
 

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:114:9
     invitation.status = decision;
     await invitation.save();
 
-    if (decision === "Approved") {
+    if (false) {
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:114:9
     invitation.status = decision;
     await invitation.save();
 
-    if (decision === "Approved") {
+    if (true) {
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
killedBy: Organizer Team Controller respondToInvitation should reject invitation and remove member
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"status": "Approved", "user": "user123"}, {"user": "other"}]

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:116:17
 
     if (decision === "Approved") {
       const team = await Team.findById(invitation.relatedTeam);
-      if (team) {
-        // Update the member's status to "Approved"
-        const member = team.members.find(m => m.user.toString() === userId.toString());
-        if (member) {
-          member.status = "Approved";
-          await team.save();
-        } else {
-          // If member not found, add them (fallback)
-          team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
-          await team.save();
-        }
-      } else {
+      if (team) {} else {
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
         return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:116:11
 
     if (decision === "Approved") {
       const team = await Team.findById(invitation.relatedTeam);
-      if (team) {
+      if (false) {
         // Update the member's status to "Approved"
         const member = team.members.find(m => m.user.toString() === userId.toString());
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:118:47
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
         // Update the member's status to "Approved"
-        const member = team.members.find(m => m.user.toString() === userId.toString());
+        const member = team.members.find(m => m.user.toString() !== userId.toString());
         if (member) {
           member.status = "Approved";
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ArrowFunction
controllers/organizer_controllers/event.team.controller.js:118:42
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
         // Update the member's status to "Approved"
-        const member = team.members.find(m => m.user.toString() === userId.toString());
+        const member = team.members.find(() => undefined);
         if (member) {
           member.status = "Approved";
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:119:13
       if (team) {
         // Update the member's status to "Approved"
         const member = team.members.find(m => m.user.toString() === userId.toString());
-        if (member) {
+        if (true) {
           member.status = "Approved";
           await team.save();
killedBy: Organizer Team Controller respondToInvitation should approve invitation and add member if not found in team
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
