[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:119:21
       if (team) {
         // Update the member's status to "Approved"
         const member = team.members.find(m => m.user.toString() === userId.toString());
-        if (member) {
-          member.status = "Approved";
-          await team.save();
-        } else {
+        if (member) {} else {
           // If member not found, add them (fallback)
           team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
killedBy: Organizer Team Controller respondToInvitation should approve invitation and update existing member status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:122:16
         if (member) {
           member.status = "Approved";
           await team.save();
-        } else {
-          // If member not found, add them (fallback)
-          team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
-          await team.save();
-        }
+        } else {}
       } else {
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
killedBy: Organizer Team Controller respondToInvitation should approve invitation and add member if not found in team
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] LogicalOperator
controllers/organizer_controllers/event.team.controller.js:124:51
           await team.save();
         } else {
           // If member not found, add them (fallback)
-          team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
+          team.members.push({ user: userId, role: invitation.role && "volunteer", status: "Approved" });
           await team.save();
         }

[Survived] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:124:51
           await team.save();
         } else {
           // If member not found, add them (fallback)
-          team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
+          team.members.push({ user: userId, role: false, status: "Approved" });
           await team.save();
         }

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:127:14
           team.members.push({ user: userId, role: invitation.role || "volunteer", status: "Approved" });
           await team.save();
         }
-      } else {
-        console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
-        return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
-      }
+      } else {}
     } else if (decision === "Rejected") {
       // Remove the member from the team if rejected
killedBy: Organizer Team Controller respondToInvitation should return 500 if team not found during approval
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:128:23
           await team.save();
         }
       } else {
-        console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
+        console.error(``);
         return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
       }

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:129:37
         }
       } else {
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
-        return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
+        return res.status(500).json({});
       }
     } else if (decision === "Rejected") {

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:129:48
         }
       } else {
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
-        return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
+        return res.status(500).json({ message: `` });
       }
     } else if (decision === "Rejected") {

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:131:41
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
         return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
       }
-    } else if (decision === "Rejected") {
-      // Remove the member from the team if rejected
-      const team = await Team.findById(invitation.relatedTeam);
-      if (team) {
-        team.members = team.members.filter(m => m.user.toString() !== userId.toString());
-        await team.save();
-      }
-    }
+    } else if (decision === "Rejected") {}
 
     res.status(200).json({ message: `Invitation ${decision} successfully`, invitation });
killedBy: Organizer Team Controller respondToInvitation should reject invitation and remove member
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"user": "user123"}, {"user": "other"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:131:16
         console.error(`Team with id ${invitation.relatedTeam} not found after accepting invitation.`);
         return res.status(500).json({ message: `Invitation ${decision}, but failed to find associated team.` });
       }
-    } else if (decision === "Rejected") {
+    } else if (false) {
       // Remove the member from the team if rejected
       const team = await Team.findById(invitation.relatedTeam);
killedBy: Organizer Team Controller respondToInvitation should reject invitation and remove member
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"user": "user123"}, {"user": "other"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:134:11
     } else if (decision === "Rejected") {
       // Remove the member from the team if rejected
       const team = await Team.findById(invitation.relatedTeam);
-      if (team) {
+      if (true) {
         team.members = team.members.filter(m => m.user.toString() !== userId.toString());
         await team.save();
killedBy: Organizer Team Controller respondToInvitation should handle rejection even when team is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:135:49
       // Remove the member from the team if rejected
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
-        team.members = team.members.filter(m => m.user.toString() !== userId.toString());
+        team.members = team.members.filter(m => true);
         await team.save();
       }
killedBy: Organizer Team Controller respondToInvitation should reject invitation and remove member
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"user": "user123"}, {"user": "other"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:135:49
       // Remove the member from the team if rejected
       const team = await Team.findById(invitation.relatedTeam);
       if (team) {
-        team.members = team.members.filter(m => m.user.toString() !== userId.toString());
+        team.members = team.members.filter(m => false);
         await team.save();
       }
killedBy: Organizer Team Controller respondToInvitation should reject invitation and remove member
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:140:26
       }
     }
 
-    res.status(200).json({ message: `Invitation ${decision} successfully`, invitation });
+    res.status(200).json({});
   } catch (err) {
     console.error(err);

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:140:37
       }
     }
 
-    res.status(200).json({ message: `Invitation ${decision} successfully`, invitation });
+    res.status(200).json({ message: ``, invitation });
   } catch (err) {
     console.error(err);

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:141:17
     }
 
     res.status(200).json({ message: `Invitation ${decision} successfully`, invitation });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to respond to invitation", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller respondToInvitation should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:147:51
   }
 };
 
-export const getTeamDetails = async (req, res) => {
-  try {
-    const { teamId } = req.params;
-    const team = await Team.findById(teamId).populate("leader", "profile.name username").populate("members.user", "profile.name username");
-
-    if (!team) {
-      return res.status(404).json({ message: "Team not found" });
-    }
-    res.status(200).json(team);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve team details", error: err.message });
-  }
-};
+export const getTeamDetails = async (req, res) => {};
 
 export const getUserInvitations = async (req, res) => {
killedBy: Organizer Team Controller getTeamDetails should return team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:148:7
 };
 
 export const getTeamDetails = async (req, res) => {
-  try {
-    const { teamId } = req.params;
-    const team = await Team.findById(teamId).populate("leader", "profile.name username").populate("members.user", "profile.name username");
-
-    if (!team) {
-      return res.status(404).json({ message: "Team not found" });
-    }
-    res.status(200).json(team);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to retrieve team details", error: err.message });
killedBy: Organizer Team Controller getTeamDetails should return team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:152:9
     const { teamId } = req.params;
     const team = await Team.findById(teamId).populate("leader", "profile.name username").populate("members.user", "profile.name username");
 
-    if (!team) {
+    if (false) {
       return res.status(404).json({ message: "Team not found" });
     }
killedBy: Organizer Team Controller getTeamDetails should return 404 if not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:152:9
     const { teamId } = req.params;
     const team = await Team.findById(teamId).populate("leader", "profile.name username").populate("members.user", "profile.name username");
 
-    if (!team) {
+    if (true) {
       return res.status(404).json({ message: "Team not found" });
     }
killedBy: Organizer Team Controller getTeamDetails should return team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:153:35
     const team = await Team.findById(teamId).populate("leader", "profile.name username").populate("members.user", "profile.name username");
 
     if (!team) {
-      return res.status(404).json({ message: "Team not found" });
+      return res.status(404).json({});
     }
     res.status(200).json(team);

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:156:17
       return res.status(404).json({ message: "Team not found" });
     }
     res.status(200).json(team);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve team details", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller getTeamDetails should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:158:26
     res.status(200).json(team);
   } catch (err) {
     console.error(err);
-    res.status(500).json({ message: "Failed to retrieve team details", error: err.message });
+    res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:162:55
   }
 };
 
-export const getUserInvitations = async (req, res) => {
-  try {
-    const invitations = await InboxEntity.find({ 
-      to: req.user.id, 
-      status: "Pending",
-      type: "team_invite"
-    })
-      .populate("relatedTeam", "name")
-      .populate("from", "name username");
-
-    res.status(200).json(invitations);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve invitations", error: err.message });
-  }
-};
+export const getUserInvitations = async (req, res) => {};
 
 export const removeTeam = async (req, res) => {
killedBy: Organizer Team Controller getUserInvitations should return invitations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:163:7
 };
 
 export const getUserInvitations = async (req, res) => {
-  try {
-    const invitations = await InboxEntity.find({ 
-      to: req.user.id, 
-      status: "Pending",
-      type: "team_invite"
-    })
-      .populate("relatedTeam", "name")
-      .populate("from", "name username");
-
-    res.status(200).json(invitations);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to retrieve invitations", error: err.message });
killedBy: Organizer Team Controller getUserInvitations should return invitations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:166:15
   try {
     const invitations = await InboxEntity.find({ 
       to: req.user.id, 
-      status: "Pending",
+      status: "",
       type: "team_invite"
     })

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:167:13
     const invitations = await InboxEntity.find({ 
       to: req.user.id, 
       status: "Pending",
-      type: "team_invite"
+      type: ""
     })
       .populate("relatedTeam", "name")

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:169:17
       status: "Pending",
       type: "team_invite"
     })
-      .populate("relatedTeam", "name")
+      .populate("", "name")
       .populate("from", "name username");
 

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:173:17
       .populate("from", "name username");
 
     res.status(200).json(invitations);
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to retrieve invitations", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller getUserInvitations should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:180:7
 };
 
 export const removeTeam = async (req, res) => {
-  try {
-    const { teamId } = req.params;
-    const leaderId = req.user.id;
-    
-    
-    const team = await Team.findById(teamId);
-    if (!team) {
-      return res.status(404).json({ message: "Team not found" });
-    }
-    
-    if (team.leader.toString() !== leaderId.toString()) {
-      return res.status(403).json({ message: "Only the team leader can delete the team" });
-    }
-    
-
-    await Team.findByIdAndDelete(teamId);
-
-    // FUTURE_TODO: Also delete all pending InboxEntity invitations for this team
-    // await InboxEntity.deleteMany({ relatedTeam: teamId, type: "team_invite" });
-
-    res.status(200).json({ message: "Team deleted successfully" });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ message: "Failed to delete team", error: err.message });
killedBy: Organizer Team Controller removeTeam should delete team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "t1"

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:186:16
     
     
     const team = await Team.findById(teamId);
-    if (!team) {
-      return res.status(404).json({ message: "Team not found" });
-    }
+    if (!team) {}
     
     if (team.leader.toString() !== leaderId.toString()) {
killedBy: Organizer Team Controller removeTeam should return 404 if team not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:186:9
     
     
     const team = await Team.findById(teamId);
-    if (!team) {
+    if (team) {
       return res.status(404).json({ message: "Team not found" });
     }
killedBy: Organizer Team Controller removeTeam should delete team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "t1"

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:190:9
       return res.status(404).json({ message: "Team not found" });
     }
     
-    if (team.leader.toString() !== leaderId.toString()) {
+    if (true) {
       return res.status(403).json({ message: "Only the team leader can delete the team" });
     }
killedBy: Organizer Team Controller removeTeam should delete team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "t1"

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:190:57
       return res.status(404).json({ message: "Team not found" });
     }
     
-    if (team.leader.toString() !== leaderId.toString()) {
-      return res.status(403).json({ message: "Only the team leader can delete the team" });
-    }
+    if (team.leader.toString() !== leaderId.toString()) {}
     
 
killedBy: Organizer Team Controller removeTeam should return 403 if not leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:191:35
     }
     
     if (team.leader.toString() !== leaderId.toString()) {
-      return res.status(403).json({ message: "Only the team leader can delete the team" });
+      return res.status(403).json({});
     }
     

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:200:26
     // FUTURE_TODO: Also delete all pending InboxEntity invitations for this team
     // await InboxEntity.deleteMany({ relatedTeam: teamId, type: "team_invite" });
 
-    res.status(200).json({ message: "Team deleted successfully" });
+    res.status(200).json({});
   } catch (err) {
     console.error(err);

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:201:17
     // await InboxEntity.deleteMany({ relatedTeam: teamId, type: "team_invite" });
 
     res.status(200).json({ message: "Team deleted successfully" });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to delete team", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller removeTeam should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:203:37
     res.status(200).json({ message: "Team deleted successfully" });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ message: "Failed to delete team", error: err.message });
+    res.status(500).json({ message: "", error: err.message });
   }
 };

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:203:26
     res.status(200).json({ message: "Team deleted successfully" });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ message: "Failed to delete team", error: err.message });
+    res.status(500).json({});
   }
 };

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:215:9
     const invitedBy = req.user.id;
 
     const team = await Team.findById(teamId);
-    if (!team) {
+    if (true) {
       return res.status(404).json({ message: "Team not found" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:219:9
       return res.status(404).json({ message: "Team not found" });
     }
 
-    if (team.leader.toString() !== invitedBy.toString()) {
+    if (team.leader.toString() === invitedBy.toString()) {
       return res.status(403).json({ message: "Only the team leader can send invitations" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:219:9
       return res.status(404).json({ message: "Team not found" });
     }
 
-    if (team.leader.toString() !== invitedBy.toString()) {
+    if (true) {
       return res.status(403).json({ message: "Only the team leader can send invitations" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:220:35
     }
 
     if (team.leader.toString() !== invitedBy.toString()) {
-      return res.status(403).json({ message: "Only the team leader can send invitations" });
+      return res.status(403).json({});
     }
 

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:224:24
     }
 
     const userToInvite = await User.findOne({ username });
-    if (!userToInvite) {
-      return res.status(404).json({ message: "User with this username not found" });
-    }
+    if (!userToInvite) {}
 
     if (userToInvite._id.toString() === invitedBy.toString()) {
killedBy: Organizer Team Controller inviteMemberToTeam should return 404 if user missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:224:9
     }
 
     const userToInvite = await User.findOne({ username });
-    if (!userToInvite) {
+    if (userToInvite) {
       return res.status(404).json({ message: "User with this username not found" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:225:46
 
     const userToInvite = await User.findOne({ username });
     if (!userToInvite) {
-      return res.status(404).json({ message: "User with this username not found" });
+      return res.status(404).json({ message: "" });
     }
 

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:228:63
       return res.status(404).json({ message: "User with this username not found" });
     }
 
-    if (userToInvite._id.toString() === invitedBy.toString()) {
-        return res.status(400).json({ message: "You cannot invite yourself to the team." });
-    }
+    if (userToInvite._id.toString() === invitedBy.toString()) {}
 
     const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
killedBy: Organizer Team Controller inviteMemberToTeam should return 400 if inviting self
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:228:9
       return res.status(404).json({ message: "User with this username not found" });
     }
 
-    if (userToInvite._id.toString() === invitedBy.toString()) {
+    if (userToInvite._id.toString() !== invitedBy.toString()) {
         return res.status(400).json({ message: "You cannot invite yourself to the team." });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:229:37
     }
 
     if (userToInvite._id.toString() === invitedBy.toString()) {
-        return res.status(400).json({ message: "You cannot invite yourself to the team." });
+        return res.status(400).json({});
     }
 

[Killed] MethodExpression
controllers/organizer_controllers/event.team.controller.js:232:29
         return res.status(400).json({ message: "You cannot invite yourself to the team." });
     }
 
-    const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
+    const isAlreadyMember = team.members.every(member => member.user.toString() === userToInvite._id.toString());
     if (isAlreadyMember) {
       return res.status(400).json({ message: "User is already a member of this team" });
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:232:57
         return res.status(400).json({ message: "You cannot invite yourself to the team." });
     }
 
-    const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
+    const isAlreadyMember = team.members.some(member => member.user.toString() !== userToInvite._id.toString());
     if (isAlreadyMember) {
       return res.status(400).json({ message: "User is already a member of this team" });
killedBy: Organizer Team Controller inviteMemberToTeam should return 400 if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:233:9
     }
 
     const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
-    if (isAlreadyMember) {
+    if (false) {
       return res.status(400).json({ message: "User is already a member of this team" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should return 400 if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:233:9
     }
 
     const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
-    if (isAlreadyMember) {
+    if (true) {
       return res.status(400).json({ message: "User is already a member of this team" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:234:35
 
     const isAlreadyMember = team.members.some(member => member.user.toString() === userToInvite._id.toString());
     if (isAlreadyMember) {
-      return res.status(400).json({ message: "User is already a member of this team" });
+      return res.status(400).json({});
     }
 
