[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:237:58
       return res.status(400).json({ message: "User is already a member of this team" });
     }
 
-    const existingInvitation = await InboxEntity.findOne({
-      relatedTeam: teamId,
-      to: userToInvite._id,
-      status: "Pending",
-      type: "team_invite"
-    });
+    const existingInvitation = await InboxEntity.findOne({});
 
     if (existingInvitation) {

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:244:9
       type: "team_invite"
     });
 
-    if (existingInvitation) {
+    if (true) {
       return res.status(400).json({ message: "An invitation has already been sent to this user" });
     }
killedBy: Organizer Team Controller inviteMemberToTeam should invite member successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:244:29
       type: "team_invite"
     });
 
-    if (existingInvitation) {
-      return res.status(400).json({ message: "An invitation has already been sent to this user" });
-    }
+    if (existingInvitation) {}
 
     // Add member to team with status "Pending"
killedBy: Organizer Team Controller inviteMemberToTeam should return 400 if invite pending
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:245:35
     });
 
     if (existingInvitation) {
-      return res.status(400).json({ message: "An invitation has already been sent to this user" });
+      return res.status(400).json({});
     }
 

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:249:55
     }
 
     // Add member to team with status "Pending"
-    team.members.push({ user: userToInvite._id, role: role || "volunteer", status: "Pending" });
+    team.members.push({ user: userToInvite._id, role: true, status: "Pending" });
     await team.save();
 
killedBy: Organizer Team Controller inviteMemberToTeam should use default volunteer role when role not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "volunteer"
Received: true

[Killed] LogicalOperator
controllers/organizer_controllers/event.team.controller.js:249:55
     }
 
     // Add member to team with status "Pending"
-    team.members.push({ user: userToInvite._id, role: role || "volunteer", status: "Pending" });
+    team.members.push({ user: userToInvite._id, role: role && "volunteer", status: "Pending" });
     await team.save();
 
killedBy: Organizer Team Controller inviteMemberToTeam should use default volunteer role when role not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "volunteer"
Received: undefined

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:253:13
     await team.save();
 
     const invitation = await InboxEntity.create({
-      type: "team_invite",
+      type: "",
       title: `Invitation to join team: ${team.name}`,
       description: `You have been invited to join ${team.name} as a ${role}.`,

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:254:14
 
     const invitation = await InboxEntity.create({
       type: "team_invite",
-      title: `Invitation to join team: ${team.name}`,
+      title: ``,
       description: `You have been invited to join ${team.name} as a ${role}.`,
       from: invitedBy,

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:261:13
       status: "Pending",
       relatedTeam: teamId,
       relatedTeamModel: "Team",
-      role: role || "volunteer",
+      role: false,
     });
 
killedBy: Organizer Team Controller inviteMemberToTeam should use default volunteer role when role not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "volunteer"}
Received: {"description": "You have been invited to join T1 as a undefined.", "from": "user123", "relatedTeam": "t1", "relatedTeamModel": "Team", "role": false, "status": "Pending", "title": "Invitation to join team: T1", "to": "u2", "type": "team_invite"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:261:13
       status: "Pending",
       relatedTeam: teamId,
       relatedTeamModel: "Team",
-      role: role || "volunteer",
+      role: true,
     });
 
killedBy: Organizer Team Controller inviteMemberToTeam should use default volunteer role when role not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "volunteer"}
Received: {"description": "You have been invited to join T1 as a undefined.", "from": "user123", "relatedTeam": "t1", "relatedTeamModel": "Team", "role": true, "status": "Pending", "title": "Invitation to join team: T1", "to": "u2", "type": "team_invite"}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:265:17
     });
 
     res.status(201).json({ message: "Invitation sent successfully", invitation });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ message: "Failed to send invitation", error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Organizer Team Controller inviteMemberToTeam should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:273:17
 
 export const updateTeam = async (req, res) => {
   try {
-    console.log("UpdateTeam payload:", req.body);
+    console.log("", req.body);
     const { teamId } = req.params;
     const { name, description, membersToRemove, membersToUpdate, membersToAdd } = req.body;

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:280:9
 
     // 1. Get and Authorize Team
     const team = await Team.findById(teamId);
-    if (!team) {
+    if (false) {
       return res.status(404).json({ message: "Team not found" });
     }
killedBy: Organizer Team Controller updateTeam should return 404 if team not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:284:9
       return res.status(404).json({ message: "Team not found" });
     }
 
-    if (team.leader.toString() !== leaderId.toString()) {
+    if (false) {
       return res.status(403).json({ message: "Only the team leader can edit the team" });
     }
killedBy: Organizer Team Controller updateTeam should return 403 if not leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:284:57
       return res.status(404).json({ message: "Team not found" });
     }
 
-    if (team.leader.toString() !== leaderId.toString()) {
-      return res.status(403).json({ message: "Only the team leader can edit the team" });
-    }
+    if (team.leader.toString() !== leaderId.toString()) {}
 
     let hasChanges = false;
killedBy: Organizer Team Controller updateTeam should return 403 if not leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:288:22
       return res.status(403).json({ message: "Only the team leader can edit the team" });
     }
 
-    let hasChanges = false;
+    let hasChanges = true;
     const validRoles = ["co-organizer", "volunteer", "editor"];
 
killedBy: Organizer Team Controller updateTeam should handle no changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:292:29
     const validRoles = ["co-organizer", "volunteer", "editor"];
 
     // 2. Handle Name Change (if provided)
-    if (name !== undefined) {
-      const trimmedNewName = name.trim();
-      if (trimmedNewName === "") {
-        return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
-      }
-
-      if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
-        const existing = await Team.findOne({ name: trimmedNewName })
-                                  .collation({ locale: 'en', strength: 2 });
-        if (existing) {
-          return res.status(409).json({ message: "Team name already exists" });
-        }
-        team.name = trimmedNewName;
-        hasChanges = true;
-      }
-    }
+    if (name !== undefined) {}
 
     // 3. Handle Description Change (if provided)
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original Name"

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:292:9
     const validRoles = ["co-organizer", "volunteer", "editor"];
 
     // 2. Handle Name Change (if provided)
-    if (name !== undefined) {
+    if (name === undefined) {
       const trimmedNewName = name.trim();
       if (trimmedNewName === "") {
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original Name"

[Killed] MethodExpression
controllers/organizer_controllers/event.team.controller.js:293:30
 
     // 2. Handle Name Change (if provided)
     if (name !== undefined) {
-      const trimmedNewName = name.trim();
+      const trimmedNewName = name;
       if (trimmedNewName === "") {
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
killedBy: Organizer Team Controller updateTeam should return 400 if name is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:294:34
     // 2. Handle Name Change (if provided)
     if (name !== undefined) {
       const trimmedNewName = name.trim();
-      if (trimmedNewName === "") {
-        return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
-      }
+      if (trimmedNewName === "") {}
 
       if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
killedBy: Organizer Team Controller updateTeam should return 400 if name is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:294:11
     // 2. Handle Name Change (if provided)
     if (name !== undefined) {
       const trimmedNewName = name.trim();
-      if (trimmedNewName === "") {
+      if (false) {
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
killedBy: Organizer Team Controller updateTeam should return 400 if name is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:298:11
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
 
-      if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
+      if (team.name.toLowerCase() === trimmedNewName.toLowerCase()) {
         const existing = await Team.findOne({ name: trimmedNewName })
                                   .collation({ locale: 'en', strength: 2 });
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original Name"

[Killed] MethodExpression
controllers/organizer_controllers/event.team.controller.js:298:39
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
 
-      if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
+      if (team.name.toLowerCase() !== trimmedNewName.toUpperCase()) {
         const existing = await Team.findOne({ name: trimmedNewName })
                                   .collation({ locale: 'en', strength: 2 });
killedBy: Organizer Team Controller updateTeam should not consider name change if same name with different case
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"name": "Original Name"}

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:301:13
       if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
         const existing = await Team.findOne({ name: trimmedNewName })
                                   .collation({ locale: 'en', strength: 2 });
-        if (existing) {
+        if (false) {
           return res.status(409).json({ message: "Team name already exists" });
         }
killedBy: Organizer Team Controller updateTeam should return 409 if name conflicts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:301:23
       if (team.name.toLowerCase() !== trimmedNewName.toLowerCase()) {
         const existing = await Team.findOne({ name: trimmedNewName })
                                   .collation({ locale: 'en', strength: 2 });
-        if (existing) {
-          return res.status(409).json({ message: "Team name already exists" });
-        }
+        if (existing) {}
         team.name = trimmedNewName;
         hasChanges = true;
killedBy: Organizer Team Controller updateTeam should return 409 if name conflicts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:305:22
           return res.status(409).json({ message: "Team name already exists" });
         }
         team.name = trimmedNewName;
-        hasChanges = true;
+        hasChanges = false;
       }
     }
killedBy: Organizer Team Controller updateTeam should handle mongo 11000 error specifically
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:310:9
     }
 
     // 3. Handle Description Change (if provided)
-    if (description !== undefined) {
+    if (true) {
       if (team.description !== description) {
         team.description = description;
killedBy: Organizer Team Controller updateTeam should handle no changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": undefined, "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Num

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:310:36
     }
 
     // 3. Handle Description Change (if provided)
-    if (description !== undefined) {
-      if (team.description !== description) {
-        team.description = description;
-        hasChanges = true;
-      }
-    }
+    if (description !== undefined) {}
 
     // 4. Handle Members to Remove (if provided)
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Desc"
Received: "Desc"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:311:11
 
     // 3. Handle Description Change (if provided)
     if (description !== undefined) {
-      if (team.description !== description) {
+      if (false) {
         team.description = description;
         hasChanges = true;
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Desc"
Received: "Desc"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:311:11
 
     // 3. Handle Description Change (if provided)
     if (description !== undefined) {
-      if (team.description !== description) {
+      if (true) {
         team.description = description;
         hasChanges = true;
killedBy: Organizer Team Controller updateTeam should allow same description without marking as change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:313:22
     if (description !== undefined) {
       if (team.description !== description) {
         team.description = description;
-        hasChanges = true;
+        hasChanges = false;
       }
     }
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:318:9
     }
 
     // 4. Handle Members to Remove (if provided)
-    if (membersToRemove && Array.isArray(membersToRemove)) {
+    if (true) {
       if (membersToRemove.includes(leaderId.toString())) {
         return res.status(400).json({ message: "The team leader cannot be removed" });
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:318:60
     }
 
     // 4. Handle Members to Remove (if provided)
-    if (membersToRemove && Array.isArray(membersToRemove)) {
-      if (membersToRemove.includes(leaderId.toString())) {
-        return res.status(400).json({ message: "The team leader cannot be removed" });
-      }
-
-      const originalCount = team.members.length;
-      // Filter out members whose 'user' ID is in the membersToRemove array
-      team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
-
-      if (team.members.length < originalCount) {
-        hasChanges = true;
-        // FUTURE_TODO: Send "you were removed" notification
-      }
-    }
+    if (membersToRemove && Array.isArray(membersToRemove)) {}
 
     // 5. Handle Member Roles to Change (if provided)
killedBy: Organizer Team Controller updateTeam should remove members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:319:11
 
     // 4. Handle Members to Remove (if provided)
     if (membersToRemove && Array.isArray(membersToRemove)) {
-      if (membersToRemove.includes(leaderId.toString())) {
+      if (true) {
         return res.status(400).json({ message: "The team leader cannot be removed" });
       }
killedBy: Organizer Team Controller updateTeam should remove members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:319:11
 
     // 4. Handle Members to Remove (if provided)
     if (membersToRemove && Array.isArray(membersToRemove)) {
-      if (membersToRemove.includes(leaderId.toString())) {
+      if (false) {
         return res.status(400).json({ message: "The team leader cannot be removed" });
       }
killedBy: Organizer Team Controller updateTeam should return 400 if removing leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:320:48
     // 4. Handle Members to Remove (if provided)
     if (membersToRemove && Array.isArray(membersToRemove)) {
       if (membersToRemove.includes(leaderId.toString())) {
-        return res.status(400).json({ message: "The team leader cannot be removed" });
+        return res.status(400).json({ message: "" });
       }
 

[Killed] MethodExpression
controllers/organizer_controllers/event.team.controller.js:325:22
 
       const originalCount = team.members.length;
       // Filter out members whose 'user' ID is in the membersToRemove array
-      team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
+      team.members = team.members;
 
       if (team.members.length < originalCount) {
killedBy: Organizer Team Controller updateTeam should remove members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:325:52
 
       const originalCount = team.members.length;
       // Filter out members whose 'user' ID is in the membersToRemove array
-      team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
+      team.members = team.members.filter(member => membersToRemove.includes(member.user.toString()));
 
       if (team.members.length < originalCount) {
killedBy: Organizer Team Controller updateTeam should remove members
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "u3"
Received: "u2"

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:327:11
       // Filter out members whose 'user' ID is in the membersToRemove array
       team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
 
-      if (team.members.length < originalCount) {
+      if (team.members.length <= originalCount) {
         hasChanges = true;
         // FUTURE_TODO: Send "you were removed" notification
killedBy: Organizer Team Controller updateTeam should handle removing non-existent member gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:327:11
       // Filter out members whose 'user' ID is in the membersToRemove array
       team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
 
-      if (team.members.length < originalCount) {
+      if (team.members.length >= originalCount) {
         hasChanges = true;
         // FUTURE_TODO: Send "you were removed" notification
killedBy: Organizer Team Controller updateTeam should handle removing non-existent member gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number

[Survived] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:328:22
       team.members = team.members.filter(member => !membersToRemove.includes(member.user.toString()));
 
       if (team.members.length < originalCount) {
-        hasChanges = true;
+        hasChanges = false;
         // FUTURE_TODO: Send "you were removed" notification
       }

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:334:9
     }
 
     // 5. Handle Member Roles to Change (if provided)
-    if (membersToUpdate && Array.isArray(membersToUpdate)) {
+    if (false) {
       for (const update of membersToUpdate) {
         const { memberId, newRole } = update;
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:334:9
     }
 
     // 5. Handle Member Roles to Change (if provided)
-    if (membersToUpdate && Array.isArray(membersToUpdate)) {
+    if (true) {
       for (const update of membersToUpdate) {
         const { memberId, newRole } = update;
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:335:45
 
     // 5. Handle Member Roles to Change (if provided)
     if (membersToUpdate && Array.isArray(membersToUpdate)) {
-      for (const update of membersToUpdate) {
-        const { memberId, newRole } = update;
-
-        if (!memberId || !newRole) {
-          return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
-        }
-        if (!validRoles.includes(newRole)) {
-          return res.status(400).json({ message: `Invalid role: ${newRole}` });
-        }
-        if (memberId === leaderId.toString()) {
-          return res.status(400).json({ message: "Cannot change the leader's role" });
-        }
-
-        const member = team.members.find(m => m.user.toString() === memberId);
-        if (!member) {
-          return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
-        }
-
-        if (member.role !== newRole) {
-          member.role = newRole;
-          hasChanges = true;
-          // FUTURE_TODO: Send "your role was changed" notification
-        }
-      }
+      for (const update of membersToUpdate) {}
     }
     
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:338:13
       for (const update of membersToUpdate) {
         const { memberId, newRole } = update;
 
-        if (!memberId || !newRole) {
+        if (memberId || !newRole) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:338:13
       for (const update of membersToUpdate) {
         const { memberId, newRole } = update;
 
-        if (!memberId || !newRole) {
+        if (true) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"
