[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:341:44
         if (!memberId || !newRole) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
         }
-        if (!validRoles.includes(newRole)) {
-          return res.status(400).json({ message: `Invalid role: ${newRole}` });
-        }
+        if (!validRoles.includes(newRole)) {}
         if (memberId === leaderId.toString()) {
           return res.status(400).json({ message: "Cannot change the leader's role" });
killedBy: Organizer Team Controller updateTeam should validate roles during update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:341:13
         if (!memberId || !newRole) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
         }
-        if (!validRoles.includes(newRole)) {
+        if (true) {
           return res.status(400).json({ message: `Invalid role: ${newRole}` });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:342:39
           return res.status(400).json({ message: "Invalid payload for membersToUpdate" });
         }
         if (!validRoles.includes(newRole)) {
-          return res.status(400).json({ message: `Invalid role: ${newRole}` });
+          return res.status(400).json({});
         }
         if (memberId === leaderId.toString()) {

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:344:13
         if (!validRoles.includes(newRole)) {
           return res.status(400).json({ message: `Invalid role: ${newRole}` });
         }
-        if (memberId === leaderId.toString()) {
+        if (true) {
           return res.status(400).json({ message: "Cannot change the leader's role" });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:344:47
         if (!validRoles.includes(newRole)) {
           return res.status(400).json({ message: `Invalid role: ${newRole}` });
         }
-        if (memberId === leaderId.toString()) {
-          return res.status(400).json({ message: "Cannot change the leader's role" });
-        }
+        if (memberId === leaderId.toString()) {}
 
         const member = team.members.find(m => m.user.toString() === memberId);
killedBy: Organizer Team Controller updateTeam should return 400 if updating leader role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:345:50
           return res.status(400).json({ message: `Invalid role: ${newRole}` });
         }
         if (memberId === leaderId.toString()) {
-          return res.status(400).json({ message: "Cannot change the leader's role" });
+          return res.status(400).json({ message: "" });
         }
 

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:348:47
           return res.status(400).json({ message: "Cannot change the leader's role" });
         }
 
-        const member = team.members.find(m => m.user.toString() === memberId);
+        const member = team.members.find(m => m.user.toString() !== memberId);
         if (!member) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:348:47
           return res.status(400).json({ message: "Cannot change the leader's role" });
         }
 
-        const member = team.members.find(m => m.user.toString() === memberId);
+        const member = team.members.find(m => false);
         if (!member) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:349:13
         }
 
         const member = team.members.find(m => m.user.toString() === memberId);
-        if (!member) {
+        if (true) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:349:13
         }
 
         const member = team.members.find(m => m.user.toString() === memberId);
-        if (!member) {
+        if (member) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:350:50
 
         const member = team.members.find(m => m.user.toString() === memberId);
         if (!member) {
-          return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
+          return res.status(404).json({ message: `` });
         }
 

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:353:13
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
 
-        if (member.role !== newRole) {
+        if (true) {
           member.role = newRole;
           hasChanges = true;
killedBy: Organizer Team Controller updateTeam should not mark as changed if member role is same as new role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "Team details updated successfully", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:353:38
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
 
-        if (member.role !== newRole) {
-          member.role = newRole;
-          hasChanges = true;
-          // FUTURE_TODO: Send "your role was changed" notification
-        }
+        if (member.role !== newRole) {}
       }
     }
killedBy: Organizer Team Controller updateTeam should update member roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "co-organizer"
Received: "volunteer"

[Survived] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:355:24
 
         if (member.role !== newRole) {
           member.role = newRole;
-          hasChanges = true;
+          hasChanges = false;
           // FUTURE_TODO: Send "your role was changed" notification
         }

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:361:9
       }
     }
     
-    if (membersToAdd && Array.isArray(membersToAdd)) {
+    if (true) {
       for (const member of membersToAdd) {
         // Your modal logic uses 'username' and 'role'
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:361:9
       }
     }
     
-    if (membersToAdd && Array.isArray(membersToAdd)) {
+    if (false) {
       for (const member of membersToAdd) {
         // Your modal logic uses 'username' and 'role'
killedBy: Organizer Team Controller updateTeam should add new members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:366:22
         // Your modal logic uses 'username' and 'role'
         const { userId, role } = member;
         
-        if (!userId) {
-           return res.status(400).json({ message: "Invalid payload for membersToAdd, username is required." });
-        }
+        if (!userId) {}
 
         const userToInvite = await User.findOne({ _id: userId });
killedBy: Organizer Team Controller updateTeam should return 400 if membersToAdd payload invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:366:13
         // Your modal logic uses 'username' and 'role'
         const { userId, role } = member;
         
-        if (!userId) {
+        if (false) {
            return res.status(400).json({ message: "Invalid payload for membersToAdd, username is required." });
         }
killedBy: Organizer Team Controller updateTeam should return 400 if membersToAdd payload invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:367:40
         const { userId, role } = member;
         
         if (!userId) {
-           return res.status(400).json({ message: "Invalid payload for membersToAdd, username is required." });
+           return res.status(400).json({});
         }
 

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:371:13
         }
 
         const userToInvite = await User.findOne({ _id: userId });
-        if (!userToInvite) {
+        if (userToInvite) {
           return res.status(404).json({ message: `User with username '${userId}' not found.` });
         }
killedBy: Organizer Team Controller updateTeam should add new members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:371:13
         }
 
         const userToInvite = await User.findOne({ _id: userId });
-        if (!userToInvite) {
+        if (false) {
           return res.status(404).json({ message: `User with username '${userId}' not found.` });
         }
killedBy: Organizer Team Controller updateTeam should fail adding member if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:372:50
 
         const userToInvite = await User.findOne({ _id: userId });
         if (!userToInvite) {
-          return res.status(404).json({ message: `User with username '${userId}' not found.` });
+          return res.status(404).json({ message: `` });
         }
 

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:372:39
 
         const userToInvite = await User.findOne({ _id: userId });
         if (!userToInvite) {
-          return res.status(404).json({ message: `User with username '${userId}' not found.` });
+          return res.status(404).json({});
         }
 

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:375:13
           return res.status(404).json({ message: `User with username '${userId}' not found.` });
         }
 
-        if (userToInvite._id.toString() === leaderId.toString()) {
+        if (userToInvite._id.toString() !== leaderId.toString()) {
            return res.status(400).json({ message: "You cannot add the team leader as a member." });
         }
killedBy: Organizer Team Controller updateTeam should add new members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:375:13
           return res.status(404).json({ message: `User with username '${userId}' not found.` });
         }
 
-        if (userToInvite._id.toString() === leaderId.toString()) {
+        if (true) {
            return res.status(400).json({ message: "You cannot add the team leader as a member." });
         }
killedBy: Organizer Team Controller updateTeam should add new members
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}]

[Killed] MethodExpression
controllers/organizer_controllers/event.team.controller.js:379:33
            return res.status(400).json({ message: "You cannot add the team leader as a member." });
         }
 
-        const isAlreadyMember = team.members.some(m => m.user.toString() === userToInvite._id.toString());
+        const isAlreadyMember = team.members.every(m => m.user.toString() === userToInvite._id.toString());
         if (isAlreadyMember) {
           // This check is important!
killedBy: Organizer Team Controller updateTeam should fail adding member if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ArrowFunction
controllers/organizer_controllers/event.team.controller.js:379:51
            return res.status(400).json({ message: "You cannot add the team leader as a member." });
         }
 
-        const isAlreadyMember = team.members.some(m => m.user.toString() === userToInvite._id.toString());
+        const isAlreadyMember = team.members.some(() => undefined);
         if (isAlreadyMember) {
           // This check is important!
killedBy: Organizer Team Controller updateTeam should fail adding member if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:380:30
         }
 
         const isAlreadyMember = team.members.some(m => m.user.toString() === userToInvite._id.toString());
-        if (isAlreadyMember) {
-          // This check is important!
-          return res.status(400).json({ message: `User '${userId}' is already a member.` });
-        }
+        if (isAlreadyMember) {}
 
         const existingInvitation = await InboxEntity.findOne({
killedBy: Organizer Team Controller updateTeam should fail adding member if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:380:13
         }
 
         const isAlreadyMember = team.members.some(m => m.user.toString() === userToInvite._id.toString());
-        if (isAlreadyMember) {
+        if (false) {
           // This check is important!
           return res.status(400).json({ message: `User '${userId}' is already a member.` });
killedBy: Organizer Team Controller updateTeam should fail adding member if already member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:388:19
         const existingInvitation = await InboxEntity.findOne({
           relatedTeam: teamId,
           to: userToInvite._id,
-          status: "Pending",
+          status: "",
           type: "team_invite"
         });

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:392:13
           type: "team_invite"
         });
         
-        if (existingInvitation) {
+        if (false) {
           return res.status(400).json({ message: `An invitation is already pending for '${userId}'.` });
         }
killedBy: Organizer Team Controller updateTeam should return 400 if invitation pending for added member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] ObjectLiteral
controllers/organizer_controllers/event.team.controller.js:393:39
         });
         
         if (existingInvitation) {
-          return res.status(400).json({ message: `An invitation is already pending for '${userId}'.` });
+          return res.status(400).json({});
         }
 

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:397:26
         }
 
         // All checks passed. Add to team and create invite.
-        const newRole = (role && validRoles.includes(role)) ? role : "volunteer";
+        const newRole = (true) ? role : "volunteer";
         
         // Add member to team with "Pending" status
killedBy: Organizer Team Controller updateTeam should use default volunteer role for added members without role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "volunteer"
Received: undefined

[Killed] LogicalOperator
controllers/organizer_controllers/event.team.controller.js:397:26
         }
 
         // All checks passed. Add to team and create invite.
-        const newRole = (role && validRoles.includes(role)) ? role : "volunteer";
+        const newRole = (role || validRoles.includes(role)) ? role : "volunteer";
         
         // Add member to team with "Pending" status
killedBy: Organizer Team Controller updateTeam should use default volunteer role for invalid role in membersToAdd
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "volunteer"
Received: "invalid-role"

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:400:76
         const newRole = (role && validRoles.includes(role)) ? role : "volunteer";
         
         // Add member to team with "Pending" status
-        team.members.push({ user: userToInvite._id, role: newRole, status: "Pending" });
+        team.members.push({ user: userToInvite._id, role: newRole, status: "" });
         
         // Create the invitation in the Inbox

[Survived] StringLiteral
controllers/organizer_controllers/event.team.controller.js:406:24
         await InboxEntity.create({
           type: "team_invite",
           title: `Invitation to join team: ${team.name}`,
-          description: `You have been invited to join ${team.name} as a ${newRole}.`,
+          description: ``,
           from: leaderId,
           to: userToInvite._id,

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:415:22
           role: newRole,
         });
 
-        hasChanges = true;
+        hasChanges = false;
       }
     }
killedBy: Organizer Team Controller updateTeam should return custom message when members are added
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Team details updated successfully and new invites sent"}

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/event.team.controller.js:420:9
     }
 
     // 7. Save and Respond
-    if (!hasChanges) {
+    if (hasChanges) {
       return res.status(200).json({ message: "No changes provided", team });
     }
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:420:9
     }
 
     // 7. Save and Respond
-    if (!hasChanges) {
+    if (true) {
       return res.status(200).json({ message: "No changes provided", team });
     }
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
controllers/organizer_controllers/event.team.controller.js:421:46
 
     // 7. Save and Respond
     if (!hasChanges) {
-      return res.status(200).json({ message: "No changes provided", team });
+      return res.status(200).json({ message: "", team });
     }
 
killedBy: Organizer Team Controller updateTeam should handle no changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"message": "", "team": {"_id": "t1", "description": "Desc", "leader": "user123", "members": [{"role": "volunteer", "user": "u2"}, {"role": "editor", "user": "u3"}], "name": "Original Name", "save": [Function mockConstructor]}}

Number of calls: 1

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:427:38
     await team.save();
     
     // Check if new members were added to customize the message
-    const message = (membersToAdd && membersToAdd.length > 0) 
+    const message = (membersToAdd && membersToAdd.length <= 0) 
       ? "Team details updated successfully and new invites sent"
       : "Team details updated successfully";
killedBy: Organizer Team Controller updateTeam should return custom message when members are added
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Team details updated successfully and new invites sent"}

Number of calls: 1

[Killed] LogicalOperator
controllers/organizer_controllers/event.team.controller.js:427:22
     await team.save();
     
     // Check if new members were added to customize the message
-    const message = (membersToAdd && membersToAdd.length > 0) 
+    const message = (membersToAdd || membersToAdd.length > 0) 
       ? "Team details updated successfully and new invites sent"
       : "Team details updated successfully";
killedBy: Organizer Team Controller updateTeam should update name and description
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/event.team.controller.js:433:17
 
     res.status(200).json({ message, team });
 
-  } catch (err) {
-    // Handle database uniqueness error
-    if (err.code === 11000) {
-      return res.status(409).json({ message: "Team name already exists" });
-    }
-    console.error(err);
-    res.status(500).json({ message: "Failed to update team details", error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: Organizer Team Controller updateTeam should handle mongo 11000 error specifically
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] EqualityOperator
controllers/organizer_controllers/event.team.controller.js:435:9
 
   } catch (err) {
     // Handle database uniqueness error
-    if (err.code === 11000) {
+    if (err.code !== 11000) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Organizer Team Controller updateTeam should handle mongo 11000 error specifically
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/event.team.controller.js:435:9
 
   } catch (err) {
     // Handle database uniqueness error
-    if (err.code === 11000) {
+    if (true) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Organizer Team Controller updateTeam should handle generic errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 409

Number of calls: 1
