[Killed] ConditionalExpression
controllers/inbox.controller.js:10:7
 import College from "../models/college.model.js";
 
 async function broadcastRecipients(keyword) {
-  if (keyword === "to_allusers") {
+  if (false) {
     const users = await User.find().select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_allusers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: called with 0 arguments

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:10:7
 import College from "../models/college.model.js";
 
 async function broadcastRecipients(keyword) {
-  if (keyword === "to_allusers") {
+  if (keyword !== "to_allusers") {
     const users = await User.find().select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_allusers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: called with 0 arguments

Number of calls: 0

[Killed] ArrowFunction
controllers/inbox.controller.js:12:22
 async function broadcastRecipients(keyword) {
   if (keyword === "to_allusers") {
     const users = await User.find().select("_id");
-    return users.map((u) => u._id);
+    return users.map(() => undefined);
   }
 
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_allusers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": ["user1", "user2"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "Broadcast", "to": [undefined, undefined], "type": "announcement"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:15:7
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_student") {
+  if (true) {
     const users = await User.find({ role: "student" }).select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "role": "organizer",
+   "role": "student",

[Killed] EqualityOperator
controllers/inbox.controller.js:15:7
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_student") {
+  if (keyword !== "to_all_student") {
     const users = await User.find({ role: "student" }).select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_student
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "student"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/inbox.controller.js:16:35
   }
 
   if (keyword === "to_all_student") {
-    const users = await User.find({ role: "student" }).select("_id");
+    const users = await User.find({}).select("_id");
     return users.map((u) => u._id);
   }
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_student
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "role": "student",
- }

[Survived] StringLiteral
controllers/inbox.controller.js:16:63
   }
 
   if (keyword === "to_all_student") {
-    const users = await User.find({ role: "student" }).select("_id");
+    const users = await User.find({ role: "student" }).select("");
     return users.map((u) => u._id);
   }

[Killed] ArrowFunction
controllers/inbox.controller.js:17:22
 
   if (keyword === "to_all_student") {
     const users = await User.find({ role: "student" }).select("_id");
-    return users.map((u) => u._id);
+    return users.map(() => undefined);
   }
 
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_student
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": ["student1", "student2"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "Students Only", "to": [undefined, undefined], "type": "announcement"}

Number of calls: 1

[Killed] EqualityOperator
controllers/inbox.controller.js:20:7
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_organizer") {
+  if (keyword !== "to_all_organizer") {
     const users = await User.find({ role: "organizer" }).select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "organizer"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:20:7
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_organizer") {
+  if (true) {
     const users = await User.find({ role: "organizer" }).select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "role": "sponsor",
+   "role": "organizer",

[Killed] StringLiteral
controllers/inbox.controller.js:21:43
   }
 
   if (keyword === "to_all_organizer") {
-    const users = await User.find({ role: "organizer" }).select("_id");
+    const users = await User.find({ role: "" }).select("_id");
     return users.map((u) => u._id);
   }
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "role": "organizer",
+   "role": "",

[Killed] ArrowFunction
controllers/inbox.controller.js:22:22
 
   if (keyword === "to_all_organizer") {
     const users = await User.find({ role: "organizer" }).select("_id");
-    return users.map((u) => u._id);
+    return users.map(() => undefined);
   }
 
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": ["org1"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "Organizers Only", "to": [undefined], "type": "announcement"}

Number of calls: 1

[Killed] BlockStatement
controllers/inbox.controller.js:25:37
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_sponsor") {
-    const users = await User.find({ role: "sponsor" }).select("_id");
-    return users.map((u) => u._id);
-  }
+  if (keyword === "to_all_sponsor") {}
 
   if (keyword.startsWith("to_college:")) {
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "sponsor"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:25:7
     return users.map((u) => u._id);
   }
 
-  if (keyword === "to_all_sponsor") {
+  if (false) {
     const users = await User.find({ role: "sponsor" }).select("_id");
     return users.map((u) => u._id);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "sponsor"}

Number of calls: 0

[Survived] StringLiteral
controllers/inbox.controller.js:26:63
   }
 
   if (keyword === "to_all_sponsor") {
-    const users = await User.find({ role: "sponsor" }).select("_id");
+    const users = await User.find({ role: "sponsor" }).select("");
     return users.map((u) => u._id);
   }

[Killed] ArrowFunction
controllers/inbox.controller.js:27:22
 
   if (keyword === "to_all_sponsor") {
     const users = await User.find({ role: "sponsor" }).select("_id");
-    return users.map((u) => u._id);
+    return users.map(() => undefined);
   }
 
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_sponsor
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": ["sponsor1"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "Sponsors Only", "to": [undefined], "type": "announcement"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:30:7
     return users.map((u) => u._id);
   }
 
-  if (keyword.startsWith("to_college:")) {
+  if (false) {
     const collegeName = keyword.split(":")[1].trim();
     const college = await College.findOne({ name: collegeName });
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "MIT"}

Number of calls: 0

[Killed] MethodExpression
controllers/inbox.controller.js:30:7
     return users.map((u) => u._id);
   }
 
-  if (keyword.startsWith("to_college:")) {
+  if (keyword.endsWith("to_college:")) {
     const collegeName = keyword.split(":")[1].trim();
     const college = await College.findOne({ name: collegeName });
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "MIT"}

Number of calls: 0

[Survived] MethodExpression
controllers/inbox.controller.js:31:25
   }
 
   if (keyword.startsWith("to_college:")) {
-    const collegeName = keyword.split(":")[1].trim();
+    const collegeName = keyword.split(":")[1];
     const college = await College.findOne({ name: collegeName });
 

[Killed] BooleanLiteral
controllers/inbox.controller.js:34:9
     const collegeName = keyword.split(":")[1].trim();
     const college = await College.findOne({ name: collegeName });
 
-    if (!college) throw new Error(`College '${collegeName}' not found`);
+    if (college) throw new Error(`College '${collegeName}' not found`);
 
     const users = await User.find({ college: college._id }).select("_id");
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"college": "college123"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:34:9
     const collegeName = keyword.split(":")[1].trim();
     const college = await College.findOne({ name: collegeName });
 
-    if (!college) throw new Error(`College '${collegeName}' not found`);
+    if (true) throw new Error(`College '${collegeName}' not found`);
 
     const users = await User.find({ college: college._id }).select("_id");
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"college": "college123"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/inbox.controller.js:36:35
 
     if (!college) throw new Error(`College '${collegeName}' not found`);
 
-    const users = await User.find({ college: college._id }).select("_id");
+    const users = await User.find({}).select("_id");
     return users.map((u) => u._id);
   }
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "college": "college123",
- }

[Killed] ArrowFunction
controllers/inbox.controller.js:37:22
     if (!college) throw new Error(`College '${collegeName}' not found`);
 
     const users = await User.find({ college: college._id }).select("_id");
-    return users.map((u) => u._id);
+    return users.map(() => undefined);
   }
 
killedBy: Inbox Controller createDraft should handle broadcast keyword to_college for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": ["student1", "student2"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "College Announcement", "to": [undefined, undefined], "type": "announcement"}

Number of calls: 1

[Killed] OptionalChaining
controllers/inbox.controller.js:46:22
 export const createDraft = async (req, res) => {
   try {
     const userId = req.user?.id;
-    const userRole = req.user?.role;
+    const userRole = req.user.role;
     const {
       type,
killedBy: Inbox Controller createDraft should handle undefined req.user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": undefined}

Number of calls: 0

[Killed] BlockStatement
controllers/inbox.controller.js:58:26
       relatedTeamModel,
     } = req.body;
 
-    if (!type || !title) {
-      return res.status(400).json({ error: "Type and title are required" });
-    }
+    if (!type || !title) {}
 
     let toUserIds = [];
killedBy: Inbox Controller createDraft should return 400 if type is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:58:18
       relatedTeamModel,
     } = req.body;
 
-    if (!type || !title) {
+    if (!type || title) {
       return res.status(400).json({ error: "Type and title are required" });
     }
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Test Description", "from": "user123", "relatedEvent": "event123", "relatedTeam": "team123", "relatedTeamModel": "Team", "status": "Draft", "title": "Test Title", "to": ["recipientId"], "type": "announcement"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/inbox.controller.js:59:35
     } = req.body;
 
     if (!type || !title) {
-      return res.status(400).json({ error: "Type and title are required" });
+      return res.status(400).json({});
     }
 
killedBy: Inbox Controller createDraft should return 400 if type is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Type and title are required",
- }

[Killed] ArrayDeclaration
controllers/inbox.controller.js:62:21
       return res.status(400).json({ error: "Type and title are required" });
     }
 
-    let toUserIds = [];
+    let toUserIds = ["Stryker was here"];
 
     if (to && Array.isArray(to) && to.length > 0) {
killedBy: Inbox Controller createDraft should handle empty to array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": []}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Draft", "title": "Test", "to": ["Stryker was here"], "type": "message"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:64:9
 
     let toUserIds = [];
 
-    if (to && Array.isArray(to) && to.length > 0) {
+    if (true) {
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
killedBy: Inbox Controller createDraft should handle undefined to field
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": []}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:64:9
 
     let toUserIds = [];
 
-    if (to && Array.isArray(to) && to.length > 0) {
+    if (true && to.length > 0) {
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
killedBy: Inbox Controller createDraft should handle undefined to field
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"to": []}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:65:23
     let toUserIds = [];
 
     if (to && Array.isArray(to) && to.length > 0) {
-      const keyword = typeof to[0] === 'string' ? to[0] : null;
+      const keyword = true ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Test Description", "from": "user123", "relatedEvent": "event123", "relatedTeam": "team123", "relatedTeamModel": "Team", "status": "Draft", "title": "Test Title", "to": ["recipientId"], "type": "announcement"}

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:65:23
     let toUserIds = [];
 
     if (to && Array.isArray(to) && to.length > 0) {
-      const keyword = typeof to[0] === 'string' ? to[0] : null;
+      const keyword = typeof to[0] !== 'string' ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Test Description", "from": "user123", "relatedEvent": "event123", "relatedTeam": "team123", "relatedTeamModel": "Team", "status": "Draft", "title": "Test Title", "to": ["recipientId"], "type": "announcement"}

Number of calls: 0

[Killed] LogicalOperator
controllers/inbox.controller.js:67:9
     if (to && Array.isArray(to) && to.length > 0) {
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
-        keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
-          keyword.startsWith("to_college:")
-        );
+        keyword || keyword === "to_allusers" || keyword === "to_all_student" || keyword === "to_all_organizer" || keyword === "to_all_sponsor" || keyword.startsWith("to_college:");
 
       if (userRole === "admin" && isBroadcastKeyword) {
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Test Description", "from": "user123", "relatedEvent": "event123", "relatedTeam": "team123", "relatedTeamModel": "Team", "status": "Draft", "title": "Test Title", "to": ["recipientId"], "type": "announcement"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:67:9
     if (to && Array.isArray(to) && to.length > 0) {
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
-        keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
-          keyword.startsWith("to_college:")
-        );
+        false;
 
       if (userRole === "admin" && isBroadcastKeyword) {
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_allusers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: called with 0 arguments

Number of calls: 0

[Timeout] EqualityOperator
controllers/inbox.controller.js:68:11
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
-          keyword === "to_allusers" ||
+          keyword !== "to_allusers" ||
           keyword === "to_all_student" ||
           keyword === "to_all_organizer" ||

[Timeout] LogicalOperator
controllers/inbox.controller.js:68:11
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
+          (keyword === "to_allusers" || keyword === "to_all_student" || keyword === "to_all_organizer") && keyword === "to_all_sponsor" ||
           keyword.startsWith("to_college:")
         );

[Timeout] ConditionalExpression
controllers/inbox.controller.js:69:11
       const isBroadcastKeyword =
         keyword && (
           keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
+          false ||
           keyword === "to_all_organizer" ||
           keyword === "to_all_sponsor" ||

[Timeout] EqualityOperator
controllers/inbox.controller.js:69:11
       const isBroadcastKeyword =
         keyword && (
           keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
+          keyword !== "to_all_student" ||
           keyword === "to_all_organizer" ||
           keyword === "to_all_sponsor" ||

[Killed] EqualityOperator
controllers/inbox.controller.js:70:11
         keyword && (
           keyword === "to_allusers" ||
           keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
+          keyword !== "to_all_organizer" ||
           keyword === "to_all_sponsor" ||
           keyword.startsWith("to_college:")
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
controllers/inbox.controller.js:70:11
         keyword && (
           keyword === "to_allusers" ||
           keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
+          false ||
           keyword === "to_all_sponsor" ||
           keyword.startsWith("to_college:")
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_all_organizer
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] EqualityOperator
controllers/inbox.controller.js:71:11
           keyword === "to_allusers" ||
           keyword === "to_all_student" ||
           keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
+          keyword !== "to_all_sponsor" ||
           keyword.startsWith("to_college:")
         );

[Timeout] ConditionalExpression
controllers/inbox.controller.js:71:11
           keyword === "to_allusers" ||
           keyword === "to_all_student" ||
           keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
+          false ||
           keyword.startsWith("to_college:")
         );

[Timeout] MethodExpression
controllers/inbox.controller.js:72:11
           keyword === "to_all_student" ||
           keyword === "to_all_organizer" ||
           keyword === "to_all_sponsor" ||
-          keyword.startsWith("to_college:")
+          keyword.endsWith("to_college:")
         );
 

[Killed] LogicalOperator
controllers/inbox.controller.js:75:11
           keyword.startsWith("to_college:")
         );
 
-      if (userRole === "admin" && isBroadcastKeyword) {
+      if (userRole === "admin" || isBroadcastKeyword) {
         toUserIds = await broadcastRecipients(keyword);
       } else {
killedBy: Inbox Controller createDraft should not allow non-admin to use broadcast keywords
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
controllers/inbox.controller.js:75:55
           keyword.startsWith("to_college:")
         );
 
-      if (userRole === "admin" && isBroadcastKeyword) {
-        toUserIds = await broadcastRecipients(keyword);
-      } else {
+      if (userRole === "admin" && isBroadcastKeyword) {} else {
         const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
         const users = await Promise.all(findUserPromises);
killedBy: Inbox Controller createDraft should handle broadcast keyword for admin - to_allusers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: called with 0 arguments

Number of calls: 0

[Killed] BlockStatement
controllers/inbox.controller.js:77:14
 
       if (userRole === "admin" && isBroadcastKeyword) {
         toUserIds = await broadcastRecipients(keyword);
-      } else {
-        const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
-        const users = await Promise.all(findUserPromises);
-        toUserIds = users.filter(Boolean).map(user => user._id);
-      }
+      } else {}
     }
 
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,8 @@
    "relatedEvent": "event123",
    "relatedTeam": "team123",

[Killed] ArrowFunction
controllers/inbox.controller.js:78:41
       if (userRole === "admin" && isBroadcastKeyword) {
         toUserIds = await broadcastRecipients(keyword);
       } else {
-        const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
+        const findUserPromises = to.map(() => undefined);
         const users = await Promise.all(findUserPromises);
         toUserIds = users.filter(Boolean).map(user => user._id);
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,8 @@
    "relatedEvent": "event123",
    "relatedTeam": "team123",

[Killed] MethodExpression
controllers/inbox.controller.js:80:21
       } else {
         const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
         const users = await Promise.all(findUserPromises);
-        toUserIds = users.filter(Boolean).map(user => user._id);
+        toUserIds = users.map(user => user._id);
       }
     }
killedBy: Inbox Controller createDraft should handle non-broadcast string in to array for non-admin
statusReason: Error: expect(received).not.toHaveBeenCalled()

Matcher error: received value must be a mock or spy function

Received has type:  function
Received has value: [Function find]

[Killed] ArrowFunction
controllers/inbox.controller.js:80:47
       } else {
         const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
         const users = await Promise.all(findUserPromises);
-        toUserIds = users.filter(Boolean).map(user => user._id);
+        toUserIds = users.filter(Boolean).map(() => undefined);
       }
     }
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,9 +5,9 @@
    "relatedTeam": "team123",
    "relatedTeamModel": "Team",

[Killed] StringLiteral
controllers/inbox.controller.js:93:15
       relatedEvent,
       relatedTeam,
       relatedTeamModel,
-      status: "Draft",
+      status: "",
     });
 
killedBy: Inbox Controller createDraft should create a draft successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "description": "Test Description",
    "from": "user123",

[Killed] BlockStatement
controllers/inbox.controller.js:105:19
       message: "Draft created successfully",
       data: populatedDraft,
     });
-  } catch (error) {
-    console.error("createDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to create draft" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller createDraft should handle error when college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/inbox.controller.js:106:19
       data: populatedDraft,
     });
   } catch (error) {
-    console.error("createDraft error:", error);
+    console.error("", error);
     res.status(500).json({ success: false, error: "Failed to create draft" });
   }

[Killed] BooleanLiteral
controllers/inbox.controller.js:107:37
     });
   } catch (error) {
     console.error("createDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to create draft" });
+    res.status(500).json({ success: true, error: "Failed to create draft" });
   }
 };
killedBy: Inbox Controller createDraft should handle error when college not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to create draft",
-   "success": false,
