[Killed] BooleanLiteral
controllers/inbox.controller.js:128:9
     } = req.body;
 
     const draft = await InboxEntity.findById(draftId);
-    if (!draft)
+    if (draft)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123", ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"}, {"new": true, "runValidators": true}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:128:9
     } = req.body;
 
     const draft = await InboxEntity.findById(draftId);
-    if (!draft)
+    if (false)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
killedBy: Inbox Controller editDraft should return 404 if draft not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:129:46
 
     const draft = await InboxEntity.findById(draftId);
     if (!draft)
-      return res.status(404).json({ success: false, error: "Draft not found" });
+      return res.status(404).json({ success: true, error: "Draft not found" });
 
     if (draft.from.toString() !== userId)
killedBy: Inbox Controller editDraft should return 404 if draft not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Draft not found",
-   "success": false,

[Killed] ObjectLiteral
controllers/inbox.controller.js:129:35
 
     const draft = await InboxEntity.findById(draftId);
     if (!draft)
-      return res.status(404).json({ success: false, error: "Draft not found" });
+      return res.status(404).json({});
 
     if (draft.from.toString() !== userId)
killedBy: Inbox Controller editDraft should return 404 if draft not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Draft not found",
-   "success": false,

[Killed] ConditionalExpression
controllers/inbox.controller.js:131:9
     if (!draft)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
-    if (draft.from.toString() !== userId)
+    if (true)
       return res
         .status(403)
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123", ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"}, {"new": true, "runValidators": true}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:131:9
     if (!draft)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
-    if (draft.from.toString() !== userId)
+    if (false)
       return res
         .status(403)
killedBy: Inbox Controller editDraft should return 403 if user is not the owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:134:26
     if (draft.from.toString() !== userId)
       return res
         .status(403)
-        .json({ success: false, error: "Unauthorized to edit this draft" });
+        .json({ success: true, error: "Unauthorized to edit this draft" });
 
     if (draft.status !== "Draft")
killedBy: Inbox Controller editDraft should return 403 if user is not the owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Unauthorized to edit this draft",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:134:40
     if (draft.from.toString() !== userId)
       return res
         .status(403)
-        .json({ success: false, error: "Unauthorized to edit this draft" });
+        .json({ success: false, error: "" });
 
     if (draft.status !== "Draft")
killedBy: Inbox Controller editDraft should return 403 if user is not the owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Unauthorized to edit this draft",
+   "error": "",

[Killed] EqualityOperator
controllers/inbox.controller.js:136:9
         .status(403)
         .json({ success: false, error: "Unauthorized to edit this draft" });
 
-    if (draft.status !== "Draft")
+    if (draft.status === "Draft")
       return res
         .status(400)
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123", ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"}, {"new": true, "runValidators": true}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:136:9
         .status(403)
         .json({ success: false, error: "Unauthorized to edit this draft" });
 
-    if (draft.status !== "Draft")
+    if (false)
       return res
         .status(400)
killedBy: Inbox Controller editDraft should return 400 if draft status is not Draft
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:139:26
     if (draft.status !== "Draft")
       return res
         .status(400)
-        .json({ success: false, error: "Only drafts can be edited" });
+        .json({ success: true, error: "Only drafts can be edited" });
 
     let toUserIds = draft.to;
killedBy: Inbox Controller editDraft should return 400 if draft status is not Draft
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Only drafts can be edited",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:139:40
     if (draft.status !== "Draft")
       return res
         .status(400)
-        .json({ success: false, error: "Only drafts can be edited" });
+        .json({ success: false, error: "" });
 
     let toUserIds = draft.to;
killedBy: Inbox Controller editDraft should return 400 if draft status is not Draft
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Only drafts can be edited",
+   "error": "",

[Killed] BlockStatement
controllers/inbox.controller.js:143:51
 
     let toUserIds = draft.to;
 
-    if (to && Array.isArray(to) && to.length > 0) {
-      const keyword = typeof to[0] === 'string' ? to[0] : null;
-      const isBroadcastKeyword =
-        keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
-          keyword.startsWith("to_college:")
-        );
-
-      if (userRole === "admin" && isBroadcastKeyword) {
-        toUserIds = await broadcastRecipients(keyword);
-      } else {
-        // 'to' is an array of {email, role} objects
-        const findUserPromises = to.map(recipient =>
-          User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean()
-        );
-        const users = await Promise.all(findUserPromises);
-        toUserIds = users.filter(Boolean).map(user => user._id);
-        if (toUserIds.length !== to.length) {
-          console.warn("Some recipients were not found and were skipped during update.");
-        }
-      }
-    }
+    if (to && Array.isArray(to) && to.length > 0) {}
 
     const updatedDraft = await InboxEntity.findByIdAndUpdate(
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["oldRecipien

[Killed] ConditionalExpression
controllers/inbox.controller.js:143:9
 
     let toUserIds = draft.to;
 
-    if (to && Array.isArray(to) && to.length > 0) {
+    if (false) {
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["oldRecipien

[Killed] LogicalOperator
controllers/inbox.controller.js:147:11
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
+          keyword === "to_allusers" && keyword === "to_all_student" ||
           keyword === "to_all_organizer" ||
           keyword === "to_all_sponsor" ||
killedBy: Inbox Controller editDraft should handle broadcast keyword for admin in edit
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
controllers/inbox.controller.js:147:11
       const keyword = typeof to[0] === 'string' ? to[0] : null;
       const isBroadcastKeyword =
         keyword && (
-          keyword === "to_allusers" ||
-          keyword === "to_all_student" ||
-          keyword === "to_all_organizer" ||
-          keyword === "to_all_sponsor" ||
-          keyword.startsWith("to_college:")
+          (keyword === "to_allusers" || keyword === "to_all_student" || keyword === "to_all_organizer" || keyword === "to_all_sponsor") && keyword.startsWith("to_college:")
         );
 
killedBy: Inbox Controller editDraft should handle broadcast keyword for admin in edit
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
controllers/inbox.controller.js:154:11
           keyword.startsWith("to_college:")
         );
 
-      if (userRole === "admin" && isBroadcastKeyword) {
+      if (true) {
         toUserIds = await broadcastRecipients(keyword);
       } else {
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123", ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"}, {"new": true, "runValidators": true}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:154:11
           keyword.startsWith("to_college:")
         );
 
-      if (userRole === "admin" && isBroadcastKeyword) {
+      if (false) {
         toUserIds = await broadcastRecipients(keyword);
       } else {
killedBy: Inbox Controller editDraft should handle broadcast keyword for admin in edit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"to": ["user1", "user2"]},
+ {"description": undefined, "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Test", "to": ["newRecipient"], "type": "message"},

[Killed] BlockStatement
controllers/inbox.controller.js:156:14
 
       if (userRole === "admin" && isBroadcastKeyword) {
         toUserIds = await broadcastRecipients(keyword);
-      } else {
-        // 'to' is an array of {email, role} objects
-        const findUserPromises = to.map(recipient =>
-          User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean()
-        );
-        const users = await Promise.all(findUserPromises);
-        toUserIds = users.filter(Boolean).map(user => user._id);
-        if (toUserIds.length !== to.length) {
-          console.warn("Some recipients were not found and were skipped during update.");
-        }
-      }
+      } else {}
     }
 
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["oldRecipien

[Killed] ArrowFunction
controllers/inbox.controller.js:158:41
         toUserIds = await broadcastRecipients(keyword);
       } else {
         // 'to' is an array of {email, role} objects
-        const findUserPromises = to.map(recipient =>
-          User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean()
+        const findUserPromises = to.map(() => undefined
         );
         const users = await Promise.all(findUserPromises);
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": [], "type": "

[Survived] StringLiteral
controllers/inbox.controller.js:159:81
       } else {
         // 'to' is an array of {email, role} objects
         const findUserPromises = to.map(recipient =>
-          User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean()
+          User.findOne({ email: recipient.email, role: recipient.role }).select("").lean()
         );
         const users = await Promise.all(findUserPromises);

[Survived] BlockStatement
controllers/inbox.controller.js:163:45
         );
         const users = await Promise.all(findUserPromises);
         toUserIds = users.filter(Boolean).map(user => user._id);
-        if (toUserIds.length !== to.length) {
-          console.warn("Some recipients were not found and were skipped during update.");
-        }
+        if (toUserIds.length !== to.length) {}
       }
     }

[Survived] ConditionalExpression
controllers/inbox.controller.js:163:13
         );
         const users = await Promise.all(findUserPromises);
         toUserIds = users.filter(Boolean).map(user => user._id);
-        if (toUserIds.length !== to.length) {
+        if (false) {
           console.warn("Some recipients were not found and were skipped during update.");
         }

[Survived] StringLiteral
controllers/inbox.controller.js:164:24
         const users = await Promise.all(findUserPromises);
         toUserIds = users.filter(Boolean).map(user => user._id);
         if (toUserIds.length !== to.length) {
-          console.warn("Some recipients were not found and were skipped during update.");
+          console.warn("");
         }
       }

[Killed] ObjectLiteral
controllers/inbox.controller.js:171:7
 
     const updatedDraft = await InboxEntity.findByIdAndUpdate(
       draftId,
-      {
-        type: type || draft.type,
-        title: title || draft.title,
-        description: description || draft.description,
-        to: toUserIds,
-        relatedEvent: relatedEvent || draft.relatedEvent,
-        relatedTeam: relatedTeam || draft.relatedTeam,
-        relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
-      },
+      {},
       { new: true, runValidators: true }
     ).populate("from", "email profile.name")
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {},

[Killed] ConditionalExpression
controllers/inbox.controller.js:172:15
     const updatedDraft = await InboxEntity.findByIdAndUpdate(
       draftId,
       {
-        type: type || draft.type,
+        type: true,
         title: title || draft.title,
         description: description || draft.description,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipien

[Killed] LogicalOperator
controllers/inbox.controller.js:172:15
     const updatedDraft = await InboxEntity.findByIdAndUpdate(
       draftId,
       {
-        type: type || draft.type,
+        type: type && draft.type,
         title: title || draft.title,
         description: description || draft.description,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipien

[Killed] LogicalOperator
controllers/inbox.controller.js:173:16
       draftId,
       {
         type: type || draft.type,
-        title: title || draft.title,
+        title: title && draft.title,
         description: description || draft.description,
         to: toUserIds,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Old Title", "to": ["newRecipient"],

[Killed] ConditionalExpression
controllers/inbox.controller.js:173:16
       draftId,
       {
         type: type || draft.type,
-        title: title || draft.title,
+        title: false,
         description: description || draft.description,
         to: toUserIds,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": false, "to": ["newRecipient"], "type

[Killed] ConditionalExpression
controllers/inbox.controller.js:174:22
       {
         type: type || draft.type,
         title: title || draft.title,
-        description: description || draft.description,
+        description: true,
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": true, "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipient"], "type": "ann

[Killed] LogicalOperator
controllers/inbox.controller.js:174:22
       {
         type: type || draft.type,
         title: title || draft.title,
-        description: description || draft.description,
+        description: description && draft.description,
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Updated Description", "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
+ {"description": undefined, "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipient"], "type":

[Killed] ConditionalExpression
controllers/inbox.controller.js:176:23
         title: title || draft.title,
         description: description || draft.description,
         to: toUserIds,
-        relatedEvent: relatedEvent || draft.relatedEvent,
+        relatedEvent: true,
         relatedTeam: relatedTeam || draft.relatedTeam,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
killedBy: Inbox Controller editDraft should keep existing values if not provided in update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Old Desc", "relatedEvent": "event123", "title": "New Title Only", "type": "announcement"},
+ {"description": "Old Desc", "relatedEvent": true, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "New Title Only", "to": ["recipient1"], "type": "announcem

[Killed] LogicalOperator
controllers/inbox.controller.js:176:23
         title: title || draft.title,
         description: description || draft.description,
         to: toUserIds,
-        relatedEvent: relatedEvent || draft.relatedEvent,
+        relatedEvent: relatedEvent && draft.relatedEvent,
         relatedTeam: relatedTeam || draft.relatedTeam,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
killedBy: Inbox Controller editDraft should keep existing values if not provided in update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
- ObjectContaining {"description": "Old Desc", "relatedEvent": "event123", "title": "New Title Only", "type": "announcement"},
+ {"description": "Old Desc", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "New Title Only", "to": ["recipient1"], "type": "anno

[Survived] ConditionalExpression
controllers/inbox.controller.js:177:22
         description: description || draft.description,
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
-        relatedTeam: relatedTeam || draft.relatedTeam,
+        relatedTeam: false,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
       },

[Survived] LogicalOperator
controllers/inbox.controller.js:177:22
         description: description || draft.description,
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
-        relatedTeam: relatedTeam || draft.relatedTeam,
+        relatedTeam: relatedTeam && draft.relatedTeam,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
       },

[Survived] ConditionalExpression
controllers/inbox.controller.js:178:27
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
         relatedTeam: relatedTeam || draft.relatedTeam,
-        relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
+        relatedTeamModel: false,
       },
       { new: true, runValidators: true }

[Survived] LogicalOperator
controllers/inbox.controller.js:178:27
         to: toUserIds,
         relatedEvent: relatedEvent || draft.relatedEvent,
         relatedTeam: relatedTeam || draft.relatedTeam,
-        relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
+        relatedTeamModel: relatedTeamModel && draft.relatedTeamModel,
       },
       { new: true, runValidators: true }

[Killed] BooleanLiteral
controllers/inbox.controller.js:180:35
         relatedTeam: relatedTeam || draft.relatedTeam,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
       },
-      { new: true, runValidators: true }
+      { new: true, runValidators: false }
     ).populate("from", "email profile.name")
       .populate("to", "email profile.name");
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
  {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
  Object {

[Killed] BooleanLiteral
controllers/inbox.controller.js:180:14
         relatedTeam: relatedTeam || draft.relatedTeam,
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
       },
-      { new: true, runValidators: true }
+      { new: false, runValidators: true }
     ).populate("from", "email profile.name")
       .populate("to", "email profile.name");
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
  {"description": "Updated Description", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "title": "Updated Title", "to": ["newRecipient"], "type": "announcement"},
  Object {

[Survived] StringLiteral
controllers/inbox.controller.js:181:16
         relatedTeamModel: relatedTeamModel || draft.relatedTeamModel,
       },
       { new: true, runValidators: true }
-    ).populate("from", "email profile.name")
+    ).populate("", "email profile.name")
       .populate("to", "email profile.name");
 

[Survived] StringLiteral
controllers/inbox.controller.js:182:17
       },
       { new: true, runValidators: true }
     ).populate("from", "email profile.name")
-      .populate("to", "email profile.name");
+      .populate("", "email profile.name");
 
     res.status(200).json({

[Survived] StringLiteral
controllers/inbox.controller.js:182:23
       },
       { new: true, runValidators: true }
     ).populate("from", "email profile.name")
-      .populate("to", "email profile.name");
+      .populate("to", "");
 
     res.status(200).json({

[Killed] ObjectLiteral
controllers/inbox.controller.js:184:26
     ).populate("from", "email profile.name")
       .populate("to", "email profile.name");
 
-    res.status(200).json({
-      success: true,
-      message: "Draft updated successfully",
-      data: updatedDraft,
-    });
+    res.status(200).json({});
   } catch (error) {
     console.error("editDraft error:", error);
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Object {
-     "_id": "draft123",

[Killed] StringLiteral
controllers/inbox.controller.js:186:16
 
     res.status(200).json({
       success: true,
-      message: "Draft updated successfully",
+      message: "",
       data: updatedDraft,
     });
killedBy: Inbox Controller editDraft should edit a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -10,8 +10,8 @@
      "to": Array [
        "newRecipient",

[Killed] BlockStatement
controllers/inbox.controller.js:189:19
       message: "Draft updated successfully",
       data: updatedDraft,
     });
-  } catch (error) {
-    console.error("editDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to update draft" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller editDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:191:37
     });
   } catch (error) {
     console.error("editDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to update draft" });
+    res.status(500).json({ success: true, error: "Failed to update draft" });
   }
 };
killedBy: Inbox Controller editDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to update draft",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:191:51
     });
   } catch (error) {
     console.error("editDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to update draft" });
+    res.status(500).json({ success: false, error: "" });
   }
 };
killedBy: Inbox Controller editDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to update draft",
+   "error": "",
