[Killed] BlockStatement
controllers/inbox.controller.js:195:48
   }
 };
 
-export const deleteDraft = async (req, res) => {
-  try {
-    const userId = req.user?.id;
-    const { draftId } = req.params;
-
-    const draft = await InboxEntity.findById(draftId);
-    if (!draft)
-      return res.status(404).json({ success: false, error: "Draft not found" });
-
-    if (draft.from.toString() !== userId)
-      return res.status(403).json({ success: false, error: "Unauthorized" });
-
-    await InboxEntity.findByIdAndDelete(draftId);
-
-    res
-      .status(200)
-      .json({ success: true, message: "Draft deleted successfully" });
-  } catch (error) {
-    console.error("deleteDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to delete draft" });
-  }
-};
+export const deleteDraft = async (req, res) => {};
 
 // Get List of Drafts
killedBy: Inbox Controller deleteDraft should delete a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123"

Number of calls: 0

[Killed] BlockStatement
controllers/inbox.controller.js:196:7
 };
 
 export const deleteDraft = async (req, res) => {
-  try {
-    const userId = req.user?.id;
-    const { draftId } = req.params;
-
-    const draft = await InboxEntity.findById(draftId);
-    if (!draft)
-      return res.status(404).json({ success: false, error: "Draft not found" });
-
-    if (draft.from.toString() !== userId)
-      return res.status(403).json({ success: false, error: "Unauthorized" });
-
-    await InboxEntity.findByIdAndDelete(draftId);
-
-    res
-      .status(200)
-      .json({ success: true, message: "Draft deleted successfully" });
-  } catch (error) {
+  try {} catch (error) {
     console.error("deleteDraft error:", error);
     res.status(500).json({ success: false, error: "Failed to delete draft" });
killedBy: Inbox Controller deleteDraft should delete a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123"

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:201:9
     const { draftId } = req.params;
 
     const draft = await InboxEntity.findById(draftId);
-    if (!draft)
+    if (true)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
killedBy: Inbox Controller deleteDraft should delete a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123"

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:204:9
     if (!draft)
       return res.status(404).json({ success: false, error: "Draft not found" });
 
-    if (draft.from.toString() !== userId)
+    if (draft.from.toString() === userId)
       return res.status(403).json({ success: false, error: "Unauthorized" });
 
killedBy: Inbox Controller deleteDraft should delete a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "draft123"

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:205:46
       return res.status(404).json({ success: false, error: "Draft not found" });
 
     if (draft.from.toString() !== userId)
-      return res.status(403).json({ success: false, error: "Unauthorized" });
+      return res.status(403).json({ success: true, error: "Unauthorized" });
 
     await InboxEntity.findByIdAndDelete(draftId);
killedBy: Inbox Controller deleteDraft should return 403 if user is not the owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Unauthorized",
-   "success": false,

[Killed] BooleanLiteral
controllers/inbox.controller.js:211:24
 
     res
       .status(200)
-      .json({ success: true, message: "Draft deleted successfully" });
+      .json({ success: false, message: "Draft deleted successfully" });
   } catch (error) {
     console.error("deleteDraft error:", error);
killedBy: Inbox Controller deleteDraft should delete a draft successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Draft deleted successfully",
-   "success": true,

[Killed] BlockStatement
controllers/inbox.controller.js:212:19
     res
       .status(200)
       .json({ success: true, message: "Draft deleted successfully" });
-  } catch (error) {
-    console.error("deleteDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to delete draft" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller deleteDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:214:37
       .json({ success: true, message: "Draft deleted successfully" });
   } catch (error) {
     console.error("deleteDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to delete draft" });
+    res.status(500).json({ success: true, error: "Failed to delete draft" });
   }
 };
killedBy: Inbox Controller deleteDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to delete draft",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:214:51
       .json({ success: true, message: "Draft deleted successfully" });
   } catch (error) {
     console.error("deleteDraft error:", error);
-    res.status(500).json({ success: false, error: "Failed to delete draft" });
+    res.status(500).json({ success: false, error: "" });
   }
 };
killedBy: Inbox Controller deleteDraft should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to delete draft",
+   "error": "",

[Killed] MethodExpression
controllers/inbox.controller.js:223:26
   try {
     const userId = req.user?.id;
 
-    const drafts = await InboxEntity.find({ from: userId, status: "Draft" })
-      .populate({
-        path: "from",
-        select: "email profile.name role",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate({
-        path: "to",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate("relatedEvent", "name description")
-      .populate({
-        path: "relatedTeam",
-        select: "name",
-      })
-      .sort({ createdAt: -1 });
+    const drafts = await InboxEntity.find({
+  from: userId,
+  status: "Draft"
+}).populate({
+  path: "from",
+  select: "email profile.name role",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate({
+  path: "to",
+  select: "email profile.name",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate("relatedEvent", "name description").populate({
+  path: "relatedTeam",
+  select: "name"
+});
 
     res.status(200).json({
killedBy: Inbox Controller getListOfDrafts should return list of drafts successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 2,
-   "data": Array [

[Survived] StringLiteral
controllers/inbox.controller.js:226:17
     const drafts = await InboxEntity.find({ from: userId, status: "Draft" })
       .populate({
         path: "from",
-        select: "email profile.name role",
+        select: "",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })

[NoCoverage] ConditionalExpression
controllers/inbox.controller.js:227:27
       .populate({
         path: "from",
         select: "email profile.name role",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: doc => false
       })
       .populate({

[NoCoverage] LogicalOperator
controllers/inbox.controller.js:227:27
       .populate({
         path: "from",
         select: "email profile.name role",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: doc => doc && {
+  profile: {
+    name: '[Deleted User]'
+  }
+}
       })
       .populate({

[Survived] StringLiteral
controllers/inbox.controller.js:231:17
       })
       .populate({
         path: "to",
-        select: "email profile.name",
+        select: "",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })

[Survived] ArrowFunction
controllers/inbox.controller.js:232:20
       .populate({
         path: "to",
         select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: () => undefined
       })
       .populate("relatedEvent", "name description")

[NoCoverage] ConditionalExpression
controllers/inbox.controller.js:232:27
       .populate({
         path: "to",
         select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: doc => true
       })
       .populate("relatedEvent", "name description")

[Survived] ObjectLiteral
controllers/inbox.controller.js:235:17
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
       .populate("relatedEvent", "name description")
-      .populate({
-        path: "relatedTeam",
-        select: "name",
-      })
+      .populate({})
       .sort({ createdAt: -1 });
 

[Survived] StringLiteral
controllers/inbox.controller.js:236:15
       })
       .populate("relatedEvent", "name description")
       .populate({
-        path: "relatedTeam",
+        path: "",
         select: "name",
       })

[Survived] StringLiteral
controllers/inbox.controller.js:237:17
       .populate("relatedEvent", "name description")
       .populate({
         path: "relatedTeam",
-        select: "name",
+        select: "",
       })
       .sort({ createdAt: -1 });

[Survived] UnaryOperator
controllers/inbox.controller.js:239:26
         path: "relatedTeam",
         select: "name",
       })
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
 
     res.status(200).json({

[Survived] ObjectLiteral
controllers/inbox.controller.js:239:13
         path: "relatedTeam",
         select: "name",
       })
-      .sort({ createdAt: -1 });
+      .sort({});
 
     res.status(200).json({

[Killed] ObjectLiteral
controllers/inbox.controller.js:241:26
       })
       .sort({ createdAt: -1 });
 
-    res.status(200).json({
-      success: true,
-      count: drafts.length,
-      data: drafts,
-    });
+    res.status(200).json({});
   } catch (error) {
     console.error("getListOfDrafts error:", error);
killedBy: Inbox Controller getListOfDrafts should return list of drafts successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "count": 2,
-   "data": Array [

[Killed] BlockStatement
controllers/inbox.controller.js:246:19
       count: drafts.length,
       data: drafts,
     });
-  } catch (error) {
-    console.error("getListOfDrafts error:", error);
-    res.status(500).json({ success: false, error: "Failed to fetch drafts" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller getListOfDrafts should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:248:37
     });
   } catch (error) {
     console.error("getListOfDrafts error:", error);
-    res.status(500).json({ success: false, error: "Failed to fetch drafts" });
+    res.status(500).json({ success: true, error: "Failed to fetch drafts" });
   }
 };
killedBy: Inbox Controller getListOfDrafts should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to fetch drafts",
-   "success": false,

[Killed] ObjectLiteral
controllers/inbox.controller.js:248:26
     });
   } catch (error) {
     console.error("getListOfDrafts error:", error);
-    res.status(500).json({ success: false, error: "Failed to fetch drafts" });
+    res.status(500).json({});
   }
 };
killedBy: Inbox Controller getListOfDrafts should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Failed to fetch drafts",
-   "success": false,

[Killed] BooleanLiteral
controllers/inbox.controller.js:262:26
     if (!draft)
       return res
         .status(404)
-        .json({ success: false, error: "Message not found" });
+        .json({ success: true, error: "Message not found" });
 
     if (draft.from.toString() !== userId)
killedBy: Inbox Controller sendMessage should return 404 if message not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Message not found",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:265:60
         .json({ success: false, error: "Message not found" });
 
     if (draft.from.toString() !== userId)
-      return res.status(403).json({ success: false, error: "Unauthorized" });
+      return res.status(403).json({ success: false, error: "" });
 
     // The latest 'to' list is sent in the body from the frontend.
killedBy: Inbox Controller sendMessage should return 403 if user is not the owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Unauthorized",
+   "error": "",

[Killed] ConditionalExpression
controllers/inbox.controller.js:269:16
 
     // The latest 'to' list is sent in the body from the frontend.
     const { to } = req.body;
-    if (!to || to.length === 0)
+    if (!to || false)
       return res
         .status(400)
killedBy: Inbox Controller sendMessage should return 400 if recipients are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] LogicalOperator
controllers/inbox.controller.js:269:9
 
     // The latest 'to' list is sent in the body from the frontend.
     const { to } = req.body;
-    if (!to || to.length === 0)
+    if (!to && to.length === 0)
       return res
         .status(400)
killedBy: Inbox Controller sendMessage should return 400 if recipients are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:272:26
     if (!to || to.length === 0)
       return res
         .status(400)
-        .json({ success: false, error: "Recipients are required" });
+        .json({ success: true, error: "Recipients are required" });
 
     const sentMessage = await InboxEntity.findByIdAndUpdate(
killedBy: Inbox Controller sendMessage should return 400 if recipients are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Recipients are required",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:276:17
 
     const sentMessage = await InboxEntity.findByIdAndUpdate(
       draftId,
-      { status: "Sent", to: draft.to }, // Keep existing to, or update if needed, but main check is on body
+      { status: "", to: draft.to }, // Keep existing to, or update if needed, but main check is on body
       { new: true }
     )
killedBy: Inbox Controller sendMessage should send a draft message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
  Object {
-   "status": "Sent",

[Killed] BooleanLiteral
controllers/inbox.controller.js:277:14
     const sentMessage = await InboxEntity.findByIdAndUpdate(
       draftId,
       { status: "Sent", to: draft.to }, // Keep existing to, or update if needed, but main check is on body
-      { new: true }
+      { new: false }
     )
       .populate("from", "email profile.name")
killedBy: Inbox Controller sendMessage should send a draft message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
  {"status": "Sent", "to": ["recipient1", "recipient2"]},
  Object {

[Killed] ObjectLiteral
controllers/inbox.controller.js:277:7
     const sentMessage = await InboxEntity.findByIdAndUpdate(
       draftId,
       { status: "Sent", to: draft.to }, // Keep existing to, or update if needed, but main check is on body
-      { new: true }
+      {}
     )
       .populate("from", "email profile.name")
killedBy: Inbox Controller sendMessage should send a draft message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "draft123",
  {"status": "Sent", "to": ["recipient1", "recipient2"]},
- Object {

[Survived] StringLiteral
controllers/inbox.controller.js:280:17
       { new: true }
     )
       .populate("from", "email profile.name")
-      .populate("to", "email profile.name")
+      .populate("", "email profile.name")
       .populate("relatedEvent", "name description")
       .populate({ path: "relatedTeam", select: "name" });

[Survived] ObjectLiteral
controllers/inbox.controller.js:282:17
       .populate("from", "email profile.name")
       .populate("to", "email profile.name")
       .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" });
+      .populate({});
 
     res.status(200).json({

[Killed] BlockStatement
controllers/inbox.controller.js:289:19
       message: "Message sent successfully",
       data: sentMessage,
     });
-  } catch (error) {
-    console.error("sendMessage error:", error);
-    res.status(500).json({ success: false, error: "Failed to send message" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller sendMessage should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/inbox.controller.js:290:19
       data: sentMessage,
     });
   } catch (error) {
-    console.error("sendMessage error:", error);
+    console.error("", error);
     res.status(500).json({ success: false, error: "Failed to send message" });
   }

[Killed] BooleanLiteral
controllers/inbox.controller.js:291:37
     });
   } catch (error) {
     console.error("sendMessage error:", error);
-    res.status(500).json({ success: false, error: "Failed to send message" });
+    res.status(500).json({ success: true, error: "Failed to send message" });
   }
 };
killedBy: Inbox Controller sendMessage should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to send message",
-   "success": false,

[Killed] BooleanLiteral
controllers/inbox.controller.js:312:9
     } = req.body;
 
     console.log("sendDirectMessage payload:", req.body);
-    if (!type || !title)
+    if (type || !title)
       return res.status(400).json({ error: "Type and title are required" });
 
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}

Number of calls: 0

[Killed] LogicalOperator
controllers/inbox.controller.js:312:9
     } = req.body;
 
     console.log("sendDirectMessage payload:", req.body);
-    if (!type || !title)
+    if (!type && !title)
       return res.status(400).json({ error: "Type and title are required" });
 
killedBy: Inbox Controller sendDirectMessage should return 400 if type is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 201

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:315:9
     if (!type || !title)
       return res.status(400).json({ error: "Type and title are required" });
 
-    if (!to || !Array.isArray(to) || to.filter(Boolean).length === 0)
+    if (to || !Array.isArray(to) || to.filter(Boolean).length === 0)
       return res
         .status(400)
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:315:38
     if (!type || !title)
       return res.status(400).json({ error: "Type and title are required" });
 
-    if (!to || !Array.isArray(to) || to.filter(Boolean).length === 0)
+    if (!to || !Array.isArray(to) || to.filter(Boolean).length !== 0)
       return res
         .status(400)
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:318:26
     if (!to || !Array.isArray(to) || to.filter(Boolean).length === 0)
       return res
         .status(400)
-        .json({ success: false, error: "Recipients required" });
+        .json({ success: true, error: "Recipients required" });
 
     const keyword = typeof to[0] === 'string' ? to[0] : null;
killedBy: Inbox Controller sendDirectMessage should return 400 if recipients are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Recipients required",
-   "success": false,

[Killed] ConditionalExpression
controllers/inbox.controller.js:320:21
         .status(400)
         .json({ success: false, error: "Recipients required" });
 
-    const keyword = typeof to[0] === 'string' ? to[0] : null;
+    const keyword = false ? to[0] : null;
     const isBroadcastKeyword =
       keyword && (
killedBy: Inbox Controller sendDirectMessage should handle broadcast keyword for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "to": ["user1", "user2"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Sent", "title": "Broadcast", "to": ["recipient1"], "type": "announcement"}

Number of calls: 1

[Killed] EqualityOperator
controllers/inbox.controller.js:320:21
         .status(400)
         .json({ success: false, error: "Recipients required" });
 
-    const keyword = typeof to[0] === 'string' ? to[0] : null;
+    const keyword = typeof to[0] !== 'string' ? to[0] : null;
     const isBroadcastKeyword =
       keyword && (
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}

Number of calls: 0

[Survived] ConditionalExpression
controllers/inbox.controller.js:323:9
     const keyword = typeof to[0] === 'string' ? to[0] : null;
     const isBroadcastKeyword =
       keyword && (
-        keyword === "to_allusers" ||
-        keyword === "to_all_student" ||
-        keyword === "to_all_organizer" ||
-        keyword === "to_all_sponsor" ||
-        keyword.startsWith("to_college:")
+        true
       );
 

[Survived] StringLiteral
controllers/inbox.controller.js:327:28
         keyword === "to_all_student" ||
         keyword === "to_all_organizer" ||
         keyword === "to_all_sponsor" ||
-        keyword.startsWith("to_college:")
+        keyword.startsWith("")
       );
 

[Survived] StringLiteral
controllers/inbox.controller.js:331:19
       );
 
     let toUserIds = [];
-      console.log("isBroadcastKeyword:", isBroadcastKeyword);
+      console.log("", isBroadcastKeyword);
       console.log("userRole:", userRole);
       console.log("keyword:", keyword);

[Killed] BlockStatement
controllers/inbox.controller.js:334:53
       console.log("isBroadcastKeyword:", isBroadcastKeyword);
       console.log("userRole:", userRole);
       console.log("keyword:", keyword);
-    if (userRole === "admin" && isBroadcastKeyword) {
-      toUserIds = await broadcastRecipients(keyword);
-    } else {
+    if (userRole === "admin" && isBroadcastKeyword) {} else {
       // 'to' is an array of {email, role} objects
       const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
killedBy: Inbox Controller sendDirectMessage should handle broadcast keyword for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "to": ["user1", "user2"]}
Received: {"description": undefined, "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Sent", "title": "Broadcast", "to": [], "type": "announcement"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:334:9
       console.log("isBroadcastKeyword:", isBroadcastKeyword);
       console.log("userRole:", userRole);
       console.log("keyword:", keyword);
-    if (userRole === "admin" && isBroadcastKeyword) {
+    if (true) {
       toUserIds = await broadcastRecipients(keyword);
     } else {
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}

Number of calls: 0

[Killed] BlockStatement
controllers/inbox.controller.js:336:12
       console.log("keyword:", keyword);
     if (userRole === "admin" && isBroadcastKeyword) {
       toUserIds = await broadcastRecipients(keyword);
-    } else {
-      // 'to' is an array of {email, role} objects
-      const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
-      const users = await Promise.all(findUserPromises);
-      toUserIds = users.filter(Boolean).map(user => user._id);
-    }
+    } else {}
 
     const sentMessage = await InboxEntity.create({
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}
Received: {"description": "Test description", "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Sent", "title": "Direct Message", "to": [], "type": "message"}

Nu

[Killed] ArrowFunction
controllers/inbox.controller.js:338:39
       toUserIds = await broadcastRecipients(keyword);
     } else {
       // 'to' is an array of {email, role} objects
-      const findUserPromises = to.map(recipient => User.findOne({ email: recipient.email, role: recipient.role }).select('_id').lean());
+      const findUserPromises = to.map(() => undefined);
       const users = await Promise.all(findUserPromises);
       toUserIds = users.filter(Boolean).map(user => user._id);
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}
Received: {"description": "Test description", "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "Sent", "title": "Direct Message", "to": [], "type": "message"}

Nu

[Killed] ObjectLiteral
controllers/inbox.controller.js:343:50
       toUserIds = users.filter(Boolean).map(user => user._id);
     }
 
-    const sentMessage = await InboxEntity.create({
-      type,
-      title,
-      description,
-      from: userId,
-      to: toUserIds,
-      relatedEvent,
-      relatedTeam,
-      relatedTeamModel,
-      status: "Sent",
-    });
+    const sentMessage = await InboxEntity.create({});
 
     const populatedMessage = await InboxEntity.findById(sentMessage._id)
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}
Received: {}

Number of calls: 1

[Killed] StringLiteral
controllers/inbox.controller.js:352:15
       relatedEvent,
       relatedTeam,
       relatedTeamModel,
-      status: "Sent",
+      status: "",
     });
 
killedBy: Inbox Controller sendDirectMessage should send a direct message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "Sent", "title": "Direct Message", "to": ["recipient1"], "type": "message"}
Received: {"description": "Test description", "from": "user123", "relatedEvent": undefined, "relatedTeam": undefined, "relatedTeamModel": undefined, "status": "", "title": "Direct Message", "to": ["recipient1"], "type": "messa
