[Survived] StringLiteral
controllers/inbox.controller.js:356:17
     });
 
     const populatedMessage = await InboxEntity.findById(sentMessage._id)
-      .populate("from", "email profile.name")
+      .populate("", "email profile.name")
       .populate("to", "email profile.name");
 

[Survived] StringLiteral
controllers/inbox.controller.js:357:23
 
     const populatedMessage = await InboxEntity.findById(sentMessage._id)
       .populate("from", "email profile.name")
-      .populate("to", "email profile.name");
+      .populate("to", "");
 
     res.status(201).json({

[Killed] BlockStatement
controllers/inbox.controller.js:364:19
       message: "Message sent successfully",
       data: populatedMessage,
     });
-  } catch (error) {
-    console.error("sendDirectMessage error:", error);
-    res.status(500).json({ success: false, error: "Failed to send message" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller sendDirectMessage should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:366:37
     });
   } catch (error) {
     console.error("sendDirectMessage error:", error);
-    res.status(500).json({ success: false, error: "Failed to send message" });
+    res.status(500).json({ success: true, error: "Failed to send message" });
   }
 };
killedBy: Inbox Controller sendDirectMessage should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to send message",
-   "success": false,

[Killed] ObjectLiteral
controllers/inbox.controller.js:366:26
     });
   } catch (error) {
     console.error("sendDirectMessage error:", error);
-    res.status(500).json({ success: false, error: "Failed to send message" });
+    res.status(500).json({});
   }
 };
killedBy: Inbox Controller sendDirectMessage should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Failed to send message",
-   "success": false,

[Killed] MethodExpression
controllers/inbox.controller.js:374:32
   try {
     const userId = req.user?.id;
 
-    const sentMessages = await InboxEntity.find({
-      from: userId,
-      status: { $in: ["Sent", "Approved", "Rejected", "Pending"] },
-    })
-      .populate({
-        path: "from",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate({
-        path: "to",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" })
-      .sort({ createdAt: -1 });
+    const sentMessages = await InboxEntity.find({
+  from: userId,
+  status: {
+    $in: ["Sent", "Approved", "Rejected", "Pending"]
+  }
+}).populate({
+  path: "from",
+  select: "email profile.name",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate({
+  path: "to",
+  select: "email profile.name",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate("relatedEvent", "name description").populate({
+  path: "relatedTeam",
+  select: "name"
+});
 
     res.status(200).json({
killedBy: Inbox Controller getListOfSents should return list of sent messages successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 2,
-   "data": Array [

[Survived] StringLiteral
controllers/inbox.controller.js:379:15
       status: { $in: ["Sent", "Approved", "Rejected", "Pending"] },
     })
       .populate({
-        path: "from",
+        path: "",
         select: "email profile.name",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }

[Survived] StringLiteral
controllers/inbox.controller.js:380:17
     })
       .populate({
         path: "from",
-        select: "email profile.name",
+        select: "",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })

[NoCoverage] LogicalOperator
controllers/inbox.controller.js:381:27
       .populate({
         path: "from",
         select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: doc => doc && {
+  profile: {
+    name: '[Deleted User]'
+  }
+}
       })
       .populate({

[NoCoverage] ConditionalExpression
controllers/inbox.controller.js:386:27
       .populate({
         path: "to",
         select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
+        transform: doc => false
       })
       .populate("relatedEvent", "name description")

[Survived] StringLiteral
controllers/inbox.controller.js:388:33
         select: "email profile.name",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
-      .populate("relatedEvent", "name description")
+      .populate("relatedEvent", "")
       .populate({ path: "relatedTeam", select: "name" })
       .sort({ createdAt: -1 });

[Survived] StringLiteral
controllers/inbox.controller.js:388:17
         select: "email profile.name",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
-      .populate("relatedEvent", "name description")
+      .populate("", "name description")
       .populate({ path: "relatedTeam", select: "name" })
       .sort({ createdAt: -1 });

[Survived] StringLiteral
controllers/inbox.controller.js:389:25
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
       .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" })
+      .populate({ path: "", select: "name" })
       .sort({ createdAt: -1 });
 

[Survived] UnaryOperator
controllers/inbox.controller.js:390:26
       })
       .populate("relatedEvent", "name description")
       .populate({ path: "relatedTeam", select: "name" })
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
 
     res.status(200).json({

[Survived] ObjectLiteral
controllers/inbox.controller.js:390:13
       })
       .populate("relatedEvent", "name description")
       .populate({ path: "relatedTeam", select: "name" })
-      .sort({ createdAt: -1 });
+      .sort({});
 
     res.status(200).json({

[Killed] BlockStatement
controllers/inbox.controller.js:397:19
       count: sentMessages.length,
       data: sentMessages,
     });
-  } catch (error) {
-    console.error("getListOfSents error:", error);
-    res
-      .status(500)
-      .json({ success: false, error: "Failed to fetch sent messages" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller getListOfSents should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:401:24
     console.error("getListOfSents error:", error);
     res
       .status(500)
-      .json({ success: false, error: "Failed to fetch sent messages" });
+      .json({ success: true, error: "Failed to fetch sent messages" });
   }
 };
killedBy: Inbox Controller getListOfSents should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to fetch sent messages",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:401:38
     console.error("getListOfSents error:", error);
     res
       .status(500)
-      .json({ success: false, error: "Failed to fetch sent messages" });
+      .json({ success: false, error: "" });
   }
 };
killedBy: Inbox Controller getListOfSents should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to fetch sent messages",
+   "error": "",

[Killed] MethodExpression
controllers/inbox.controller.js:411:35
 
     // Find all inbox entities where the 'to' array contains the user's ID.
     // Using { to: userId } works, but { to: { $in: [userId] } } is more explicit for arrays.
-    const arrivalMessages = await InboxEntity.find({ to: { $in: [userId] } })
-      .populate({
-        path: "from",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate({
-        path: "to",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
-      .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" })
-      .sort({ createdAt: -1 });
+    const arrivalMessages = await InboxEntity.find({
+  to: {
+    $in: [userId]
+  }
+}).populate({
+  path: "from",
+  select: "email profile.name",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate({
+  path: "to",
+  select: "email profile.name",
+  transform: doc => doc || {
+    profile: {
+      name: '[Deleted User]'
+    }
+  }
+}).populate("relatedEvent", "name description").populate({
+  path: "relatedTeam",
+  select: "name"
+});
 
     res.status(200).json({
killedBy: Inbox Controller getListOfArrivals should return list of arrival messages successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 2,
-   "data": Array [

[Killed] ObjectLiteral
controllers/inbox.controller.js:411:52
 
     // Find all inbox entities where the 'to' array contains the user's ID.
     // Using { to: userId } works, but { to: { $in: [userId] } } is more explicit for arrays.
-    const arrivalMessages = await InboxEntity.find({ to: { $in: [userId] } })
+    const arrivalMessages = await InboxEntity.find({})
       .populate({
         path: "from",
killedBy: Inbox Controller getListOfArrivals should return list of arrival messages successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "to": Object {
-     "$in": Array [

[Survived] ObjectLiteral
controllers/inbox.controller.js:417:17
         select: "email profile.name",
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
-      .populate({
-        path: "to",
-        select: "email profile.name",
-        transform: doc => doc || { profile: { name: '[Deleted User]' } }
-      })
+      .populate({})
       .populate("relatedEvent", "name description")
       .populate({ path: "relatedTeam", select: "name" })

[Survived] StringLiteral
controllers/inbox.controller.js:423:48
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
       .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" })
+      .populate({ path: "relatedTeam", select: "" })
       .sort({ createdAt: -1 });
 

[Survived] ObjectLiteral
controllers/inbox.controller.js:423:17
         transform: doc => doc || { profile: { name: '[Deleted User]' } }
       })
       .populate("relatedEvent", "name description")
-      .populate({ path: "relatedTeam", select: "name" })
+      .populate({})
       .sort({ createdAt: -1 });
 

[Killed] BlockStatement
controllers/inbox.controller.js:431:19
       count: arrivalMessages.length,
       data: arrivalMessages,
     });
-  } catch (error) {
-    console.error("getListOfArrivals error:", error);
-    res
-      .status(500)
-      .json({ success: false, error: "Failed to fetch arrival messages" });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller getListOfArrivals should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/inbox.controller.js:435:24
     console.error("getListOfArrivals error:", error);
     res
       .status(500)
-      .json({ success: false, error: "Failed to fetch arrival messages" });
+      .json({ success: true, error: "Failed to fetch arrival messages" });
   }
 };
killedBy: Inbox Controller getListOfArrivals should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Failed to fetch arrival messages",
-   "success": false,

[Killed] StringLiteral
controllers/inbox.controller.js:435:38
     console.error("getListOfArrivals error:", error);
     res
       .status(500)
-      .json({ success: false, error: "Failed to fetch arrival messages" });
+      .json({ success: false, error: "" });
   }
 };
killedBy: Inbox Controller getListOfArrivals should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to fetch arrival messages",
+   "error": "",

[Killed] BlockStatement
controllers/inbox.controller.js:446:17
       .populate("relatedEvent", "_id title subEvents sponsors")
       .lean();
 
-    if (!inbox) {
-      return res.status(404).json({ message: "Inbox item not found" });
-    }
+    if (!inbox) {}
 
     if (
killedBy: Inbox Controller approveInboxEntity should return 404 if inbox item not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:446:9
       .populate("relatedEvent", "_id title subEvents sponsors")
       .lean();
 
-    if (!inbox) {
+    if (false) {
       return res.status(404).json({ message: "Inbox item not found" });
     }
killedBy: Inbox Controller approveInboxEntity should return 404 if inbox item not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:451:7
     }
 
     if (
-      inbox.type === "message" ||
-      inbox.type === "announcement"
+      true
     ) {
       await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
controllers/inbox.controller.js:451:7
     }
 
     if (
-      inbox.type === "message" ||
+      inbox.type !== "message" ||
       inbox.type === "announcement"
     ) {
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
controllers/inbox.controller.js:452:7
 
     if (
       inbox.type === "message" ||
-      inbox.type === "announcement"
+      inbox.type !== "announcement"
     ) {
       await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
controllers/inbox.controller.js:452:7
 
     if (
       inbox.type === "message" ||
-      inbox.type === "announcement"
+      false
     ) {
       await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });

[Survived] BlockStatement
controllers/inbox.controller.js:453:7
     if (
       inbox.type === "message" ||
       inbox.type === "announcement"
-    ) {
-      await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
-      return res.status(200).json({
-        success: true,
-        message: `${inbox.type} approved successfully`,
-      });
-    }
+    ) {}
 
     if (inbox.type === "subevent_invite") {

[Killed] StringLiteral
controllers/inbox.controller.js:454:57
       inbox.type === "message" ||
       inbox.type === "announcement"
     ) {
-      await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
+      await InboxEntity.findByIdAndUpdate(id, { status: "" });
       return res.status(200).json({
         success: true,
killedBy: Inbox Controller approveInboxEntity should approve a message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "inbox123",
  Object {
-   "status": "Approved",

[Killed] ObjectLiteral
controllers/inbox.controller.js:455:35
       inbox.type === "announcement"
     ) {
       await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
-      return res.status(200).json({
-        success: true,
-        message: `${inbox.type} approved successfully`,
-      });
+      return res.status(200).json({});
     }
 
killedBy: Inbox Controller approveInboxEntity should approve a message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "message approved successfully",
-   "success": true,

[Killed] EqualityOperator
controllers/inbox.controller.js:461:9
       });
     }
 
-    if (inbox.type === "subevent_invite") {
+    if (inbox.type !== "subevent_invite") {
       const toUserId = inbox.to;
       const team = await Team.findOne({ leader: toUserId });
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/inbox.controller.js:461:9
       });
     }
 
-    if (inbox.type === "subevent_invite") {
+    if (true) {
       const toUserId = inbox.to;
       const team = await Team.findOne({ leader: toUserId });
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BooleanLiteral
controllers/inbox.controller.js:464:11
     if (inbox.type === "subevent_invite") {
       const toUserId = inbox.to;
       const team = await Team.findOne({ leader: toUserId });
-      if (!team) {
+      if (team) {
         return res
           .status(404)
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/inbox.controller.js:464:11
     if (inbox.type === "subevent_invite") {
       const toUserId = inbox.to;
       const team = await Team.findOne({ leader: toUserId });
-      if (!team) {
+      if (true) {
         return res
           .status(404)
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
controllers/inbox.controller.js:470:44
           .json({ message: "No team found where recipient is leader" });
       }
 
-      const subevent = await Event.findOne({ createdBy: team._id });
+      const subevent = await Event.findOne({});
       const mainEvent = await Event.findById(inbox.relatedEvent);
       if (!mainEvent || !subevent) {

[Killed] BooleanLiteral
controllers/inbox.controller.js:472:25
 
       const subevent = await Event.findOne({ createdBy: team._id });
       const mainEvent = await Event.findById(inbox.relatedEvent);
-      if (!mainEvent || !subevent) {
+      if (!mainEvent || subevent) {
         return res.status(404).json({ message: "Event not found" });
       }
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/inbox.controller.js:472:11
 
       const subevent = await Event.findOne({ createdBy: team._id });
       const mainEvent = await Event.findById(inbox.relatedEvent);
-      if (!mainEvent || !subevent) {
+      if (true) {
         return res.status(404).json({ message: "Event not found" });
       }
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
controllers/inbox.controller.js:473:37
       const subevent = await Event.findOne({ createdBy: team._id });
       const mainEvent = await Event.findById(inbox.relatedEvent);
       if (!mainEvent || !subevent) {
-        return res.status(404).json({ message: "Event not found" });
+        return res.status(404).json({});
       }
 
killedBy: Inbox Controller approveInboxEntity should return 404 if event not found for subevent_invite
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Event not found",
- }

[Survived] ConditionalExpression
controllers/inbox.controller.js:476:11
         return res.status(404).json({ message: "Event not found" });
       }
 
-      if (!Array.isArray(mainEvent.subEvents)) mainEvent.subEvents = [];
+      if (true) mainEvent.subEvents = [];
       let index = mainEvent.subEvents.findIndex(
         (s) => s.subevent?.toString() === subevent._id.toString()

[Survived] BooleanLiteral
controllers/inbox.controller.js:476:11
         return res.status(404).json({ message: "Event not found" });
       }
 
-      if (!Array.isArray(mainEvent.subEvents)) mainEvent.subEvents = [];
+      if (Array.isArray(mainEvent.subEvents)) mainEvent.subEvents = [];
       let index = mainEvent.subEvents.findIndex(
         (s) => s.subevent?.toString() === subevent._id.toString()

[Killed] EqualityOperator
controllers/inbox.controller.js:478:16
 
       if (!Array.isArray(mainEvent.subEvents)) mainEvent.subEvents = [];
       let index = mainEvent.subEvents.findIndex(
-        (s) => s.subevent?.toString() === subevent._id.toString()
+        (s) => s.subevent?.toString() !== subevent._id.toString()
       );
 
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite when subevent already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ArrowFunction
controllers/inbox.controller.js:478:9
 
       if (!Array.isArray(mainEvent.subEvents)) mainEvent.subEvents = [];
       let index = mainEvent.subEvents.findIndex(
-        (s) => s.subevent?.toString() === subevent._id.toString()
+        () => undefined
       );
 
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite when subevent already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:481:11
         (s) => s.subevent?.toString() === subevent._id.toString()
       );
 
-      if (index === -1) {
+      if (true) {
         mainEvent.subEvents.push({
           subevent: subevent._id,
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite when subevent already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Survived] ObjectLiteral
controllers/inbox.controller.js:482:34
       );
 
       if (index === -1) {
-        mainEvent.subEvents.push({
-          subevent: subevent._id,
-          status: "Approved",
-        });
+        mainEvent.subEvents.push({});
         index = mainEvent.subEvents.length - 1;
       } else {

[Survived] ArithmeticOperator
controllers/inbox.controller.js:486:17
           subevent: subevent._id,
           status: "Approved",
         });
-        index = mainEvent.subEvents.length - 1;
+        index = mainEvent.subEvents.length + 1;
       } else {
         mainEvent.subEvents[index].status = "Approved";

[Killed] BlockStatement
controllers/inbox.controller.js:487:14
           status: "Approved",
         });
         index = mainEvent.subEvents.length - 1;
-      } else {
-        mainEvent.subEvents[index].status = "Approved";
-      }
+      } else {}
 
       await mainEvent.save();
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite when subevent already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] StringLiteral
controllers/inbox.controller.js:488:45
         });
         index = mainEvent.subEvents.length - 1;
       } else {
-        mainEvent.subEvents[index].status = "Approved";
+        mainEvent.subEvents[index].status = "";
       }
 
killedBy: Inbox Controller approveInboxEntity should approve subevent_invite when subevent already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: ""

[Killed] ConditionalExpression
controllers/inbox.controller.js:506:9
       });
     }
 
-    if (inbox.type === "sponsorship_request") {
+    if (true) {
       const sponsorId = inbox.to[0]; // The sponsor is the first recipient
       const eventId = inbox.relatedEvent;
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] EqualityOperator
controllers/inbox.controller.js:506:9
       });
     }
 
-    if (inbox.type === "sponsorship_request") {
+    if (inbox.type !== "sponsorship_request") {
       const sponsorId = inbox.to[0]; // The sponsor is the first recipient
       const eventId = inbox.relatedEvent;
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:511:11
       const eventId = inbox.relatedEvent;
 
       const event = await Event.findById(eventId);
-      if (!event) {
+      if (true) {
         return res
           .status(404)
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BooleanLiteral
controllers/inbox.controller.js:511:11
       const eventId = inbox.relatedEvent;
 
       const event = await Event.findById(eventId);
-      if (!event) {
+      if (event) {
         return res
           .status(404)
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:518:58
       }
 
       // Find the sponsor in the event's sponsors array and update their status
-      const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() === sponsorId.toString());
+      const sponsorIndex = event.sponsors.findIndex(s => false);
 
       if (sponsorIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] EqualityOperator
controllers/inbox.controller.js:518:58
       }
 
       // Find the sponsor in the event's sponsors array and update their status
-      const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() === sponsorId.toString());
+      const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() !== sponsorId.toString());
 
       if (sponsorIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BlockStatement
controllers/inbox.controller.js:520:32
       // Find the sponsor in the event's sponsors array and update their status
       const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() === sponsorId.toString());
 
-      if (sponsorIndex !== -1) {
-        event.sponsors[sponsorIndex].status = "Approved";
-      } else {
+      if (sponsorIndex !== -1) {} else {
         // Fallback: if sponsor isn't in the list, add them. This shouldn't happen in a normal flow.
         event.sponsors.push({ sponsor: sponsorId, status: "Approved" });
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] UnaryOperator
controllers/inbox.controller.js:520:28
       // Find the sponsor in the event's sponsors array and update their status
       const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() === sponsorId.toString());
 
-      if (sponsorIndex !== -1) {
+      if (sponsorIndex !== +1) {
         event.sponsors[sponsorIndex].status = "Approved";
       } else {
killedBy: Inbox Controller approveInboxEntity should add sponsor if not in list (sponsorship_request fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
