[Killed] StringLiteral
controllers/inbox.controller.js:521:47
       const sponsorIndex = event.sponsors.findIndex(s => s.sponsor.toString() === sponsorId.toString());
 
       if (sponsorIndex !== -1) {
-        event.sponsors[sponsorIndex].status = "Approved";
+        event.sponsors[sponsorIndex].status = "";
       } else {
         // Fallback: if sponsor isn't in the list, add them. This shouldn't happen in a normal flow.
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: ""

[Killed] BlockStatement
controllers/inbox.controller.js:522:14
 
       if (sponsorIndex !== -1) {
         event.sponsors[sponsorIndex].status = "Approved";
-      } else {
-        // Fallback: if sponsor isn't in the list, add them. This shouldn't happen in a normal flow.
-        event.sponsors.push({ sponsor: sponsorId, status: "Approved" });
-      }
+      } else {}
 
       await event.save();
killedBy: Inbox Controller approveInboxEntity should add sponsor if not in list (sponsorship_request fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
controllers/inbox.controller.js:524:29
         event.sponsors[sponsorIndex].status = "Approved";
       } else {
         // Fallback: if sponsor isn't in the list, add them. This shouldn't happen in a normal flow.
-        event.sponsors.push({ sponsor: sponsorId, status: "Approved" });
+        event.sponsors.push({});
       }
 
killedBy: Inbox Controller approveInboxEntity should add sponsor if not in list (sponsorship_request fallback)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "sponsor": "newsponsor123",
-   "status": "Approved",

[Killed] ObjectLiteral
controllers/inbox.controller.js:530:35
       await event.save();
       await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
 
-      return res.status(200).json({
-        success: true,
-        message: "Sponsorship request approved successfully",
-        // Return the full event object so the frontend can update its state
-        event: event,
-      });
+      return res.status(200).json({});
     }
 
killedBy: Inbox Controller approveInboxEntity should approve sponsorship_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "event": Object {
-     "_id": "event123",

[Killed] ConditionalExpression
controllers/inbox.controller.js:538:9
       });
     }
 
-    if (inbox.type === "team_invite") {
+    if (true) {
       const teamId = inbox.relatedTeam;
       const newMemberId = inbox.to[0]; // The user who is accepting the invite
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: "pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:538:9
       });
     }
 
-    if (inbox.type === "team_invite") {
+    if (false) {
       const teamId = inbox.relatedTeam;
       const newMemberId = inbox.to[0]; // The user who is accepting the invite
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:542:11
       const teamId = inbox.relatedTeam;
       const newMemberId = inbox.to[0]; // The user who is accepting the invite
 
-      if (inbox.relatedTeamModel === 'StudentTeam') {
+      if (true) {
         const studentTeam = await StudentTeam.findById(teamId);
         if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:542:11
       const teamId = inbox.relatedTeam;
       const newMemberId = inbox.to[0]; // The user who is accepting the invite
 
-      if (inbox.relatedTeamModel === 'StudentTeam') {
+      if (false) {
         const studentTeam = await StudentTeam.findById(teamId);
         if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BooleanLiteral
controllers/inbox.controller.js:544:13
 
       if (inbox.relatedTeamModel === 'StudentTeam') {
         const studentTeam = await StudentTeam.findById(teamId);
-        if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
+        if (studentTeam) return res.status(404).json({ message: "Student Team not found" });
 
         const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:544:13
 
       if (inbox.relatedTeamModel === 'StudentTeam') {
         const studentTeam = await StudentTeam.findById(teamId);
-        if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
+        if (false) return res.status(404).json({ message: "Student Team not found" });
 
         const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
killedBy: Inbox Controller approveInboxEntity should return 404 if StudentTeam not found for team_invite
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/inbox.controller.js:546:64
         const studentTeam = await StudentTeam.findById(teamId);
         if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
 
-        const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
+        const memberIndex = studentTeam.members.findIndex(m => m.member.toString() !== newMemberId.toString());
 
         if (memberIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ArrowFunction
controllers/inbox.controller.js:546:59
         const studentTeam = await StudentTeam.findById(teamId);
         if (!studentTeam) return res.status(404).json({ message: "Student Team not found" });
 
-        const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
+        const memberIndex = studentTeam.members.findIndex(() => undefined);
 
         if (memberIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] UnaryOperator
controllers/inbox.controller.js:548:29
 
         const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
 
-        if (memberIndex !== -1) {
+        if (memberIndex !== +1) {
           studentTeam.members[memberIndex].status = "Approved";
         } else {
killedBy: Inbox Controller approveInboxEntity should add member if not in StudentTeam list (fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:548:13
 
         const memberIndex = studentTeam.members.findIndex(m => m.member.toString() === newMemberId.toString());
 
-        if (memberIndex !== -1) {
+        if (true) {
           studentTeam.members[memberIndex].status = "Approved";
         } else {
killedBy: Inbox Controller approveInboxEntity should add member if not in StudentTeam list (fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
controllers/inbox.controller.js:550:16
 
         if (memberIndex !== -1) {
           studentTeam.members[memberIndex].status = "Approved";
-        } else {
-          // Fallback: if user wasn't in members list, add them.
-          studentTeam.members.push({ member: newMemberId, status: "Approved" });
-        }
+        } else {}
 
         await studentTeam.save();
killedBy: Inbox Controller approveInboxEntity should add member if not in StudentTeam list (fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] StringLiteral
controllers/inbox.controller.js:552:67
           studentTeam.members[memberIndex].status = "Approved";
         } else {
           // Fallback: if user wasn't in members list, add them.
-          studentTeam.members.push({ member: newMemberId, status: "Approved" });
+          studentTeam.members.push({ member: newMemberId, status: "" });
         }
 
killedBy: Inbox Controller approveInboxEntity should add member if not in StudentTeam list (fallback)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "member": "newmember123",
-   "status": "Approved",

[Killed] ObjectLiteral
controllers/inbox.controller.js:558:37
         await studentTeam.save();
         await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
 
-        return res.status(200).json({
-          success: true,
-          message: "Successfully joined the student team",
-          data: {
-            teamId: studentTeam._id,
-            teamName: studentTeam.teamName,
-            members: studentTeam.members,
-          },
-        });
+        return res.status(200).json({});
 
       } else if (inbox.relatedTeamModel === 'Team') {
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": ObjectContaining {
-     "teamId": "team123",

[Killed] StringLiteral
controllers/inbox.controller.js:560:20
 
         return res.status(200).json({
           success: true,
-          message: "Successfully joined the student team",
+          message: "",
           data: {
             teamId: studentTeam._id,
killedBy: Inbox Controller approveInboxEntity should approve team_invite for StudentTeam successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": ObjectContaining {
+   "data": Object {

[Killed] ConditionalExpression
controllers/inbox.controller.js:568:18
           },
         });
 
-      } else if (inbox.relatedTeamModel === 'Team') {
+      } else if (false) {
         const organizerTeam = await Team.findById(teamId);
         if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:568:18
           },
         });
 
-      } else if (inbox.relatedTeamModel === 'Team') {
+      } else if (true) {
         const organizerTeam = await Team.findById(teamId);
         if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
killedBy: Inbox Controller approveInboxEntity should return 400 for invalid team model
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/inbox.controller.js:570:13
 
       } else if (inbox.relatedTeamModel === 'Team') {
         const organizerTeam = await Team.findById(teamId);
-        if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
+        if (organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
 
         const memberIndex = organizerTeam.members.findIndex(m => m.user.toString() === newMemberId.toString());
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:570:13
 
       } else if (inbox.relatedTeamModel === 'Team') {
         const organizerTeam = await Team.findById(teamId);
-        if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
+        if (true) return res.status(404).json({ message: "Organizer Team not found" });
 
         const memberIndex = organizerTeam.members.findIndex(m => m.user.toString() === newMemberId.toString());
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ArrowFunction
controllers/inbox.controller.js:572:61
         const organizerTeam = await Team.findById(teamId);
         if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
 
-        const memberIndex = organizerTeam.members.findIndex(m => m.user.toString() === newMemberId.toString());
+        const memberIndex = organizerTeam.members.findIndex(() => undefined);
 
         if (memberIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:572:66
         const organizerTeam = await Team.findById(teamId);
         if (!organizerTeam) return res.status(404).json({ message: "Organizer Team not found" });
 
-        const memberIndex = organizerTeam.members.findIndex(m => m.user.toString() === newMemberId.toString());
+        const memberIndex = organizerTeam.members.findIndex(m => false);
 
         if (memberIndex !== -1) {
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BlockStatement
controllers/inbox.controller.js:574:33
 
         const memberIndex = organizerTeam.members.findIndex(m => m.user.toString() === newMemberId.toString());
 
-        if (memberIndex !== -1) {
-          organizerTeam.members[memberIndex].status = "Approved";
-        } else {
+        if (memberIndex !== -1) {} else {
           // Fallback: if user wasn't in members list, add them.
           organizerTeam.members.push({ user: newMemberId, role: inbox.role || 'volunteer', status: "Approved" });
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BlockStatement
controllers/inbox.controller.js:576:16
 
         if (memberIndex !== -1) {
           organizerTeam.members[memberIndex].status = "Approved";
-        } else {
-          // Fallback: if user wasn't in members list, add them.
-          organizerTeam.members.push({ user: newMemberId, role: inbox.role || 'volunteer', status: "Approved" });
-        }
+        } else {}
 
         await organizerTeam.save();
killedBy: Inbox Controller approveInboxEntity should add member if not in Team list (fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:578:65
           organizerTeam.members[memberIndex].status = "Approved";
         } else {
           // Fallback: if user wasn't in members list, add them.
-          organizerTeam.members.push({ user: newMemberId, role: inbox.role || 'volunteer', status: "Approved" });
+          organizerTeam.members.push({ user: newMemberId, role: false, status: "Approved" });
         }
 
killedBy: Inbox Controller approveInboxEntity should add member if not in Team list (fallback)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "role": "volunteer",
+   "role": false,

[Killed] ConditionalExpression
controllers/inbox.controller.js:578:65
           organizerTeam.members[memberIndex].status = "Approved";
         } else {
           // Fallback: if user wasn't in members list, add them.
-          organizerTeam.members.push({ user: newMemberId, role: inbox.role || 'volunteer', status: "Approved" });
+          organizerTeam.members.push({ user: newMemberId, role: true, status: "Approved" });
         }
 
killedBy: Inbox Controller approveInboxEntity should add member if not in Team list (fallback)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "role": "volunteer",
+   "role": true,

[Survived] ObjectLiteral
controllers/inbox.controller.js:582:49
         }
 
         await organizerTeam.save();
-        await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
+        await InboxEntity.findByIdAndUpdate(id, {});
 
         return res.status(200).json({

[Killed] ObjectLiteral
controllers/inbox.controller.js:584:37
         await organizerTeam.save();
         await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
 
-        return res.status(200).json({
-          success: true,
-          message: "Successfully joined the organizer team",
-          data: {
-            teamId: organizerTeam._id,
-            teamName: organizerTeam.name,
-            members: organizerTeam.members,
-          },
-        });
+        return res.status(200).json({});
       } else {
         return res.status(400).json({ message: "Invalid team model for team invite." });
killedBy: Inbox Controller approveInboxEntity should approve team_invite for Team (organizer) successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": ObjectContaining {
-     "teamId": "team123",

[Killed] BlockStatement
controllers/inbox.controller.js:593:14
             members: organizerTeam.members,
           },
         });
-      } else {
-        return res.status(400).json({ message: "Invalid team model for team invite." });
-      }
+      } else {}
     }
 
killedBy: Inbox Controller approveInboxEntity should return 400 for invalid team model
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/inbox.controller.js:598:9
       }
     }
 
-    if (inbox.type === "registration_approval_request") {
+    if (true) {
       const studentId = inbox.from?._id || inbox.from;
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
killedBy: Inbox Controller approveInboxEntity should approve unknown inbox type with default handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "inbox123", {"status": "Approved"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/inbox.controller.js:598:9
       }
     }
 
-    if (inbox.type === "registration_approval_request") {
+    if (false) {
       const studentId = inbox.from?._id || inbox.from;
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: "pending"

[Killed] ConditionalExpression
controllers/inbox.controller.js:599:25
     }
 
     if (inbox.type === "registration_approval_request") {
-      const studentId = inbox.from?._id || inbox.from;
+      const studentId = true;
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
 
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": "organizer123", "status": "Sent", "to": "student123", "type": "message"}
Received: {"description": "🎉 You have successfully registered for \"Test Event\". Your check-in code is: ABC123", "from": "organizer123", "relatedEvent": "event123", "status": "Sent", "title": "Registration Approved for Test Event"

[Killed] LogicalOperator
controllers/inbox.controller.js:599:25
     }
 
     if (inbox.type === "registration_approval_request") {
-      const studentId = inbox.from?._id || inbox.from;
+      const studentId = inbox.from?._id && inbox.from;
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
 
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": "organizer123", "status": "Sent", "to": "student123", "type": "message"}
Received: {"description": "🎉 You have successfully registered for \"Test Event\". Your check-in code is: ABC123", "from": "organizer123", "relatedEvent": "event123", "status": "Sent", "title": "Registration Approved for Test Event"

[Survived] LogicalOperator
controllers/inbox.controller.js:600:23
 
     if (inbox.type === "registration_approval_request") {
       const studentId = inbox.from?._id || inbox.from;
-      const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
+      const eventId = inbox.relatedEvent?._id && inbox.relatedEvent;
 
       const registration = await Registration.findOne({ studentId, eventId });

[Survived] OptionalChaining
controllers/inbox.controller.js:600:23
 
     if (inbox.type === "registration_approval_request") {
       const studentId = inbox.from?._id || inbox.from;
-      const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
+      const eventId = inbox.relatedEvent._id || inbox.relatedEvent;
 
       const registration = await Registration.findOne({ studentId, eventId });

[Survived] ObjectLiteral
controllers/inbox.controller.js:602:55
       const studentId = inbox.from?._id || inbox.from;
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
 
-      const registration = await Registration.findOne({ studentId, eventId });
+      const registration = await Registration.findOne({});
       if (!registration)
         return res.status(404).json({ message: "No registration found" });

[Killed] ConditionalExpression
controllers/inbox.controller.js:603:11
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
 
       const registration = await Registration.findOne({ studentId, eventId });
-      if (!registration)
+      if (true)
         return res.status(404).json({ message: "No registration found" });
 
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: "pending"

[Killed] BooleanLiteral
controllers/inbox.controller.js:603:11
       const eventId = inbox.relatedEvent?._id || inbox.relatedEvent;
 
       const registration = await Registration.findOne({ studentId, eventId });
-      if (!registration)
+      if (registration)
         return res.status(404).json({ message: "No registration found" });
 
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: "pending"

[Killed] StringLiteral
controllers/inbox.controller.js:604:48
 
       const registration = await Registration.findOne({ studentId, eventId });
       if (!registration)
-        return res.status(404).json({ message: "No registration found" });
+        return res.status(404).json({ message: "" });
 
       registration.paymentStatus = "verified";
killedBy: Inbox Controller approveInboxEntity should return 404 if registration not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "No registration found",
+   "message": "",

[Killed] StringLiteral
controllers/inbox.controller.js:606:36
       if (!registration)
         return res.status(404).json({ message: "No registration found" });
 
-      registration.paymentStatus = "verified";
+      registration.paymentStatus = "";
       registration.status = "confirmed";
       await registration.save();
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: ""

[Killed] StringLiteral
controllers/inbox.controller.js:615:15
       const event = await Event.findById(eventId);
       const checkInCode = registration.checkInCode;
       await InboxEntity.create({
-        type: "message",
+        type: "",
         from: inbox.to,
         to: studentId,
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": "organizer123", "status": "Sent", "to": "student123", "type": "message"}
Received: {"description": "🎉 You have successfully registered for \"Test Event\". Your check-in code is: ABC123", "from": "organizer123", "relatedEvent": "event123", "status": "Sent", "title": "Registration Approved for Test Event"

[Survived] StringLiteral
controllers/inbox.controller.js:620:22
         to: studentId,
         relatedEvent: eventId,
         title: `Registration Approved for ${event.title}`,
-        description: `🎉 You have successfully registered for "${event.title}". Your check-in code is: ${checkInCode}`,
+        description: ``
         status: "Sent",
       });

[Killed] StringLiteral
controllers/inbox.controller.js:621:17
         relatedEvent: eventId,
         title: `Registration Approved for ${event.title}`,
         description: `🎉 You have successfully registered for "${event.title}". Your check-in code is: ${checkInCode}`,
-        status: "Sent",
+        status: "",
       });
       return res.status(200).json({
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"from": "organizer123", "status": "Sent", "to": "student123", "type": "message"}
Received: {"description": "🎉 You have successfully registered for \"Test Event\". Your check-in code is: ABC123", "from": "organizer123", "relatedEvent": "event123", "status": "", "title": "Registration Approved for Test Event", "t

[Killed] StringLiteral
controllers/inbox.controller.js:625:18
       });
       return res.status(200).json({
         success: true,
-        message: "Registration approved successfully",
+        message: "",
         data: registration,
       });
killedBy: Inbox Controller approveInboxEntity should approve registration_approval_request successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,8 +6,8 @@
      "paymentStatus": "verified",
      "save": [Function mockConstructor],

[Killed] ObjectLiteral
controllers/inbox.controller.js:631:26
     }
 
     await InboxEntity.findByIdAndUpdate(id, { status: "Approved" });
-    res.status(200).json({
-      success: true,
-      message: `${inbox.type} approved successfully`,
-    });
+    res.status(200).json({});
   } catch (error) {
     res.status(500).json({
killedBy: Inbox Controller approveInboxEntity should approve unknown inbox type with default handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "custom_type approved successfully",
-   "success": true,

[Killed] BlockStatement
controllers/inbox.controller.js:635:19
       success: true,
       message: `${inbox.type} approved successfully`,
     });
-  } catch (error) {
-    res.status(500).json({
-      success: false,
-      message: "Failed to approve inbox",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller approveInboxEntity should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
