[Killed] BooleanLiteral
controllers/inbox.controller.js:649:9
     const { id } = req.params;
     const inbox = await InboxEntity.findById(id).lean();
 
-    if (!inbox) {
+    if (inbox) {
       return res.status(404).json({ message: "Inbox item not found" });
     }
killedBy: Inbox Controller rejectInboxEntity should reject a message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "inbox123", {"status": "Rejected"}

Number of calls: 0

[Killed] StringLiteral
controllers/inbox.controller.js:650:46
     const inbox = await InboxEntity.findById(id).lean();
 
     if (!inbox) {
-      return res.status(404).json({ message: "Inbox item not found" });
+      return res.status(404).json({ message: "" });
     }
 
killedBy: Inbox Controller rejectInboxEntity should return 404 if inbox item not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Inbox item not found",
+   "message": "",

[Killed] BlockStatement
controllers/inbox.controller.js:654:39
     }
 
     // If it's a team invite rejection, remove the member from the team list
-    if (inbox.type === "team_invite") {
-      const teamId = inbox.relatedTeam;
-      const memberIdToReject = inbox.to[0];
-
-      if (inbox.relatedTeamModel === 'StudentTeam') {
-        await StudentTeam.findByIdAndUpdate(teamId, {
-          $pull: { members: { member: memberIdToReject } }
-        });
-      } else if (inbox.relatedTeamModel === 'Team') {
-        await Team.findByIdAndUpdate(teamId, {
-          $pull: { members: { user: memberIdToReject } }
-        });
-      }
-    }
+    if (inbox.type === "team_invite") {}
 
     await InboxEntity.findByIdAndUpdate(id, { status: "Rejected" });
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for StudentTeam
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123", {"$pull": {"members": {"member": "member123"}}}

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:654:9
     }
 
     // If it's a team invite rejection, remove the member from the team list
-    if (inbox.type === "team_invite") {
+    if (inbox.type !== "team_invite") {
       const teamId = inbox.relatedTeam;
       const memberIdToReject = inbox.to[0];
killedBy: Inbox Controller rejectInboxEntity should reject a message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "inbox123", {"status": "Rejected"}

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:658:11
       const teamId = inbox.relatedTeam;
       const memberIdToReject = inbox.to[0];
 
-      if (inbox.relatedTeamModel === 'StudentTeam') {
+      if (inbox.relatedTeamModel !== 'StudentTeam') {
         await StudentTeam.findByIdAndUpdate(teamId, {
           $pull: { members: { member: memberIdToReject } }
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for StudentTeam
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123", {"$pull": {"members": {"member": "member123"}}}

Number of calls: 0

[Killed] ObjectLiteral
controllers/inbox.controller.js:659:53
       const memberIdToReject = inbox.to[0];
 
       if (inbox.relatedTeamModel === 'StudentTeam') {
-        await StudentTeam.findByIdAndUpdate(teamId, {
-          $pull: { members: { member: memberIdToReject } }
-        });
+        await StudentTeam.findByIdAndUpdate(teamId, {});
       } else if (inbox.relatedTeamModel === 'Team') {
         await Team.findByIdAndUpdate(teamId, {
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for StudentTeam
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "team123",
- Object {
-   "$pull": Object {

[Killed] ConditionalExpression
controllers/inbox.controller.js:662:18
         await StudentTeam.findByIdAndUpdate(teamId, {
           $pull: { members: { member: memberIdToReject } }
         });
-      } else if (inbox.relatedTeamModel === 'Team') {
+      } else if (false) {
         await Team.findByIdAndUpdate(teamId, {
           $pull: { members: { user: memberIdToReject } }
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for Team (organizer)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123", {"$pull": {"members": {"user": "member123"}}}

Number of calls: 0

[Killed] EqualityOperator
controllers/inbox.controller.js:662:18
         await StudentTeam.findByIdAndUpdate(teamId, {
           $pull: { members: { member: memberIdToReject } }
         });
-      } else if (inbox.relatedTeamModel === 'Team') {
+      } else if (inbox.relatedTeamModel !== 'Team') {
         await Team.findByIdAndUpdate(teamId, {
           $pull: { members: { user: memberIdToReject } }
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for Team (organizer)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123", {"$pull": {"members": {"user": "member123"}}}

Number of calls: 0

[Killed] ObjectLiteral
controllers/inbox.controller.js:663:46
           $pull: { members: { member: memberIdToReject } }
         });
       } else if (inbox.relatedTeamModel === 'Team') {
-        await Team.findByIdAndUpdate(teamId, {
-          $pull: { members: { user: memberIdToReject } }
-        });
+        await Team.findByIdAndUpdate(teamId, {});
       }
     }
killedBy: Inbox Controller rejectInboxEntity should handle team invite rejection for Team (organizer)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "team123",
- Object {
-   "$pull": Object {

[Killed] StringLiteral
controllers/inbox.controller.js:673:16
 
     return res.status(200).json({
       success: true,
-      message: `${inbox.type} rejected successfully`,
+      message: ``,
       data: { id: inbox._id, type: inbox.type },
     });
killedBy: Inbox Controller rejectInboxEntity should reject a message successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "id": "inbox123",

[Killed] BlockStatement
controllers/inbox.controller.js:685:19
     //   message: `${inbox.type} rejected successfully`,
     //   data: { id: inbox._id, type: inbox.type },
     // });
-  } catch (error) {
-    res.status(500).json({
-      success: false,
-      message: "Failed to reject inbox item",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Inbox Controller rejectInboxEntity should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
