[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:5:39
 import Team from "../../models/organizerTeam.model.js";
 import Registration from "../../models/registration.model.js";
 // Helper: get team ids for a user (leader or member)
-async function getUserTeamIds(userId) {
-  const teams = await Team.find({
-    $or: [{ leader: userId }, { "members.user": userId }],
-  })
-    .select("_id")
-    .lean();
-  return teams.map((t) => t._id);
-}
+async function getUserTeamIds(userId) {}
 
 // Helper: standard population for event's createdBy field
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.user": "user123"}]}

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:6:33
 import Registration from "../../models/registration.model.js";
 // Helper: get team ids for a user (leader or member)
 async function getUserTeamIds(userId) {
-  const teams = await Team.find({
-    $or: [{ leader: userId }, { "members.user": userId }],
-  })
+  const teams = await Team.find({})
     .select("_id")
     .lean();
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "$or": Array [
-     Object {

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:7:11
 // Helper: get team ids for a user (leader or member)
 async function getUserTeamIds(userId) {
   const teams = await Team.find({
-    $or: [{ leader: userId }, { "members.user": userId }],
+    $or: [{}, { "members.user": userId }],
   })
     .select("_id")
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "$or": Array [
-     Object {

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:7:31
 // Helper: get team ids for a user (leader or member)
 async function getUserTeamIds(userId) {
   const teams = await Team.find({
-    $or: [{ leader: userId }, { "members.user": userId }],
+    $or: [{ leader: userId }, {}],
   })
     .select("_id")
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "$or": Array [
      Object {

[Killed] ArrowFunction
controllers/organizer_controllers/organizer.dashboard.controller.js:11:20
   })
     .select("_id")
     .lean();
-  return teams.map((t) => t._id);
+  return teams.map(() => undefined);
 }
 
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "createdBy": Object {
      "$in": Array [

[Survived] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:20:7
     path: 'createdBy',
     select: 'name members leader',
     populate: [
-      {
-        path: 'members',
-        match: { status: { $ne: 'Pending' } },
-        populate: {
-          path: 'user',
-          select: 'profile.name email _id'
-        }
-      },
+      {},
       { path: 'leader', select: '_id profile.name' }
     ]

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:21:15
     select: 'name members leader',
     populate: [
       {
-        path: 'members',
+        path: "",
         match: { status: { $ne: 'Pending' } },
         populate: {

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:24:17
         path: 'members',
         match: { status: { $ne: 'Pending' } },
         populate: {
-          path: 'user',
+          path: "",
           select: 'profile.name email _id'
         }

[Survived] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:28:7
           select: 'profile.name email _id'
         }
       },
-      { path: 'leader', select: '_id profile.name' }
+      {}
     ]
   },

[Survived] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:31:3
       { path: 'leader', select: '_id profile.name' }
     ]
   },
-  {
-    path: 'subEvents.subevent',
-    select: 'title createdBy',
-    populate: {
-      path: 'createdBy',
-      select: 'name'
-    }
-  }
+  {}
 ];
 

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:32:11
     ]
   },
   {
-    path: 'subEvents.subevent',
+    path: "",
     select: 'title createdBy',
     populate: {

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:35:13
     path: 'subEvents.subevent',
     select: 'title createdBy',
     populate: {
-      path: 'createdBy',
+      path: "",
       select: 'name'
     }

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:36:15
     select: 'title createdBy',
     populate: {
       path: 'createdBy',
-      select: 'name'
+      select: ""
     }
   }

[Killed] OptionalChaining
controllers/organizer_controllers/organizer.dashboard.controller.js:46:20
 
 export async function getEventsForUser(req, res) {
   try {
-    const userId = req.user?.id;
+    const userId = req.user.id;
     if (!userId) return res.status(401).json({ error: "Unauthenticated" });
     const teamIds = await getUserTeamIds(userId);
killedBy: Event Controller getEventsForUser should return 401 if user is unauthenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:47:9
 export async function getEventsForUser(req, res) {
   try {
     const userId = req.user?.id;
-    if (!userId) return res.status(401).json({ error: "Unauthenticated" });
+    if (true) return res.status(401).json({ error: "Unauthenticated" });
     const teamIds = await getUserTeamIds(userId);
killedBy: Event Controller getEventsForUser should return events for the user's teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.user": "user123"}]}

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:47:9
 export async function getEventsForUser(req, res) {
   try {
     const userId = req.user?.id;
-    if (!userId) return res.status(401).json({ error: "Unauthenticated" });
+    if (userId) return res.status(401).json({ error: "Unauthenticated" });
     const teamIds = await getUserTeamIds(userId);
killedBy: Event Controller getEventsForUser should return 401 if user is unauthenticated
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:51:15
     const teamIds = await getUserTeamIds(userId);
     res.json(events);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
+  } catch (e) {}
 }
 
killedBy: Event Controller getEventsForUser should handle errors (500)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:56:52
   }
 }
 
-export async function getPublishedEvents(req, res) {
-  try {
-    const userId = req.user?.id;
-    const teamIds = await getUserTeamIds(userId);
-    const events = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "published",
-    }).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
-    res.json(events);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
-}
+export async function getPublishedEvents(req, res) {}
 
 export async function getDraftEvents(req, res) {
killedBy: Event Controller getPublishedEvents should return published events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"$in": ["team1"]}, "status": "published"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:57:7
 }
 
 export async function getPublishedEvents(req, res) {
-  try {
-    const userId = req.user?.id;
-    const teamIds = await getUserTeamIds(userId);
-    const events = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "published",
-    }).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
-    res.json(events);
-  } catch (e) {
+  try {} catch (e) {
     res.status(500).json({ error: e.message });
   }
killedBy: Event Controller getPublishedEvents should return published events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"$in": ["team1"]}, "status": "published"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:60:37
   try {
     const userId = req.user?.id;
     const teamIds = await getUserTeamIds(userId);
-    const events = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "published",
-    }).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
+    const events = await Event.find({}).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
     res.json(events);
   } catch (e) {
killedBy: Event Controller getPublishedEvents should return published events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "createdBy": Object {
-     "$in": Array [

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:62:15
     const teamIds = await getUserTeamIds(userId);
     const events = await Event.find({
       createdBy: { $in: teamIds },
-      status: "published",
+      status: "",
     }).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
     res.json(events);
killedBy: Event Controller getPublishedEvents should return published events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,7 +2,7 @@
    "createdBy": Object {
      "$in": Array [

[Survived] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:66:26
     }).select(eventFieldsToSelect).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' }).lean();
     res.json(events);
   } catch (e) {
-    res.status(500).json({ error: e.message });
+    res.status(500).json({});
   }
 }

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:77:15
 
     res.json(drafts);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
+  } catch (e) {}
 }
 
killedBy: Event Controller getDraftEvents should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:83:53
 }
 
 // Stubs for registration logs and check-ins (replace with your collections)
-export async function getRegistrationLogs(req, res) {
-  try {
-    const { eventId } = req.params;
-    // TODO: Join with real Registration model when available
-    res.json([]);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
-}
+export async function getRegistrationLogs(req, res) {}
 
 export async function getCheckIns(req, res) {
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getRegistrationLogs should return empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:84:7
 
 // Stubs for registration logs and check-ins (replace with your collections)
 export async function getRegistrationLogs(req, res) {
-  try {
-    const { eventId } = req.params;
-    // TODO: Join with real Registration model when available
-    res.json([]);
-  } catch (e) {
+  try {} catch (e) {
     res.status(500).json({ error: e.message });
   }
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getRegistrationLogs should return empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []

Number of calls: 0

[Killed] ArrayDeclaration
controllers/organizer_controllers/organizer.dashboard.controller.js:87:14
   try {
     const { eventId } = req.params;
     // TODO: Join with real Registration model when available
-    res.json([]);
+    res.json(["Stryker was here"]);
   } catch (e) {
     res.status(500).json({ error: e.message });
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getRegistrationLogs should return empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:88:15
     const { eventId } = req.params;
     // TODO: Join with real Registration model when available
     res.json([]);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
+  } catch (e) {}
 }
 
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getRegistrationLogs should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:93:45
   }
 }
 
-export async function getCheckIns(req, res) {
-  try {
-    const { eventId } = req.params;
-    // TODO: Join with real CheckIn model when available
-    res.json([]);
-  } catch (e) {
-    res.status(500).json({ error: e.message });
-  }
-}
+export async function getCheckIns(req, res) {}
 
 export const fetchCompletedEvents = async (req, res) => {
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getCheckIns should return empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:94:7
 }
 
 export async function getCheckIns(req, res) {
-  try {
-    const { eventId } = req.params;
-    // TODO: Join with real CheckIn model when available
-    res.json([]);
-  } catch (e) {
+  try {} catch (e) {
     res.status(500).json({ error: e.message });
   }
killedBy: Event Controller Stubs (getRegistrationLogs / getCheckIns) getCheckIns should return empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:103:57
   }
 }
 
-export const fetchCompletedEvents = async (req, res) => {
-  try {
-    const organizerId = req.user.id;
-    const teamIds = await getUserTeamIds(organizerId);
-
-    const completedEvents = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "completed",
-    })
-      .select(eventFieldsToSelect)
-      .populate(populateEventDetails)
-      .populate({ path: 'announcements.author', select: 'profile.name email _id' })
-      .sort({ updatedAt: -1 })
-      .lean();
-
-    return res.status(200).json(completedEvents);
-  } catch (error) {
-    res
-      .status(500)
-      .json({
-        message: "Server error while fetching completed events.",
-        error: error.message,
-      });
-  }
-};
+export const fetchCompletedEvents = async (req, res) => {};
 
 export const getRegisteredStudentsByEID = async (req, res) => {
killedBy: Event Controller fetchCompletedEvents should fetch completed events sorted by date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"$in": ["team1"]}, "status": "completed"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:104:7
 }
 
 export const fetchCompletedEvents = async (req, res) => {
-  try {
-    const organizerId = req.user.id;
-    const teamIds = await getUserTeamIds(organizerId);
-
-    const completedEvents = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "completed",
-    })
-      .select(eventFieldsToSelect)
-      .populate(populateEventDetails)
-      .populate({ path: 'announcements.author', select: 'profile.name email _id' })
-      .sort({ updatedAt: -1 })
-      .lean();
-
-    return res.status(200).json(completedEvents);
-  } catch (error) {
+  try {} catch (error) {
     res
       .status(500)
killedBy: Event Controller fetchCompletedEvents should fetch completed events sorted by date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"$in": ["team1"]}, "status": "completed"}

Number of calls: 0

[Killed] MethodExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:108:35
     const organizerId = req.user.id;
     const teamIds = await getUserTeamIds(organizerId);
 
-    const completedEvents = await Event.find({
-      createdBy: { $in: teamIds },
-      status: "completed",
-    })
-      .select(eventFieldsToSelect)
-      .populate(populateEventDetails)
-      .populate({ path: 'announcements.author', select: 'profile.name email _id' })
-      .sort({ updatedAt: -1 })
+    const completedEvents = await Event.find({
+  createdBy: {
+    $in: teamIds
+  },
+  status: "completed"
+}).select(eventFieldsToSelect).populate(populateEventDetails).populate({
+  path: 'announcements.author',
+  select: 'profile.name email _id'
+})
       .lean();
 
killedBy: Event Controller fetchCompletedEvents should fetch completed events sorted by date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"updatedAt": -1}

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:110:15
 
     const completedEvents = await Event.find({
       createdBy: { $in: teamIds },
-      status: "completed",
+      status: "",
     })
       .select(eventFieldsToSelect)
killedBy: Event Controller fetchCompletedEvents should fetch completed events sorted by date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,7 +2,7 @@
    "createdBy": Object {
      "$in": Array [

[Survived] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:114:25
     })
       .select(eventFieldsToSelect)
       .populate(populateEventDetails)
-      .populate({ path: 'announcements.author', select: 'profile.name email _id' })
+      .populate({ path: "", select: 'profile.name email _id' })
       .sort({ updatedAt: -1 })
       .lean();

[Killed] UnaryOperator
controllers/organizer_controllers/organizer.dashboard.controller.js:115:26
       .select(eventFieldsToSelect)
       .populate(populateEventDetails)
       .populate({ path: 'announcements.author', select: 'profile.name email _id' })
-      .sort({ updatedAt: -1 })
+      .sort({ updatedAt: +1 })
       .lean();
 
killedBy: Event Controller fetchCompletedEvents should fetch completed events sorted by date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "updatedAt": -1,
+   "updatedAt": 1,

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:119:19
       .lean();
 
     return res.status(200).json(completedEvents);
-  } catch (error) {
-    res
-      .status(500)
-      .json({
-        message: "Server error while fetching completed events.",
-        error: error.message,
-      });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller fetchCompletedEvents should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:122:13
   } catch (error) {
     res
       .status(500)
-      .json({
-        message: "Server error while fetching completed events.",
-        error: error.message,
-      });
+      .json({});
   }
 };
killedBy: Event Controller fetchCompletedEvents should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Server error while fetching completed events."}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:130:7
 };
 
 export const getRegisteredStudentsByEID = async (req, res) => {
-  try {
-    const { eventId } = req.params;
-
-    const registrations = await Registration.find({
-      eventId: eventId,
-    })
-      .populate({
-        path: "userId",
-        select: "profile.name profile.contactNo email",
-      })
-      .populate({
-        path: "teamName", // This refers to StudentTeam model
-        select: "teamName leader",
-      })
-      .select("-checkInCode")
-      .lean();
-
-    if (!registrations || registrations.length === 0) {
-      return res.status(200).json([]); // Always return an array
-    }
-
-    res.status(200).json(registrations);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching registered students:", error);
     res.status(500).json({
killedBy: Event Controller getRegisteredStudentsByEID should return registrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"eventId": "evt1"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:140:17
         path: "userId",
         select: "profile.name profile.contactNo email",
       })
-      .populate({
-        path: "teamName", // This refers to StudentTeam model
-        select: "teamName leader",
-      })
+      .populate({})
       .select("-checkInCode")
       .lean();
killedBy: Event Controller getRegisteredStudentsByEID should return registrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "teamName", "select": "teamName leader"}
Received
       1
          Object {
        -   "path": "teamName",
        -   "select": "teamName leader",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:147:55
       .select("-checkInCode")
       .lean();
 
-    if (!registrations || registrations.length === 0) {
-      return res.status(200).json([]); // Always return an array
-    }
+    if (!registrations || registrations.length === 0) {}
 
     res.status(200).json(registrations);
killedBy: Event Controller getRegisteredStudentsByEID should return empty array if results are null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []
Received: null

Number of calls: 1

[Killed] EqualityOperator
controllers/organizer_controllers/organizer.dashboard.controller.js:147:27
       .select("-checkInCode")
       .lean();
 
-    if (!registrations || registrations.length === 0) {
+    if (!registrations || registrations.length !== 0) {
       return res.status(200).json([]); // Always return an array
     }
killedBy: Event Controller getRegisteredStudentsByEID should return registrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Object {
-     "_id": "reg1",

[Killed] ArrayDeclaration
controllers/organizer_controllers/organizer.dashboard.controller.js:148:35
       .lean();
 
     if (!registrations || registrations.length === 0) {
-      return res.status(200).json([]); // Always return an array
+      return res.status(200).json(["Stryker was here"]); // Always return an array
     }
 
killedBy: Event Controller getRegisteredStudentsByEID should return empty array if no registrations found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:152:19
     }
 
     res.status(200).json(registrations);
-  } catch (error) {
-    console.error("Error fetching registered students:", error);
-    res.status(500).json({
-      message: "Server error while fetching registered students.",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller getRegisteredStudentsByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching registered students:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:153:19
 
     res.status(200).json(registrations);
   } catch (error) {
-    console.error("Error fetching registered students:", error);
+    console.error("", error);
     res.status(500).json({
       message: "Server error while fetching registered students.",
killedBy: Event Controller getRegisteredStudentsByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching registered students:", Any<Error>
Received: "", [Error: Reg Fail]

Number of calls: 1

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:165:56
   try {
     const { eventId } = req.params;
 
-    const event = await Event.findById(eventId).select('timeline').lean();
+    const event = await Event.findById(eventId).select("").lean();
     if (!event) {
       return res.status(404).json({ message: "Event not found" });
killedBy: Event Controller getAttendeesByEID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "timeline"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:166:9
     const { eventId } = req.params;
 
     const event = await Event.findById(eventId).select('timeline').lean();
-    if (!event) {
+    if (false) {
       return res.status(404).json({ message: "Event not found" });
     }
killedBy: Event Controller getAttendeesByEID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:166:9
     const { eventId } = req.params;
 
     const event = await Event.findById(eventId).select('timeline').lean();
-    if (!event) {
+    if (true) {
       return res.status(404).json({ message: "Event not found" });
     }
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"checkIns.status": "present", "checkIns.timelineRef": "t1", "eventId": "evt1"}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:170:95
       return res.status(404).json({ message: "Event not found" });
     }
 
-    const attendeesByTimeline = await Promise.all(event.timeline.map(async (timelineEntry) => {
-      const attendees = await Registration.find({
-        eventId: eventId,
-        'checkIns.timelineRef': timelineEntry._id,
-        'checkIns.status': 'present'
-      })
-      .populate({
-        path: 'userId',
-        select: 'profile.name email'
-      })
-      .select('userId checkIns')
-      .lean();
-
-      return {
-        timeline: {
-          _id: timelineEntry._id,
-          title: timelineEntry.title,
-          date: timelineEntry.date,
-        },
-        attendees: attendees,
-      };
-    }));
+    const attendeesByTimeline = await Promise.all(event.timeline.map(async (timelineEntry) => {}));
 
     if (!attendeesByTimeline || attendeesByTimeline.length === 0) {
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"checkIns.status": "present", "checkIns.timelineRef": "t1", "eventId": "evt1"}

Number of calls: 0
