[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:171:49
     }
 
     const attendeesByTimeline = await Promise.all(event.timeline.map(async (timelineEntry) => {
-      const attendees = await Registration.find({
-        eventId: eventId,
-        'checkIns.timelineRef': timelineEntry._id,
-        'checkIns.status': 'present'
-      })
+      const attendees = await Registration.find({})
       .populate({
         path: 'userId',
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "checkIns.status": "present",
-   "checkIns.timelineRef": "t1",

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:176:17
         'checkIns.timelineRef': timelineEntry._id,
         'checkIns.status': 'present'
       })
-      .populate({
-        path: 'userId',
-        select: 'profile.name email'
-      })
+      .populate({})
       .select('userId checkIns')
       .lean();
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "path": "userId",
-   "select": "profile.name email",

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:178:17
       })
       .populate({
         path: 'userId',
-        select: 'profile.name email'
+        select: ""
       })
       .select('userId checkIns')
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": "userId",
-   "select": "profile.name email",

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:184:19
       .lean();
 
       return {
-        timeline: {
-          _id: timelineEntry._id,
-          title: timelineEntry.title,
-          date: timelineEntry.date,
-        },
+        timeline: {},
         attendees: attendees,
       };
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining [ObjectContaining {"attendees": [{"userId": "u1"}], "timeline": ObjectContaining {"_id": "t1"}}]
Received: [{"attendees": [{"userId": "u1"}], "timeline": {}}]

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:193:9
       };
     }));
 
-    if (!attendeesByTimeline || attendeesByTimeline.length === 0) {
+    if (attendeesByTimeline || attendeesByTimeline.length === 0) {
       return res
         .status(200)
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining [ObjectContaining {"attendees": [{"userId": "u1"}], "timeline": ObjectContaining {"_id": "t1"}}]
Received: {"attendees": [], "message": "No attendees recorded yet."}

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:193:9
       };
     }));
 
-    if (!attendeesByTimeline || attendeesByTimeline.length === 0) {
+    if (true) {
       return res
         .status(200)
killedBy: Event Controller getAttendeesByEID should return timeline attendees successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining [ObjectContaining {"attendees": [{"userId": "u1"}], "timeline": ObjectContaining {"_id": "t1"}}]
Received: {"attendees": [], "message": "No attendees recorded yet."}

Number of calls: 1

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:196:15
     if (!attendeesByTimeline || attendeesByTimeline.length === 0) {
       return res
         .status(200)
-        .json({ message: "No attendees recorded yet.", attendees: [] });
+        .json({});
     }
 
killedBy: Event Controller getAttendeesByEID should handle no attendees found (empty timeline results)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "attendees": Array [],
-   "message": "No attendees recorded yet.",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:200:19
     }
 
     res.status(200).json(attendeesByTimeline);
-  } catch (error) {
-    console.error("Error fetching timeline-wise attendees:", error);
-    res.status(500).json({
-      message: "Server error while fetching attendees.",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller getAttendeesByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching timeline-wise attendees:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:201:19
 
     res.status(200).json(attendeesByTimeline);
   } catch (error) {
-    console.error("Error fetching timeline-wise attendees:", error);
+    console.error("", error);
     res.status(500).json({
       message: "Server error while fetching attendees.",
killedBy: Event Controller getAttendeesByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching timeline-wise attendees:", Any<Error>
Received: "", [Error: Boom]

Number of calls: 1

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:203:16
   } catch (error) {
     console.error("Error fetching timeline-wise attendees:", error);
     res.status(500).json({
-      message: "Server error while fetching attendees.",
+      message: "",
       error: error.message,
     });
killedBy: Event Controller getAttendeesByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Boom",
-   "message": "Server error while fetching attendees.",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:210:7
 };
 
 export const getReviewRatingsByEID = async (req, res) => {
-  try {
-    const { eventId } = req.params;
-
-    const eventData = await Event.findById(eventId)
-      .select("ratings")
-      .populate({
-        path: "ratings",
-        populate: {
-          path: "by",
-          select: "profile.name profile.profilePic",
-        },
-      })
-      .lean();
-
-    if (!eventData) {
-      return res.status(404).json({ message: "Event not found." });
-    }
-
-    res.status(200).json(eventData.ratings || []);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching ratings and reviews:", error);
     res.status(500).json({
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "evt1"

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:217:19
       .select("ratings")
       .populate({
         path: "ratings",
-        populate: {
-          path: "by",
-          select: "profile.name profile.profilePic",
-        },
+        populate: {},
       })
       .lean();
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": "ratings",
-   "populate": Object {

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:218:17
       .populate({
         path: "ratings",
         populate: {
-          path: "by",
+          path: "",
           select: "profile.name profile.profilePic",
         },
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": "ratings",
    "populate": Object {

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:224:21
       })
       .lean();
 
-    if (!eventData) {
-      return res.status(404).json({ message: "Event not found." });
-    }
+    if (!eventData) {}
 
     res.status(200).json(eventData.ratings || []);
killedBy: Event Controller getReviewRatingsByEID should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received
       1: 200
       2: 500

Number of calls: 2

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:224:9
       })
       .lean();
 
-    if (!eventData) {
+    if (eventData) {
       return res.status(404).json({ message: "Event not found." });
     }
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:228:26
       return res.status(404).json({ message: "Event not found." });
     }
 
-    res.status(200).json(eventData.ratings || []);
+    res.status(200).json(false);
   } catch (error) {
     console.error("Error fetching ratings and reviews:", error);
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{"stars": 5}]
Received: false

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:228:26
       return res.status(404).json({ message: "Event not found." });
     }
 
-    res.status(200).json(eventData.ratings || []);
+    res.status(200).json(true);
   } catch (error) {
     console.error("Error fetching ratings and reviews:", error);
killedBy: Event Controller getReviewRatingsByEID should return ratings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{"stars": 5}]
Received: true

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:229:19
     }
 
     res.status(200).json(eventData.ratings || []);
-  } catch (error) {
-    console.error("Error fetching ratings and reviews:", error);
-    res.status(500).json({
-      message: "Server error while fetching ratings and reviews.",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller getReviewRatingsByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching ratings and reviews:", Any<Error>

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:231:26
     res.status(200).json(eventData.ratings || []);
   } catch (error) {
     console.error("Error fetching ratings and reviews:", error);
-    res.status(500).json({
-      message: "Server error while fetching ratings and reviews.",
-      error: error.message,
-    });
+    res.status(500).json({});
   }
 };
killedBy: Event Controller getReviewRatingsByEID should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Err",
-   "message": "Server error while fetching ratings and reviews.",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:238:54
   }
 };
 
-export const getOrganizerTeams = async (req, res) => {
-  try {
-    const organizerId = req.user.id;
-
-    const teams = await Team.find({
-      $or: [{ leader: organizerId }, { "members.user": organizerId }],
-    })
-      .select("name leader members")
-      .populate("leader", "profile.name email college")
-      .populate("members.user", "profile.name email")
-      .lean();
-
-    if (!teams || teams.length === 0) {
-      return res.status(200).json([]);
-    }
-
-    res.status(200).json(teams);
-  } catch (error) {
-    console.error("Error fetching organizer teams:", error);
-    res.status(500).json({
-      message: "Server error while fetching organizer teams.",
-      error: error.message,
-    });
-  }
-};
+export const getOrganizerTeams = async (req, res) => {};
 
 export const addAnnouncement = async (req, res) => {
killedBy: Event Controller getOrganizerTeams should return teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.user": "user123"}]}

Number of calls: 0

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:239:7
 };
 
 export const getOrganizerTeams = async (req, res) => {
-  try {
-    const organizerId = req.user.id;
-
-    const teams = await Team.find({
-      $or: [{ leader: organizerId }, { "members.user": organizerId }],
-    })
-      .select("name leader members")
-      .populate("leader", "profile.name email college")
-      .populate("members.user", "profile.name email")
-      .lean();
-
-    if (!teams || teams.length === 0) {
-      return res.status(200).json([]);
-    }
-
-    res.status(200).json(teams);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching organizer teams:", error);
     res.status(500).json({
killedBy: Event Controller getOrganizerTeams should return teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"$or": [{"leader": "user123"}, {"members.user": "user123"}]}

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:250:9
       .populate("members.user", "profile.name email")
       .lean();
 
-    if (!teams || teams.length === 0) {
+    if (false) {
       return res.status(200).json([]);
     }
killedBy: Event Controller getOrganizerTeams should return empty array if teams is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []
Received: null

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:250:39
       .populate("members.user", "profile.name email")
       .lean();
 
-    if (!teams || teams.length === 0) {
-      return res.status(200).json([]);
-    }
+    if (!teams || teams.length === 0) {}
 
     res.status(200).json(teams);
killedBy: Event Controller getOrganizerTeams should return empty array if teams is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: []
Received: null

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:255:19
     }
 
     res.status(200).json(teams);
-  } catch (error) {
-    console.error("Error fetching organizer teams:", error);
-    res.status(500).json({
-      message: "Server error while fetching organizer teams.",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller getOrganizerTeams should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching organizer teams:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:256:19
 
     res.status(200).json(teams);
   } catch (error) {
-    console.error("Error fetching organizer teams:", error);
+    console.error("", error);
     res.status(500).json({
       message: "Server error while fetching organizer teams.",
killedBy: Event Controller getOrganizerTeams should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching organizer teams:", Any<Error>
Received: "", [Error: Err]

Number of calls: 1

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:268:9
   try {
     const { eventId } = req.params;
     const { message, title, date, time } = req.body;
-    if (!message) {
+    if (message) {
       return res
         .status(400)
killedBy: Event Controller addAnnouncement should validation error if message missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:268:9
   try {
     const { eventId } = req.params;
     const { message, title, date, time } = req.body;
-    if (!message) {
+    if (false) {
       return res
         .status(400)
killedBy: Event Controller addAnnouncement should validation error if message missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:275:14
     }
 
     const newAnnouncement = {
-      title: title || "Update",
+      title: true,
       message: message,
       date: date || new Date(),
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "evt1",
  Object {
    "$push": Object {

[Killed] LogicalOperator
controllers/organizer_controllers/organizer.dashboard.controller.js:275:14
     }
 
     const newAnnouncement = {
-      title: title || "Update",
+      title: title && "Update",
       message: message,
       date: date || new Date(),
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "evt1",
  Object {
    "$push": Object {

[Survived] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:277:13
     const newAnnouncement = {
       title: title || "Update",
       message: message,
-      date: date || new Date(),
+      date: false,
       time: time,
       author: req.user.id,

[Survived] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:277:13
     const newAnnouncement = {
       title: title || "Update",
       message: message,
-      date: date || new Date(),
+      date: true,
       time: time,
       author: req.user.id,

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:285:35
     const updatedEvent = await Event.findByIdAndUpdate(
       eventId,
       { $push: { announcements: newAnnouncement } },
-      { new: true, runValidators: true }
+      { new: true, runValidators: false }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "evt1",
  {"$push": {"announcements": {"author": "user123", "date": "2023-01-01", "message": "Msg", "time": "10:00", "title": "T"}}},
  Object {

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:285:14
     const updatedEvent = await Event.findByIdAndUpdate(
       eventId,
       { $push: { announcements: newAnnouncement } },
-      { new: true, runValidators: true }
+      { new: false, runValidators: true }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "evt1",
  {"$push": {"announcements": {"author": "user123", "date": "2023-01-01", "message": "Msg", "time": "10:00", "title": "T"}}},
  Object {

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:286:87
       eventId,
       { $push: { announcements: newAnnouncement } },
       { new: true, runValidators: true }
-    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
+    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: "" });
 
     if (!updatedEvent) {
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "announcements.author", "select": "profile.name email _id"}
Received
       2
          Object {
            "path": "announcements.author",

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:286:47
       eventId,
       { $push: { announcements: newAnnouncement } },
       { new: true, runValidators: true }
-    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
+    ).populate(populateEventDetails).populate({});
 
     if (!updatedEvent) {
killedBy: Event Controller addAnnouncement should add announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "announcements.author", "select": "profile.name email _id"}
Received
       2
        - Object {
        -   "path": "announcements.author",

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:288:9
       { new: true, runValidators: true }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
-    if (!updatedEvent) {
+    if (false) {
       return res.status(404).json({ message: "Event not found." });
     }
killedBy: Event Controller addAnnouncement should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 201

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:288:24
       { new: true, runValidators: true }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
-    if (!updatedEvent) {
-      return res.status(404).json({ message: "Event not found." });
-    }
+    if (!updatedEvent) {}
 
     res.status(201).json({
killedBy: Event Controller addAnnouncement should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 201

Number of calls: 1

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:289:35
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
     if (!updatedEvent) {
-      return res.status(404).json({ message: "Event not found." });
+      return res.status(404).json({});
     }
 
killedBy: Event Controller addAnnouncement should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Event not found.",
- }

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:296:19
       message: "Announcement added successfully.",
       event: updatedEvent,
     });
-  } catch (error) {
-    console.error("Error adding announcement:", error);
-    console.error("Mongoose Error Name:", error.name);
-    console.error("Mongoose Error Message:", error.message);
-    console.error("Mongoose Error Details (if validation):", error.errors);
-    res
-      .status(500)
-      .json({
-        message: "Server error while adding announcement.",
-        error: error.message,
-      });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller addAnnouncement should handle errors with all console logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error adding announcement:", [ValidationError: Err]

Number of calls: 0

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:315:9
     const { eventId, announcementId } = req.params;
     const { message, title, date, time } = req.body;
 
-    if (!message) {
+    if (false) {
       return res
         .status(400)
killedBy: Event Controller editAnnouncement should return 400 if message is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:315:19
     const { eventId, announcementId } = req.params;
     const { message, title, date, time } = req.body;
 
-    if (!message) {
-      return res
-        .status(400)
-        .json({ message: "Announcement message is required." });
-    }
+    if (!message) {}
 
     const updatePath = `announcements.$[elem]`;
killedBy: Event Controller editAnnouncement should return 400 if message is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:327:25
       eventId,
       {
         $set: {
-          [updatePath]: {
-            title: title,
-            message: message,
-            date: date,
-            time: time,
-            author: req.user.id,
-          },
+          [updatePath]: {},
         },
       },
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "e1",
  Object {
    "$set": Object {

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:336:7
           },
         },
       },
-      {
-        new: true,
-        runValidators: true,
-        arrayFilters: [{ "elem._id": announcementId }],
-      }
+      {}
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "e1",
  {"$set": {"announcements.$[elem]": {"author": "user123", "date": "D", "message": "M", "time": "Tm", "title": "T"}}},
- Object {

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:337:14
         },
       },
       {
-        new: true,
+        new: false,
         runValidators: true,
         arrayFilters: [{ "elem._id": announcementId }],
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "e1",
  {"$set": {"announcements.$[elem]": {"author": "user123", "date": "D", "message": "M", "time": "Tm", "title": "T"}}},
@@ -2,8 +2,8 @@

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:338:24
       },
       {
         new: true,
-        runValidators: true,
+        runValidators: false,
         arrayFilters: [{ "elem._id": announcementId }],
       }
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "e1",
  {"$set": {"announcements.$[elem]": {"author": "user123", "date": "D", "message": "M", "time": "Tm", "title": "T"}}},
@@ -3,7 +3,7 @@

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:343:9
       }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
-    if (!updatedEvent) {
+    if (updatedEvent) {
       return res
         .status(404)
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:346:15
     if (!updatedEvent) {
       return res
         .status(404)
-        .json({ message: "Event or Announcement not found." });
+        .json({});
     }
 
killedBy: Event Controller editAnnouncement should return 404 if event/announcement not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Event or Announcement not found.",
- }

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:349:26
         .json({ message: "Event or Announcement not found." });
     }
 
-    res.status(200).json({
-      message: "Announcement updated successfully.",
-      event: updatedEvent,
-    });
+    res.status(200).json({});
   } catch (error) {
     console.error("Error editing announcement:", error);
killedBy: Event Controller editAnnouncement should edit announcement successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "event": Object {
-     "_id": "e1",
