[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:353:19
       message: "Announcement updated successfully.",
       event: updatedEvent,
     });
-  } catch (error) {
-    console.error("Error editing announcement:", error);
-    res
-      .status(500)
-      .json({
-        message: "Server error while editing announcement.",
-        error: error.message,
-      });
-  }
+  } catch (error) {}
 };
 
killedBy: Event Controller editAnnouncement should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error editing announcement:", Any<Error>

Number of calls: 0

[Killed] ObjectLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:357:13
     console.error("Error editing announcement:", error);
     res
       .status(500)
-      .json({
-        message: "Server error while editing announcement.",
-        error: error.message,
-      });
+      .json({});
   }
 };
killedBy: Event Controller editAnnouncement should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Err",
-   "message": "Server error while editing announcement.",

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:358:18
     res
       .status(500)
       .json({
-        message: "Server error while editing announcement.",
+        message: "",
         error: error.message,
       });
killedBy: Event Controller editAnnouncement should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Err",
-   "message": "Server error while editing announcement.",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:365:7
 };
 
 export const deleteAnnouncement = async (req, res) => {
-  try {
-    const { eventId, announcementId } = req.params;
-
-    const updatedEvent = await Event.findByIdAndUpdate(
-      eventId,
-      {
-        $pull: {
-          announcements: { _id: announcementId },
-        },
-      },
-      { new: true }
-    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
-
-    if (!updatedEvent) {
-      return res.status(404).json({ message: "Event not found." });
-    }
-
-    res.status(200).json({
-      message: "Announcement deleted successfully.",
-      event: updatedEvent,
-    });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error deleting announcement:", error);
     res
killedBy: Event Controller deleteAnnouncement should delete announcement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "e1", {"$pull": {"announcements": {"_id": "a1"}}}, {"new": true}

Number of calls: 0

[Killed] BooleanLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:375:14
           announcements: { _id: announcementId },
         },
       },
-      { new: true }
+      { new: false }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
killedBy: Event Controller deleteAnnouncement should delete announcement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "e1",
  {"$pull": {"announcements": {"_id": "a1"}}},
  Object {

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:376:55
         },
       },
       { new: true }
-    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
+    ).populate(populateEventDetails).populate({ path: "", select: 'profile.name email _id' });
 
     if (!updatedEvent) {
killedBy: Event Controller deleteAnnouncement should delete announcement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "announcements.author", "select": "profile.name email _id"}
Received
       2
          Object {
        -   "path": "announcements.author",

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:376:87
         },
       },
       { new: true }
-    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
+    ).populate(populateEventDetails).populate({ path: 'announcements.author', select: "" });
 
     if (!updatedEvent) {
killedBy: Event Controller deleteAnnouncement should delete announcement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": "announcements.author", "select": "profile.name email _id"}
Received
       2
          Object {
            "path": "announcements.author",

[Killed] ConditionalExpression
controllers/organizer_controllers/organizer.dashboard.controller.js:378:9
       { new: true }
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
-    if (!updatedEvent) {
+    if (true) {
       return res.status(404).json({ message: "Event not found." });
     }
killedBy: Event Controller deleteAnnouncement should delete announcement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:379:46
     ).populate(populateEventDetails).populate({ path: 'announcements.author', select: 'profile.name email _id' });
 
     if (!updatedEvent) {
-      return res.status(404).json({ message: "Event not found." });
+      return res.status(404).json({ message: "" });
     }
 
killedBy: Event Controller deleteAnnouncement should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Event not found.",
+   "message": "",

[Killed] BlockStatement
controllers/organizer_controllers/organizer.dashboard.controller.js:386:19
       message: "Announcement deleted successfully.",
       event: updatedEvent,
     });
-  } catch (error) {
-    console.error("Error deleting announcement:", error);
-    res
-      .status(500)
-      .json({
-        message: "Server error while deleting announcement.",
-        error: error.message,
-      });
-  }
+  } catch (error) {}
 };
killedBy: Event Controller deleteAnnouncement should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error deleting announcement:", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/organizer_controllers/organizer.dashboard.controller.js:387:19
       event: updatedEvent,
     });
   } catch (error) {
-    console.error("Error deleting announcement:", error);
+    console.error("", error);
     res
       .status(500)
killedBy: Event Controller deleteAnnouncement should handle errors with correct message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error deleting announcement:", Any<Error>
Received: "", [Error: Err]

Number of calls: 1
