[Killed] BlockStatement
controllers/profile.controller.js:4:55
 import User from "../models/user.model.js";
 import mongoose from "mongoose";
 
-export const getUserProfileById = async (req, res) => {
-  try {
-    const { id } = req.params;
-    if (!mongoose.Types.ObjectId.isValid(id)) {
-      return res.status(400).json({ success: false, message: 'Invalid user ID' });
-    }
-
-    // Select only the fields that are safe to be public
-    const user = await User.findById(id).select('profile role email sponsorDetails college').populate('college', 'name');
-
-    if (!user) {
-      return res.status(404).json({ success: false, message: 'User not found' });
-    }
-
-    res.status(200).json({ success: true, user });
-  } catch (err) {
-    console.error('Error fetching user profile by ID:', err);
-    res.status(500).json({ success: false, message: 'Server error', error: err.message });
-  }
-};
+export const getUserProfileById = async (req, res) => {};
 
 
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "invalid-id"

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:5:7
 import mongoose from "mongoose";
 
 export const getUserProfileById = async (req, res) => {
-  try {
-    const { id } = req.params;
-    if (!mongoose.Types.ObjectId.isValid(id)) {
-      return res.status(400).json({ success: false, message: 'Invalid user ID' });
-    }
-
-    // Select only the fields that are safe to be public
-    const user = await User.findById(id).select('profile role email sponsorDetails college').populate('college', 'name');
-
-    if (!user) {
-      return res.status(404).json({ success: false, message: 'User not found' });
-    }
-
-    res.status(200).json({ success: true, user });
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error fetching user profile by ID:', err);
     res.status(500).json({ success: false, message: 'Server error', error: err.message });
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "invalid-id"

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:7:47
 export const getUserProfileById = async (req, res) => {
   try {
     const { id } = req.params;
-    if (!mongoose.Types.ObjectId.isValid(id)) {
-      return res.status(400).json({ success: false, message: 'Invalid user ID' });
-    }
+    if (!mongoose.Types.ObjectId.isValid(id)) {}
 
     // Select only the fields that are safe to be public
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/profile.controller.js:7:9
 export const getUserProfileById = async (req, res) => {
   try {
     const { id } = req.params;
-    if (!mongoose.Types.ObjectId.isValid(id)) {
+    if (mongoose.Types.ObjectId.isValid(id)) {
       return res.status(400).json({ success: false, message: 'Invalid user ID' });
     }
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/profile.controller.js:8:46
   try {
     const { id } = req.params;
     if (!mongoose.Types.ObjectId.isValid(id)) {
-      return res.status(400).json({ success: false, message: 'Invalid user ID' });
+      return res.status(400).json({ success: true, message: 'Invalid user ID' });
     }
 
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid user ID",
-   "success": false,

[Killed] ObjectLiteral
controllers/profile.controller.js:8:35
   try {
     const { id } = req.params;
     if (!mongoose.Types.ObjectId.isValid(id)) {
-      return res.status(400).json({ success: false, message: 'Invalid user ID' });
+      return res.status(400).json({});
     }
 
killedBy: Profile Controller getUserProfileById should return 400 if user ID is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid user ID",
-   "success": false,

[Killed] StringLiteral
controllers/profile.controller.js:15:62
     const user = await User.findById(id).select('profile role email sponsorDetails college').populate('college', 'name');
 
     if (!user) {
-      return res.status(404).json({ success: false, message: 'User not found' });
+      return res.status(404).json({ success: false, message: "" });
     }
 
killedBy: Profile Controller getUserProfileById should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "User not found",
+   "message": "",

[Killed] BooleanLiteral
controllers/profile.controller.js:18:37
       return res.status(404).json({ success: false, message: 'User not found' });
     }
 
-    res.status(200).json({ success: true, user });
+    res.status(200).json({ success: false, user });
   } catch (err) {
     console.error('Error fetching user profile by ID:', err);
killedBy: Profile Controller getUserProfileById should return user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "success": true,

[Killed] ObjectLiteral
controllers/profile.controller.js:18:26
       return res.status(404).json({ success: false, message: 'User not found' });
     }
 
-    res.status(200).json({ success: true, user });
+    res.status(200).json({});
   } catch (err) {
     console.error('Error fetching user profile by ID:', err);
killedBy: Profile Controller getUserProfileById should return user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "success": true,
-   "user": Object {

[Killed] BlockStatement
controllers/profile.controller.js:19:17
     }
 
     res.status(200).json({ success: true, user });
-  } catch (err) {
-    console.error('Error fetching user profile by ID:', err);
-    res.status(500).json({ success: false, message: 'Server error', error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: Profile Controller getUserProfileById should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/profile.controller.js:21:37
     res.status(200).json({ success: true, user });
   } catch (err) {
     console.error('Error fetching user profile by ID:', err);
-    res.status(500).json({ success: false, message: 'Server error', error: err.message });
+    res.status(500).json({ success: true, message: 'Server error', error: err.message });
   }
 };
killedBy: Profile Controller getUserProfileById should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database error",
    "message": "Server error",

[Killed] BlockStatement
controllers/profile.controller.js:26:51
 };
 
 
-export const getUserProfile = async (req, res) => {
-  try {
-    const userId = req.user?.id;
-    const user = await User.findById(userId); 
-    if (!user) {
-      return res.status(404).json({ error: "User not found" });
-    }
-    
-    const userObject = user.toObject();
-    userObject.id = userObject._id;
-    delete userObject._id;
-    delete userObject.passwordHash;
-    delete userObject.__v;
-
-    return res.status(200).json(userObject || {});
-  } catch (error) {
-    console.error("getUserProfile error", error);
-    return res.status(500).json({ error: "Failed to fetch profile" });
-  }
-};
+export const getUserProfile = async (req, res) => {};
 
 export const updateUserProfile = async (req, res) => {
killedBy: Profile Controller getUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user123"

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:27:7
 
 
 export const getUserProfile = async (req, res) => {
-  try {
-    const userId = req.user?.id;
-    const user = await User.findById(userId); 
-    if (!user) {
-      return res.status(404).json({ error: "User not found" });
-    }
-    
-    const userObject = user.toObject();
-    userObject.id = userObject._id;
-    delete userObject._id;
-    delete userObject.passwordHash;
-    delete userObject.__v;
-
-    return res.status(200).json(userObject || {});
-  } catch (error) {
+  try {} catch (error) {
     console.error("getUserProfile error", error);
     return res.status(500).json({ error: "Failed to fetch profile" });
killedBy: Profile Controller getUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user123"

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:30:16
   try {
     const userId = req.user?.id;
     const user = await User.findById(userId); 
-    if (!user) {
-      return res.status(404).json({ error: "User not found" });
-    }
+    if (!user) {}
     
     const userObject = user.toObject();
killedBy: Profile Controller getUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/profile.controller.js:30:9
   try {
     const userId = req.user?.id;
     const user = await User.findById(userId); 
-    if (!user) {
+    if (false) {
       return res.status(404).json({ error: "User not found" });
     }
killedBy: Profile Controller getUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
controllers/profile.controller.js:31:35
     const userId = req.user?.id;
     const user = await User.findById(userId); 
     if (!user) {
-      return res.status(404).json({ error: "User not found" });
+      return res.status(404).json({});
     }
     
killedBy: Profile Controller getUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "User not found",
- }

[Killed] ConditionalExpression
controllers/profile.controller.js:40:33
     delete userObject.passwordHash;
     delete userObject.__v;
 
-    return res.status(200).json(userObject || {});
+    return res.status(200).json(false);
   } catch (error) {
     console.error("getUserProfile error", error);
killedBy: Profile Controller getUserProfile should return user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"email": "test@test.com", "id": "user123", "profile": {"name": "Test User"}, "role": "student"}
Received: false

Number of calls: 1

[Killed] ConditionalExpression
controllers/profile.controller.js:40:33
     delete userObject.passwordHash;
     delete userObject.__v;
 
-    return res.status(200).json(userObject || {});
+    return res.status(200).json(true);
   } catch (error) {
     console.error("getUserProfile error", error);
killedBy: Profile Controller getUserProfile should return user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"email": "test@test.com", "id": "user123", "profile": {"name": "Test User"}, "role": "student"}
Received: true

Number of calls: 1

[Killed] BlockStatement
controllers/profile.controller.js:41:19
     delete userObject.__v;
 
     return res.status(200).json(userObject || {});
-  } catch (error) {
-    console.error("getUserProfile error", error);
-    return res.status(500).json({ error: "Failed to fetch profile" });
-  }
+  } catch (error) {}
 };
 
killedBy: Profile Controller getUserProfile should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ConditionalExpression
controllers/profile.controller.js:50:50
 export const updateUserProfile = async (req, res) => {
   try {
     const userId = req.user?.id;
-    const { sponsorDetails, ...profileFields } = req.body || {};
+    const { sponsorDetails, ...profileFields } = true;
 
     // Create a dynamic $set object to merge fields
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
-   "$set": Object {

[Killed] LogicalOperator
controllers/profile.controller.js:50:50
 export const updateUserProfile = async (req, res) => {
   try {
     const userId = req.user?.id;
-    const { sponsorDetails, ...profileFields } = req.body || {};
+    const { sponsorDetails, ...profileFields } = req.body && {};
 
     // Create a dynamic $set object to merge fields
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
-   "$set": Object {

[Killed] BlockStatement
controllers/profile.controller.js:56:38
     const updateFields = {};
 
     // Merge top-level profile fields
-    for (const key in profileFields) {
-      if (Object.prototype.hasOwnProperty.call(profileFields, key)) {
-        updateFields[`profile.${key}`] = profileFields[key];
-      }
-    }
+    for (const key in profileFields) {}
 
     // Merge sponsorDetails fields if they exist
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
-   "$set": Object {

[Killed] ConditionalExpression
controllers/profile.controller.js:57:11
 
     // Merge top-level profile fields
     for (const key in profileFields) {
-      if (Object.prototype.hasOwnProperty.call(profileFields, key)) {
+      if (false) {
         updateFields[`profile.${key}`] = profileFields[key];
       }
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
-   "$set": Object {

[Killed] BlockStatement
controllers/profile.controller.js:57:69
 
     // Merge top-level profile fields
     for (const key in profileFields) {
-      if (Object.prototype.hasOwnProperty.call(profileFields, key)) {
-        updateFields[`profile.${key}`] = profileFields[key];
-      }
+      if (Object.prototype.hasOwnProperty.call(profileFields, key)) {}
     }
 
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
-   "$set": Object {

[Killed] ConditionalExpression
controllers/profile.controller.js:63:9
     }
 
     // Merge sponsorDetails fields if they exist
-    if (sponsorDetails && typeof sponsorDetails === 'object') {
+    if (true) {
       for (const key in sponsorDetails) {
         if (Object.prototype.hasOwnProperty.call(sponsorDetails, key)) {
killedBy: Profile Controller updateUserProfile should handle non-object sponsorDetails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
    "$set": Object {

[Killed] EqualityOperator
controllers/profile.controller.js:63:27
     }
 
     // Merge sponsorDetails fields if they exist
-    if (sponsorDetails && typeof sponsorDetails === 'object') {
+    if (sponsorDetails && typeof sponsorDetails !== 'object') {
       for (const key in sponsorDetails) {
         if (Object.prototype.hasOwnProperty.call(sponsorDetails, key)) {
killedBy: Profile Controller updateUserProfile should update user profile with sponsorDetails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "sponsor123",
  Object {
    "$set": Object {

[Killed] BlockStatement
controllers/profile.controller.js:64:41
 
     // Merge sponsorDetails fields if they exist
     if (sponsorDetails && typeof sponsorDetails === 'object') {
-      for (const key in sponsorDetails) {
-        if (Object.prototype.hasOwnProperty.call(sponsorDetails, key)) {
-          updateFields[`sponsorDetails.${key}`] = sponsorDetails[key];
-        }
-      }
+      for (const key in sponsorDetails) {}
     }
     const updatedUser = await User.findByIdAndUpdate(
killedBy: Profile Controller updateUserProfile should update user profile with sponsorDetails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "sponsor123",
  Object {
    "$set": Object {

[Killed] ConditionalExpression
controllers/profile.controller.js:65:13
     // Merge sponsorDetails fields if they exist
     if (sponsorDetails && typeof sponsorDetails === 'object') {
       for (const key in sponsorDetails) {
-        if (Object.prototype.hasOwnProperty.call(sponsorDetails, key)) {
+        if (true) {
           updateFields[`sponsorDetails.${key}`] = sponsorDetails[key];
         }
killedBy: Profile Controller updateUserProfile should use Object.prototype.hasOwnProperty for sponsorDetails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  Object {
    "$set": Object {

[Killed] ConditionalExpression
controllers/profile.controller.js:65:13
     // Merge sponsorDetails fields if they exist
     if (sponsorDetails && typeof sponsorDetails === 'object') {
       for (const key in sponsorDetails) {
-        if (Object.prototype.hasOwnProperty.call(sponsorDetails, key)) {
+        if (false) {
           updateFields[`sponsorDetails.${key}`] = sponsorDetails[key];
         }
killedBy: Profile Controller updateUserProfile should update user profile with sponsorDetails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "sponsor123",
  Object {
    "$set": Object {

[Killed] BooleanLiteral
controllers/profile.controller.js:73:35
     const updatedUser = await User.findByIdAndUpdate(
       userId,
       { $set: updateFields },
-      { new: true, runValidators: true }
+      { new: true, runValidators: false }
     ); 
 
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  {"$set": {"profile.name": "New Name"}},
  Object {

[Killed] BooleanLiteral
controllers/profile.controller.js:73:14
     const updatedUser = await User.findByIdAndUpdate(
       userId,
       { $set: updateFields },
-      { new: true, runValidators: true }
+      { new: false, runValidators: true }
     ); 
 
killedBy: Profile Controller updateUserProfile should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user123",
  {"$set": {"profile.name": "New Name"}},
  Object {

[Killed] BlockStatement
controllers/profile.controller.js:88:19
     delete userObject.__v;
 
     return res.status(200).json(userObject || {});
-  } catch (error) {
-    console.error("updateUserProfile error", error);
-    return res.status(500).json({ error: "Failed to update profile" });
-  }
+  } catch (error) {}
 };
 
killedBy: Profile Controller updateUserProfile should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:90:42
     return res.status(200).json(userObject || {});
   } catch (error) {
     console.error("updateUserProfile error", error);
-    return res.status(500).json({ error: "Failed to update profile" });
+    return res.status(500).json({ error: "" });
   }
 };
killedBy: Profile Controller updateUserProfile should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to update profile",
+   "error": "",

[Killed] BlockStatement
controllers/profile.controller.js:95:36
 };
 
 // --- Helper function to clean user objects for lists ---
-const cleanUserForList = (user) => {
-  const userObject = user.toObject();
-  userObject.id = userObject._id;
-  delete userObject._id;
-  delete userObject.passwordHash;
-  delete userObject.__v;
-  return userObject;
-};
+const cleanUserForList = (user) => {};
 
 export const getAllStudents = async (req, res) => {
killedBy: Profile Controller getAllStudents should return all students successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/profile.controller.js:104:51
   return userObject;
 };
 
-export const getAllStudents = async (req, res) => {
-  try {
-    const students = await User.find({ role: 'student' });
-    const cleanedStudents = students.map(cleanUserForList);
-    return res.status(200).json(cleanedStudents);
-  } catch (error) {
-    console.error("getAllStudents error", error);
-    return res.status(500).json({ error: "Failed to fetch students" });
-  }
-};
+export const getAllStudents = async (req, res) => {};
 
 export const getAllOrganizers = async (req, res) => {
killedBy: Profile Controller getAllStudents should return all students successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "student"}

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:105:7
 };
 
 export const getAllStudents = async (req, res) => {
-  try {
-    const students = await User.find({ role: 'student' });
-    const cleanedStudents = students.map(cleanUserForList);
-    return res.status(200).json(cleanedStudents);
-  } catch (error) {
+  try {} catch (error) {
     console.error("getAllStudents error", error);
     return res.status(500).json({ error: "Failed to fetch students" });
killedBy: Profile Controller getAllStudents should return all students successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "student"}

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:106:46
 
 export const getAllStudents = async (req, res) => {
   try {
-    const students = await User.find({ role: 'student' });
+    const students = await User.find({ role: "" });
     const cleanedStudents = students.map(cleanUserForList);
     return res.status(200).json(cleanedStudents);
killedBy: Profile Controller getAllStudents should return all students successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "role": "student",
+   "role": "",

[Killed] BlockStatement
controllers/profile.controller.js:109:19
     const students = await User.find({ role: 'student' });
     const cleanedStudents = students.map(cleanUserForList);
     return res.status(200).json(cleanedStudents);
-  } catch (error) {
-    console.error("getAllStudents error", error);
-    return res.status(500).json({ error: "Failed to fetch students" });
-  }
+  } catch (error) {}
 };
 
killedBy: Profile Controller getAllStudents should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/profile.controller.js:111:33
     return res.status(200).json(cleanedStudents);
   } catch (error) {
     console.error("getAllStudents error", error);
-    return res.status(500).json({ error: "Failed to fetch students" });
+    return res.status(500).json({});
   }
 };
killedBy: Profile Controller getAllStudents should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Failed to fetch students",
- }

[Killed] BlockStatement
controllers/profile.controller.js:115:53
   }
 };
 
-export const getAllOrganizers = async (req, res) => {
-  try {
-    const organizers = await User.find({ role: 'organizer' });
-    const cleanedOrganizers = organizers.map(cleanUserForList);
-    return res.status(200).json(cleanedOrganizers);
-  } catch (error) {
-    console.error("getAllOrganizers error", error);
-    return res.status(500).json({ error: "Failed to fetch organizers" });
-  }
-};
+export const getAllOrganizers = async (req, res) => {};
 
 export const getAllSponsors = async (req, res) => {
killedBy: Profile Controller getAllOrganizers should return all organizers successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "organizer"}

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:116:7
 };
 
 export const getAllOrganizers = async (req, res) => {
-  try {
-    const organizers = await User.find({ role: 'organizer' });
-    const cleanedOrganizers = organizers.map(cleanUserForList);
-    return res.status(200).json(cleanedOrganizers);
-  } catch (error) {
+  try {} catch (error) {
     console.error("getAllOrganizers error", error);
     return res.status(500).json({ error: "Failed to fetch organizers" });
killedBy: Profile Controller getAllOrganizers should return all organizers successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "organizer"}

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:117:48
 
 export const getAllOrganizers = async (req, res) => {
   try {
-    const organizers = await User.find({ role: 'organizer' });
+    const organizers = await User.find({ role: "" });
     const cleanedOrganizers = organizers.map(cleanUserForList);
     return res.status(200).json(cleanedOrganizers);
killedBy: Profile Controller getAllOrganizers should return all organizers successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "role": "organizer",
+   "role": "",

[Killed] ObjectLiteral
controllers/profile.controller.js:117:40
 
 export const getAllOrganizers = async (req, res) => {
   try {
-    const organizers = await User.find({ role: 'organizer' });
+    const organizers = await User.find({});
     const cleanedOrganizers = organizers.map(cleanUserForList);
     return res.status(200).json(cleanedOrganizers);
killedBy: Profile Controller getAllOrganizers should return all organizers successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "role": "organizer",
- }

[Killed] BlockStatement
controllers/profile.controller.js:120:19
     const organizers = await User.find({ role: 'organizer' });
     const cleanedOrganizers = organizers.map(cleanUserForList);
     return res.status(200).json(cleanedOrganizers);
-  } catch (error) {
-    console.error("getAllOrganizers error", error);
-    return res.status(500).json({ error: "Failed to fetch organizers" });
-  }
+  } catch (error) {}
 };
 
killedBy: Profile Controller getAllOrganizers should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:121:19
     const cleanedOrganizers = organizers.map(cleanUserForList);
     return res.status(200).json(cleanedOrganizers);
   } catch (error) {
-    console.error("getAllOrganizers error", error);
+    console.error("", error);
     return res.status(500).json({ error: "Failed to fetch organizers" });
   }
killedBy: Profile Controller getAllOrganizers should handle synchronous error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "getAllOrganizers error", Any<Error>
Received: "", [Error: Sync error]

Number of calls: 1

[Killed] BlockStatement
controllers/profile.controller.js:126:51
   }
 };
 
-export const getAllSponsors = async (req, res) => {
-  try {
-    const sponsors = await User.find({ role: 'sponsor' });
-    const cleanedSponsors = sponsors.map(cleanUserForList);
-    return res.status(200).json(cleanedSponsors);
-  } catch (error) {
-    console.error("getAllSponsors error", error);
-    return res.status(500).json({ error: "Failed to fetch sponsors" });
-  }
-};
+export const getAllSponsors = async (req, res) => {};
 
 export const getAllAdmins = async (req, res) => {
killedBy: Profile Controller getAllSponsors should return all sponsors successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "sponsor"}

Number of calls: 0
