[Killed] BlockStatement
controllers/profile.controller.js:127:7
 };
 
 export const getAllSponsors = async (req, res) => {
-  try {
-    const sponsors = await User.find({ role: 'sponsor' });
-    const cleanedSponsors = sponsors.map(cleanUserForList);
-    return res.status(200).json(cleanedSponsors);
-  } catch (error) {
+  try {} catch (error) {
     console.error("getAllSponsors error", error);
     return res.status(500).json({ error: "Failed to fetch sponsors" });
killedBy: Profile Controller getAllSponsors should return all sponsors successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "sponsor"}

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:131:19
     const sponsors = await User.find({ role: 'sponsor' });
     const cleanedSponsors = sponsors.map(cleanUserForList);
     return res.status(200).json(cleanedSponsors);
-  } catch (error) {
-    console.error("getAllSponsors error", error);
-    return res.status(500).json({ error: "Failed to fetch sponsors" });
-  }
+  } catch (error) {}
 };
 
killedBy: Profile Controller getAllSponsors should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:133:42
     return res.status(200).json(cleanedSponsors);
   } catch (error) {
     console.error("getAllSponsors error", error);
-    return res.status(500).json({ error: "Failed to fetch sponsors" });
+    return res.status(500).json({ error: "" });
   }
 };
killedBy: Profile Controller getAllSponsors should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to fetch sponsors",
+   "error": "",

[Killed] BlockStatement
controllers/profile.controller.js:137:49
   }
 };
 
-export const getAllAdmins = async (req, res) => {
-  try {
-    const admins = await User.find({ role: 'admin' });
-    // ✅ FIX: Use .map() to properly convert Mongoose docs to clean objects
-    const cleanedAdmins = admins.map(cleanUserForList);
-    return res.status(200).json(cleanedAdmins);
-  } catch (error) {
-    console.error("getAllAdmins error", error);
-    return res.status(500).json({ error: "Failed to fetch admins" });
-  }
-};
+export const getAllAdmins = async (req, res) => {};
killedBy: Profile Controller getAllAdmins should return all admins successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "admin"}

Number of calls: 0

[Killed] BlockStatement
controllers/profile.controller.js:138:7
 };
 
 export const getAllAdmins = async (req, res) => {
-  try {
-    const admins = await User.find({ role: 'admin' });
-    // ✅ FIX: Use .map() to properly convert Mongoose docs to clean objects
-    const cleanedAdmins = admins.map(cleanUserForList);
-    return res.status(200).json(cleanedAdmins);
-  } catch (error) {
+  try {} catch (error) {
     console.error("getAllAdmins error", error);
     return res.status(500).json({ error: "Failed to fetch admins" });
killedBy: Profile Controller getAllAdmins should return all admins successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"role": "admin"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/profile.controller.js:139:36
 
 export const getAllAdmins = async (req, res) => {
   try {
-    const admins = await User.find({ role: 'admin' });
+    const admins = await User.find({});
     // ✅ FIX: Use .map() to properly convert Mongoose docs to clean objects
     const cleanedAdmins = admins.map(cleanUserForList);
killedBy: Profile Controller getAllAdmins should return all admins successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "role": "admin",
- }

[Killed] BlockStatement
controllers/profile.controller.js:143:19
     // ✅ FIX: Use .map() to properly convert Mongoose docs to clean objects
     const cleanedAdmins = admins.map(cleanUserForList);
     return res.status(200).json(cleanedAdmins);
-  } catch (error) {
-    console.error("getAllAdmins error", error);
-    return res.status(500).json({ error: "Failed to fetch admins" });
-  }
+  } catch (error) {}
 };
killedBy: Profile Controller getAllAdmins should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] StringLiteral
controllers/profile.controller.js:145:42
     return res.status(200).json(cleanedAdmins);
   } catch (error) {
     console.error("getAllAdmins error", error);
-    return res.status(500).json({ error: "Failed to fetch admins" });
+    return res.status(500).json({ error: "" });
   }
 };
killedBy: Profile Controller getAllAdmins should handle database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Failed to fetch admins",
+   "error": "",
