[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:8:81
 import StudentTeam from "../../models/studentTeam.model.js";
 import Team from "../../models/organizerTeam.model.js";
 
-const notify = async ({ type, from, to, eventId, title, description, role }) => {
-  try {
-    await InboxEntity.create({
-      type,
-      from,
-      to,
-      relatedEvent: eventId,
-      title,
-      description,
-      status: "Pending",
-      role,
-    });
-  } catch (err) {
-    console.error("❌ Failed to create inbox notification:", err.message);
-  }
-};
+const notify = async ({ type, from, to, eventId, title, description, role }) => {};
 
 // ✅ Fetch registration form config
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:9:7
 import Team from "../../models/organizerTeam.model.js";
 
 const notify = async ({ type, from, to, eventId, title, description, role }) => {
-  try {
-    await InboxEntity.create({
-      type,
-      from,
-      to,
-      relatedEvent: eventId,
-      title,
-      description,
-      status: "Pending",
-      role,
-    });
-  } catch (err) {
+  try {} catch (err) {
     console.error("❌ Failed to create inbox notification:", err.message);
   }
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:20:17
       status: "Pending",
       role,
     });
-  } catch (err) {
-    console.error("❌ Failed to create inbox notification:", err.message);
-  }
+  } catch (err) {}
 };
 
killedBy: submitRegistration Controller should catch error in notify function silently
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:26:56
 };
 
 // ✅ Fetch registration form config
-export const getRegistrationForm = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("title config");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({
-      success: true,
-      eventTitle: event.title,
-      registrationConfig: event.config || {},
-    });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch registration form", error: error.message });
-  }
-};
+export const getRegistrationForm = async (req, res) => {};
 
 
killedBy: getRegistrationForm Controller should return 200 and event config when event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "event123"

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:27:7
 
 // ✅ Fetch registration form config
 export const getRegistrationForm = async (req, res) => {
-  try {
-    const event = await Event.findById(req.params.eventId).select("title config");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
-
-    res.status(200).json({
-      success: true,
-      eventTitle: event.title,
-      registrationConfig: event.config || {},
-    });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ success: false, message: "Failed to fetch registration form", error: error.message });
   }
killedBy: getRegistrationForm Controller should return 200 and event config when event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "event123"

Number of calls: 0

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:28:67
 // ✅ Fetch registration form config
 export const getRegistrationForm = async (req, res) => {
   try {
-    const event = await Event.findById(req.params.eventId).select("title config");
+    const event = await Event.findById(req.params.eventId).select("");
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:29:56
 export const getRegistrationForm = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("title config");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (!event) return res.status(404).json({ success: true, message: "Event not found" });
 
     res.status(200).json({
killedBy: getRegistrationForm Controller should return 404 if event is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Event not found",
-   "success": false,

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:29:9
 export const getRegistrationForm = async (req, res) => {
   try {
     const event = await Event.findById(req.params.eventId).select("title config");
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (true) return res.status(404).json({ success: false, message: "Event not found" });
 
     res.status(200).json({
killedBy: getRegistrationForm Controller should return 200 and event config when event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:34:27
     res.status(200).json({
       success: true,
       eventTitle: event.title,
-      registrationConfig: event.config || {},
+      registrationConfig: true,
     });
   } catch (error) {
killedBy: getRegistrationForm Controller should return 200 and event config when event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "eventTitle": "Hackathon",
-   "registrationConfig": Object {

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:34:27
     res.status(200).json({
       success: true,
       eventTitle: event.title,
-      registrationConfig: event.config || {},
+      registrationConfig: false,
     });
   } catch (error) {
killedBy: getRegistrationForm Controller should return 200 and event config when event exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "eventTitle": "Hackathon",
-   "registrationConfig": Object {

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:36:19
       eventTitle: event.title,
       registrationConfig: event.config || {},
     });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch registration form", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: getRegistrationForm Controller should return 500 if database fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:37:37
       registrationConfig: event.config || {},
     });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to fetch registration form", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to fetch registration form", error: error.message });
   }
 };
killedBy: getRegistrationForm Controller should return 500 if database fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "DB Error",
    "message": "Failed to fetch registration form",

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:47:9
     const { eventId, teamName, paymentProof, registrationData } = req.body;
     const event = await Event.findById(eventId);
     console.log("body", req.body);
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (false) return res.status(404).json({ success: false, message: "Event not found" });
 
     let teamId = null;
killedBy: submitRegistration Controller should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:47:9
     const { eventId, teamName, paymentProof, registrationData } = req.body;
     const event = await Event.findById(eventId);
     console.log("body", req.body);
-    if (!event) return res.status(404).json({ success: false, message: "Event not found" });
+    if (event) return res.status(404).json({ success: false, message: "Event not found" });
 
     let teamId = null;
killedBy: submitRegistration Controller should return 404 if event not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:50:53
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     let teamId = null;
-    if (event.config.registrationType === 'Team' && !teamName) {
+    if (event.config.registrationType === 'Team' && teamName) {
       return res.status(400).json({ success: false, message: "Team name is required for this event." });
     }
killedBy: submitRegistration Controller should return 400 if Team event but no teamName provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:50:9
     if (!event) return res.status(404).json({ success: false, message: "Event not found" });
 
     let teamId = null;
-    if (event.config.registrationType === 'Team' && !teamName) {
+    if (true) {
       return res.status(400).json({ success: false, message: "Team name is required for this event." });
     }
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 400

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:51:46
 
     let teamId = null;
     if (event.config.registrationType === 'Team' && !teamName) {
-      return res.status(400).json({ success: false, message: "Team name is required for this event." });
+      return res.status(400).json({ success: true, message: "Team name is required for this event." });
     }
     if (event.config.registrationType === 'Team' && teamName) {
killedBy: submitRegistration Controller should return 400 if Team event but no teamName provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Team name is required for this event.",
-   "success": false,

[Killed] StringLiteral
controllers/event_controllers/registration.controller.js:51:62
 
     let teamId = null;
     if (event.config.registrationType === 'Team' && !teamName) {
-      return res.status(400).json({ success: false, message: "Team name is required for this event." });
+      return res.status(400).json({ success: false, message: "" });
     }
     if (event.config.registrationType === 'Team' && teamName) {
killedBy: submitRegistration Controller should return 400 if Team event but no teamName provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Team name is required for this event.",
+   "message": "",

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:53:63
     if (event.config.registrationType === 'Team' && !teamName) {
       return res.status(400).json({ success: false, message: "Team name is required for this event." });
     }
-    if (event.config.registrationType === 'Team' && teamName) {
-      const team = await StudentTeam.findById(teamName);
-      if (!team) {
-        console.log("Team not found");
-        return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
-      }
-      teamId = team._id;
-    }
+    if (event.config.registrationType === 'Team' && teamName) {}
 
     if (teamId) {
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:53:9
     if (event.config.registrationType === 'Team' && !teamName) {
       return res.status(400).json({ success: false, message: "Team name is required for this event." });
     }
-    if (event.config.registrationType === 'Team' && teamName) {
+    if (false) {
       const team = await StudentTeam.findById(teamName);
       if (!team) {
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:55:11
     }
     if (event.config.registrationType === 'Team' && teamName) {
       const team = await StudentTeam.findById(teamName);
-      if (!team) {
+      if (true) {
         console.log("Team not found");
         return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
killedBy: submitRegistration Controller should return 400 if a team member is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:55:18
     }
     if (event.config.registrationType === 'Team' && teamName) {
       const team = await StudentTeam.findById(teamName);
-      if (!team) {
-        console.log("Team not found");
-        return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
-      }
+      if (!team) {}
       teamId = team._id;
     }
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:56:21
     if (event.config.registrationType === 'Team' && teamName) {
       const team = await StudentTeam.findById(teamName);
       if (!team) {
-        console.log("Team not found");
+        console.log("");
         return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
       }

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:57:48
       const team = await StudentTeam.findById(teamName);
       if (!team) {
         console.log("Team not found");
-        return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
+        return res.status(404).json({ success: true, message: `Team with name "${teamName}" not found.` });
       }
       teamId = team._id;
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Team with name \"SuperStars\" not found.",
-   "success": false,

[Killed] ObjectLiteral
controllers/event_controllers/registration.controller.js:57:37
       const team = await StudentTeam.findById(teamName);
       if (!team) {
         console.log("Team not found");
-        return res.status(404).json({ success: false, message: `Team with name "${teamName}" not found.` });
+        return res.status(404).json({});
       }
       teamId = team._id;
killedBy: submitRegistration Controller should return 404 if Team event but Team not found in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Team with name \"SuperStars\" not found.",
-   "success": false,

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:62:9
       teamId = team._id;
     }
 
-    if (teamId) {
+    if (false) {
       const team = await StudentTeam.findById(teamId).lean();
       const memberIds = team.members.map(m => m.member);
killedBy: submitRegistration Controller should return 400 if a team member is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "A member of your team is already registered for this event.",
+   "message": "You are already registered for this event.",

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:62:9
       teamId = team._id;
     }
 
-    if (teamId) {
+    if (true) {
       const team = await StudentTeam.findById(teamId).lean();
       const memberIds = team.members.map(m => m.member);
killedBy: submitRegistration Controller should return 400 if individual user is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "You are already registered for this event.",
+   "message": "A member of your team is already registered for this event.",

[Survived] ArrowFunction
controllers/event_controllers/registration.controller.js:64:42
 
     if (teamId) {
       const team = await StudentTeam.findById(teamId).lean();
-      const memberIds = team.members.map(m => m.member);
+      const memberIds = team.members.map(() => undefined);
       memberIds.push(team.leader);
 

[Survived] ObjectLiteral
controllers/event_controllers/registration.controller.js:67:82
       const memberIds = team.members.map(m => m.member);
       memberIds.push(team.leader);
 
-      const existingRegistration = await Registration.findOne({ eventId, userId: { $in: memberIds } });
+      const existingRegistration = await Registration.findOne({ eventId, userId: {} });
       if (existingRegistration) {
         return res.status(400).json({ success: false, message: "A member of your team is already registered for this event." });

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:68:11
       memberIds.push(team.leader);
 
       const existingRegistration = await Registration.findOne({ eventId, userId: { $in: memberIds } });
-      if (existingRegistration) {
+      if (false) {
         return res.status(400).json({ success: false, message: "A member of your team is already registered for this event." });
       }
killedBy: submitRegistration Controller should return 400 if a team member is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:68:33
       memberIds.push(team.leader);
 
       const existingRegistration = await Registration.findOne({ eventId, userId: { $in: memberIds } });
-      if (existingRegistration) {
-        return res.status(400).json({ success: false, message: "A member of your team is already registered for this event." });
-      }
+      if (existingRegistration) {}
     } else {
       // Individual registration check
killedBy: submitRegistration Controller should return 400 if a team member is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:69:48
 
       const existingRegistration = await Registration.findOne({ eventId, userId: { $in: memberIds } });
       if (existingRegistration) {
-        return res.status(400).json({ success: false, message: "A member of your team is already registered for this event." });
+        return res.status(400).json({ success: true, message: "A member of your team is already registered for this event." });
       }
     } else {
killedBy: submitRegistration Controller should return 400 if a team member is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "A member of your team is already registered for this event.",
-   "success": false,

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:71:12
       if (existingRegistration) {
         return res.status(400).json({ success: false, message: "A member of your team is already registered for this event." });
       }
-    } else {
-      // Individual registration check
-      const existing = await Registration.findOne({ eventId, userId: req.user.id });
-      if (existing) return res.status(400).json({ success: false, message: "You are already registered for this event." });
-    }
+    } else {}
 
     const checkInCode = crypto.randomBytes(4).toString("hex").toUpperCase();
killedBy: submitRegistration Controller should return 400 if individual user is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] ObjectLiteral
controllers/event_controllers/registration.controller.js:73:51
       }
     } else {
       // Individual registration check
-      const existing = await Registration.findOne({ eventId, userId: req.user.id });
+      const existing = await Registration.findOne({});
       if (existing) return res.status(400).json({ success: false, message: "You are already registered for this event." });
     }

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:74:11
     } else {
       // Individual registration check
       const existing = await Registration.findOne({ eventId, userId: req.user.id });
-      if (existing) return res.status(400).json({ success: false, message: "You are already registered for this event." });
+      if (false) return res.status(400).json({ success: false, message: "You are already registered for this event." });
     }
 
killedBy: submitRegistration Controller should return 400 if individual user is already registered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:74:11
     } else {
       // Individual registration check
       const existing = await Registration.findOne({ eventId, userId: req.user.id });
-      if (existing) return res.status(400).json({ success: false, message: "You are already registered for this event." });
+      if (true) return res.status(400).json({ success: false, message: "You are already registered for this event." });
     }
 
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Survived] MethodExpression
controllers/event_controllers/registration.controller.js:77:25
       if (existing) return res.status(400).json({ success: false, message: "You are already registered for this event." });
     }
 
-    const checkInCode = crypto.randomBytes(4).toString("hex").toUpperCase();
+    const checkInCode = crypto.randomBytes(4).toString("hex").toLowerCase();
 
     const checkIns = (event.timeline || []).map((t) => ({

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:79:23
 
     const checkInCode = crypto.randomBytes(4).toString("hex").toUpperCase();
 
-    const checkIns = (event.timeline || []).map((t) => ({
+    const checkIns = (true).map((t) => ({
       timelineRef: t._id,
       checkedInAt: null,
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:79:23
 
     const checkInCode = crypto.randomBytes(4).toString("hex").toUpperCase();
 
-    const checkIns = (event.timeline || []).map((t) => ({
+    const checkIns = (false).map((t) => ({
       timelineRef: t._id,
       checkedInAt: null,
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:82:15
     const checkIns = (event.timeline || []).map((t) => ({
       timelineRef: t._id,
       checkedInAt: null,
-      status: "absent",
+      status: "",
     }));
 

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:85:25
       status: "absent",
     }));
 
-    let paymentStatus = "not_required";
+    let paymentStatus = "";
     let status = "confirmed";
 

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:89:9
     let status = "confirmed";
 
 
-    if (event.config?.fees > 0) {
+    if (false) {
       paymentStatus = "pending";
       status = "pending";
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Killed] EqualityOperator
controllers/event_controllers/registration.controller.js:89:9
     let status = "confirmed";
 
 
-    if (event.config?.fees > 0) {
+    if (event.config?.fees <= 0) {
       paymentStatus = "pending";
       status = "pending";
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:96:17
       // Find the organizer team to notify the leader and members
       const team = await Team.findById(event.createdBy).lean();
       let notificationRecipients = [];
-      if (team) {
-        notificationRecipients.push(team.leader);
-        team.members.forEach(member => notificationRecipients.push(member.member));
-      }
+      if (team) {}
       console.log("notificationRecipients", notificationRecipients);
       await notify({
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}
Received: {"description": "A new participant has registered and payment proof needs verification.·
 payment proof link: link", "from": "user1", "relatedEvent": "evt1", "role": "Organizer", "status": "Pending", "title":

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:96:11
       // Find the organizer team to notify the leader and members
       const team = await Team.findById(event.createdBy).lean();
       let notificationRecipients = [];
-      if (team) {
+      if (false) {
         notificationRecipients.push(team.leader);
         team.members.forEach(member => notificationRecipients.push(member.member));
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}
Received: {"description": "A new participant has registered and payment proof needs verification.·
 payment proof link: link", "from": "user1", "relatedEvent": "evt1", "role": "Organizer", "status": "Pending", "title":
