[Killed] ArrowFunction
controllers/event_controllers/registration.controller.js:98:30
       let notificationRecipients = [];
       if (team) {
         notificationRecipients.push(team.leader);
-        team.members.forEach(member => notificationRecipients.push(member.member));
+        team.members.forEach(() => undefined);
       }
       console.log("notificationRecipients", notificationRecipients);
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}
Received: {"description": "A new participant has registered and payment proof needs verification.·
 payment proof link: link", "from": "user1", "relatedEvent": "evt1", "role": "Organizer", "status": "Pending", "title":

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:100:19
         notificationRecipients.push(team.leader);
         team.members.forEach(member => notificationRecipients.push(member.member));
       }
-      console.log("notificationRecipients", notificationRecipients);
+      console.log("", notificationRecipients);
       await notify({
         type: "registration_approval_request",

[Killed] ObjectLiteral
controllers/event_controllers/registration.controller.js:101:20
         team.members.forEach(member => notificationRecipients.push(member.member));
       }
       console.log("notificationRecipients", notificationRecipients);
-      await notify({
-        type: "registration_approval_request",
-        from: req.user.id,
-        to: notificationRecipients, // organizer team or user
-        eventId,
-        title: `Registration approval required for ${event.title}`,
-        description: `A new participant has registered and payment proof needs verification. \n payment proof link: ${paymentProof}`,
-        role: "Organizer",
-      });
+      await notify({});
     }
   
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "Organizer", "to": ["orgLeader", "orgMem"], "type": "registration_approval_request"}
Received: {"description": undefined, "from": undefined, "relatedEvent": undefined, "role": undefined, "status": "Pending", "title": undefined, "to": undefined, "type": undefined}

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:125:70
       checkIns,
     });
 
-    if (event.config.fees === 0 || paymentStatus === "not_required") {
-      event.registrations.push(registration._id);
-      await event.save();
-      await notify({
-        type: "announcement",
-        from: event.createdBy,
-        to: [req.user.id],
-        eventId,
-        title: `Registration Successful for ${event.title}`,
-        description: `🎉 You have successfully registered for "${event.title}". Your check-in code is: ${checkInCode}`,
-      });
-    }
+    if (event.config.fees === 0 || paymentStatus === "not_required") {}
 
     res.status(201).json({
killedBy: submitRegistration Controller should handle FREE event: Confirmed status, Update Event, Notify User
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
controllers/event_controllers/registration.controller.js:125:36
       checkIns,
     });
 
-    if (event.config.fees === 0 || paymentStatus === "not_required") {
+    if (event.config.fees === 0 || paymentStatus !== "not_required") {
       event.registrations.push(registration._id);
       await event.save();
killedBy: submitRegistration Controller should handle PAID event: Pending status and Notify Organizer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 500

Number of calls: 1

[Killed] ArrayDeclaration
controllers/event_controllers/registration.controller.js:131:13
       await notify({
         type: "announcement",
         from: event.createdBy,
-        to: [req.user.id],
+        to: [],
         eventId,
         title: `Registration Successful for ${event.title}`,
killedBy: submitRegistration Controller should handle FREE event: Confirmed status, Update Event, Notify User
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"title": StringContaining "Registration Successful", "to": ["user1"], "type": "announcement"}
Received: {"description": "🎉 You have successfully registered for \"Free Event\". Your check-in code is: CODE123", "from": "creator1", "relatedEvent": "evt1", "role": undefined, "status": "Pending", "title": "Registrat

[Survived] StringLiteral
controllers/event_controllers/registration.controller.js:134:22
         to: [req.user.id],
         eventId,
         title: `Registration Successful for ${event.title}`,
-        description: `🎉 You have successfully registered for "${event.title}". Your check-in code is: ${checkInCode}`,
+        description: ``
       });
     }

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:143:19
       message: "Registration submitted successfully",
       registration,
     });
-  } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to submit registration", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: submitRegistration Controller should return 500 on generic server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:144:37
       registration,
     });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to submit registration", error: error.message });
+    res.status(500).json({ success: true, message: "Failed to submit registration", error: error.message });
   }
 };
killedBy: submitRegistration Controller should return 500 on generic server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Failed to submit registration", "success": false}
Received: {"error": "Fatal Error", "message": "Failed to submit registration", "success": true}

Number of calls: 1

[Killed] ObjectLiteral
controllers/event_controllers/registration.controller.js:144:26
       registration,
     });
   } catch (error) {
-    res.status(500).json({ success: false, message: "Failed to submit registration", error: error.message });
+    res.status(500).json({});
   }
 };
killedBy: submitRegistration Controller should return 500 on generic server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Failed to submit registration", "success": false}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:149:68
 };
 
 
-  export const getRegistrationStatusByEIDPID = async (req, res) => {
-    try {
-      const { eventId, participantId } = req.params;
-      const registration = await Registration.findOne({ eventId, userId: participantId });
-      if (!registration) return res.status(404).json({ success: false, message: "Registration not found" });
-
-      res.status(200).json({
-        success: true,
-        registrationStatus: registration.status,
-        paymentStatus: registration.paymentStatus,
-        checkIns: registration.checkIns,
-      });
-    } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to fetch registration status", error: error.message });
-    }
-  };
+  export const getRegistrationStatusByEIDPID = async (req, res) => {};
 
 
killedBy: getRegistrationStatusByEIDPID Controller should return 200 with status details if found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"eventId": "evt1", "userId": "user1"}

Number of calls: 0

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:150:9
 
 
   export const getRegistrationStatusByEIDPID = async (req, res) => {
-    try {
-      const { eventId, participantId } = req.params;
-      const registration = await Registration.findOne({ eventId, userId: participantId });
-      if (!registration) return res.status(404).json({ success: false, message: "Registration not found" });
-
-      res.status(200).json({
-        success: true,
-        registrationStatus: registration.status,
-        paymentStatus: registration.paymentStatus,
-        checkIns: registration.checkIns,
-      });
-    } catch (error) {
+    try {} catch (error) {
       res.status(500).json({ success: false, message: "Failed to fetch registration status", error: error.message });
     }
killedBy: getRegistrationStatusByEIDPID Controller should return 200 with status details if found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"eventId": "evt1", "userId": "user1"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/event_controllers/registration.controller.js:152:55
   export const getRegistrationStatusByEIDPID = async (req, res) => {
     try {
       const { eventId, participantId } = req.params;
-      const registration = await Registration.findOne({ eventId, userId: participantId });
+      const registration = await Registration.findOne({});
       if (!registration) return res.status(404).json({ success: false, message: "Registration not found" });
 
killedBy: getRegistrationStatusByEIDPID Controller should return 200 with status details if found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "eventId": "evt1",
-   "userId": "user1",

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:153:11
     try {
       const { eventId, participantId } = req.params;
       const registration = await Registration.findOne({ eventId, userId: participantId });
-      if (!registration) return res.status(404).json({ success: false, message: "Registration not found" });
+      if (false) return res.status(404).json({ success: false, message: "Registration not found" });
 
       res.status(200).json({
killedBy: getRegistrationStatusByEIDPID Controller should return 404 if registration not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received
       1: 200
       2: 500

Number of calls: 2

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:153:11
     try {
       const { eventId, participantId } = req.params;
       const registration = await Registration.findOne({ eventId, userId: participantId });
-      if (!registration) return res.status(404).json({ success: false, message: "Registration not found" });
+      if (true) return res.status(404).json({ success: false, message: "Registration not found" });
 
       res.status(200).json({
killedBy: getRegistrationStatusByEIDPID Controller should return 200 with status details if found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:161:21
         paymentStatus: registration.paymentStatus,
         checkIns: registration.checkIns,
       });
-    } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to fetch registration status", error: error.message });
-    }
+    } catch (error) {}
   };
 
killedBy: getRegistrationStatusByEIDPID Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:162:39
         checkIns: registration.checkIns,
       });
     } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to fetch registration status", error: error.message });
+      res.status(500).json({ success: true, message: "Failed to fetch registration status", error: error.message });
     }
   };
killedBy: getRegistrationStatusByEIDPID Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "DB Error",
    "message": "Failed to fetch registration status",

[Killed] StringLiteral
controllers/event_controllers/registration.controller.js:162:55
         checkIns: registration.checkIns,
       });
     } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to fetch registration status", error: error.message });
+      res.status(500).json({ success: false, message: "", error: error.message });
     }
   };
killedBy: getRegistrationStatusByEIDPID Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "DB Error",
-   "message": "Failed to fetch registration status",

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:167:50
   };
 
 
-  export const markCheckIn = async (req, res) => {
-    try {
-      const { checkInCode, timelineRef } = req.body;
-      const registration = await Registration.findOne({ checkInCode });
-      if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
-
-      const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
-      if (checkIn) {
-        checkIn.status = "present";
-        checkIn.checkedInAt = new Date();
-      } else {
-        // This case should ideally not happen if check-ins are pre-created on registration
-        // but as a fallback:
-        return res.status(404).json({ success: false, message: "Timeline event not found for this registration." });
-      }
-
-      await registration.save();
-      res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
-    } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
-    }
-  };
+  export const markCheckIn = async (req, res) => {};
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: "absent"

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:168:9
 
 
   export const markCheckIn = async (req, res) => {
-    try {
-      const { checkInCode, timelineRef } = req.body;
-      const registration = await Registration.findOne({ checkInCode });
-      if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
-
-      const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
-      if (checkIn) {
-        checkIn.status = "present";
-        checkIn.checkedInAt = new Date();
-      } else {
-        // This case should ideally not happen if check-ins are pre-created on registration
-        // but as a fallback:
-        return res.status(404).json({ success: false, message: "Timeline event not found for this registration." });
-      }
-
-      await registration.save();
-      res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
-    } catch (error) {
+    try {} catch (error) {
       res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
     }
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: "absent"

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:171:65
     try {
       const { checkInCode, timelineRef } = req.body;
       const registration = await Registration.findOne({ checkInCode });
-      if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
+      if (!registration) return res.status(404).json({ success: true, message: "Invalid check-in code" });
 
       const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
killedBy: markCheckIn Controller should return 404 if checkInCode is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid check-in code",
-   "success": false,

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:171:11
     try {
       const { checkInCode, timelineRef } = req.body;
       const registration = await Registration.findOne({ checkInCode });
-      if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
+      if (false) return res.status(404).json({ success: false, message: "Invalid check-in code" });
 
       const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
killedBy: markCheckIn Controller should return 404 if checkInCode is invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/event_controllers/registration.controller.js:173:55
       const registration = await Registration.findOne({ checkInCode });
       if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
 
-      const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
+      const checkIn = registration.checkIns.find(c => c.timelineRef.toString() !== timelineRef);
       if (checkIn) {
         checkIn.status = "present";
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: "absent"

[Killed] ArrowFunction
controllers/event_controllers/registration.controller.js:173:50
       const registration = await Registration.findOne({ checkInCode });
       if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
 
-      const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
+      const checkIn = registration.checkIns.find(() => undefined);
       if (checkIn) {
         checkIn.status = "present";
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: "absent"

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:174:11
       if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
 
       const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
-      if (checkIn) {
+      if (false) {
         checkIn.status = "present";
         checkIn.checkedInAt = new Date();
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: "absent"

[Killed] ConditionalExpression
controllers/event_controllers/registration.controller.js:174:11
       if (!registration) return res.status(404).json({ success: false, message: "Invalid check-in code" });
 
       const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
-      if (checkIn) {
+      if (true) {
         checkIn.status = "present";
         checkIn.checkedInAt = new Date();
killedBy: markCheckIn Controller should return 404 if timelineRef is not found in checkIns
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] StringLiteral
controllers/event_controllers/registration.controller.js:175:26
 
       const checkIn = registration.checkIns.find(c => c.timelineRef.toString() === timelineRef);
       if (checkIn) {
-        checkIn.status = "present";
+        checkIn.status = "";
         checkIn.checkedInAt = new Date();
       } else {
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "present"
Received: ""

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:177:14
       if (checkIn) {
         checkIn.status = "present";
         checkIn.checkedInAt = new Date();
-      } else {
-        // This case should ideally not happen if check-ins are pre-created on registration
-        // but as a fallback:
-        return res.status(404).json({ success: false, message: "Timeline event not found for this registration." });
-      }
+      } else {}
 
       await registration.save();
killedBy: markCheckIn Controller should return 404 if timelineRef is not found in checkIns
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:180:48
       } else {
         // This case should ideally not happen if check-ins are pre-created on registration
         // but as a fallback:
-        return res.status(404).json({ success: false, message: "Timeline event not found for this registration." });
+        return res.status(404).json({ success: true, message: "Timeline event not found for this registration." });
       }
 
killedBy: markCheckIn Controller should return 404 if timelineRef is not found in checkIns
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Timeline event not found for this registration.",
-   "success": false,

[Killed] StringLiteral
controllers/event_controllers/registration.controller.js:180:64
       } else {
         // This case should ideally not happen if check-ins are pre-created on registration
         // but as a fallback:
-        return res.status(404).json({ success: false, message: "Timeline event not found for this registration." });
+        return res.status(404).json({ success: false, message: "" });
       }
 
killedBy: markCheckIn Controller should return 404 if timelineRef is not found in checkIns
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Timeline event not found for this registration.",
+   "message": "",

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:184:39
       }
 
       await registration.save();
-      res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
+      res.status(200).json({ success: false, message: "Check-in marked successfully", registration });
     } catch (error) {
       res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,7 +8,7 @@
          "timelineRef": "tl_1",
        },

[Killed] StringLiteral
controllers/event_controllers/registration.controller.js:184:54
       }
 
       await registration.save();
-      res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
+      res.status(200).json({ success: true, message: "", registration });
     } catch (error) {
       res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
killedBy: markCheckIn Controller should return 200 and mark present if code and timeline match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "message": "Check-in marked successfully",

[Killed] BlockStatement
controllers/event_controllers/registration.controller.js:185:21
 
       await registration.save();
       res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
-    } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
-    }
+    } catch (error) {}
   };
killedBy: markCheckIn Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/event_controllers/registration.controller.js:186:39
       await registration.save();
       res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
     } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
+      res.status(500).json({ success: true, message: "Failed to mark check-in", error: error.message });
     }
   };
killedBy: markCheckIn Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "DB Error",
    "message": "Failed to mark check-in",

[Killed] ObjectLiteral
controllers/event_controllers/registration.controller.js:186:28
       await registration.save();
       res.status(200).json({ success: true, message: "Check-in marked successfully", registration });
     } catch (error) {
-      res.status(500).json({ success: false, message: "Failed to mark check-in", error: error.message });
+      res.status(500).json({});
     }
   };
killedBy: markCheckIn Controller should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "DB Error",
-   "message": "Failed to mark check-in",
