[Killed] ConditionalExpression
controllers/search.controller.js:7:9
 export const globalSearch = async (req, res) => {
   try {
     const { q } = req.query;
-    if (!q || q.trim() === '') {
+    if (false) {
       return res.status(400).json({ message: 'Search query is required.' });
     }
killedBy: Search Controller globalSearch should return 400 if query parameter q is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/search.controller.js:7:9
 export const globalSearch = async (req, res) => {
   try {
     const { q } = req.query;
-    if (!q || q.trim() === '') {
+    if (q || q.trim() === '') {
       return res.status(400).json({ message: 'Search query is required.' });
     }
killedBy: Search Controller globalSearch should return 400 if query parameter q is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] StringLiteral
controllers/search.controller.js:8:46
   try {
     const { q } = req.query;
     if (!q || q.trim() === '') {
-      return res.status(400).json({ message: 'Search query is required.' });
+      return res.status(400).json({ message: "" });
     }
 
killedBy: Search Controller globalSearch should return 400 if query parameter q is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Search query is required.",
+   "message": "",

[Killed] MethodExpression
controllers/search.controller.js:11:24
       return res.status(400).json({ message: 'Search query is required.' });
     }
 
-    const searchTerm = q.trim();
+    const searchTerm = q;
     const regex = new RegExp(searchTerm, 'i'); // Case-insensitive regex
 
killedBy: Search Controller globalSearch should trim whitespace from search query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "  test  "

[Killed] ArrayDeclaration
controllers/search.controller.js:18:14
     const [events, users] = await Promise.all([
       // Search Events
       Event.find({
-        $or: [
-          { title: regex },
-          { description: regex },
-          { categoryTags: regex }
-        ],
+        $or: [],
         status: 'published' // Only search published events
       }).select('title description posterUrl categoryTags timeline venue config').limit(10).lean(),
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "$or": Array [
-     Object {

[Killed] ObjectLiteral
controllers/search.controller.js:29:11
       // Search Users (students, organizers, sponsors)
       User.find({
         $or: [
-          { 'profile.name': regex },
+          {},
           { email: regex },
           { 'sponsorDetails.firmDescription': regex }
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "$or": Array [
+     Object {},

[Killed] ObjectLiteral
controllers/search.controller.js:30:11
       User.find({
         $or: [
           { 'profile.name': regex },
-          { email: regex },
+          {},
           { 'sponsorDetails.firmDescription': regex }
         ]
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "$or": Array [
      Object {

[Killed] ConditionalExpression
controllers/search.controller.js:37:40
     ]);
 
     // Separate users into different categories
-    const sponsors = users.filter(u => u.role === 'sponsor');
+    const sponsors = users.filter(u => true);
     const organizers = users.filter(u => u.role === 'organizer');
     const students = users.filter(u => u.role === 'student');
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -23,10 +23,26 @@
        "role": "organizer",
      },

[Killed] ConditionalExpression
controllers/search.controller.js:37:40
     ]);
 
     // Separate users into different categories
-    const sponsors = users.filter(u => u.role === 'sponsor');
+    const sponsors = users.filter(u => false);
     const organizers = users.filter(u => u.role === 'organizer');
     const students = users.filter(u => u.role === 'student');
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -21,21 +21,11 @@
          "name": "Org User",
        },

[Killed] EqualityOperator
controllers/search.controller.js:38:42
 
     // Separate users into different categories
     const sponsors = users.filter(u => u.role === 'sponsor');
-    const organizers = users.filter(u => u.role === 'organizer');
+    const organizers = users.filter(u => u.role !== 'organizer');
     const students = users.filter(u => u.role === 'student');
 
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,16 +13,25 @@
        "venue": "Place",
      },

[Killed] ConditionalExpression
controllers/search.controller.js:38:42
 
     // Separate users into different categories
     const sponsors = users.filter(u => u.role === 'sponsor');
-    const organizers = users.filter(u => u.role === 'organizer');
+    const organizers = users.filter(u => false);
     const students = users.filter(u => u.role === 'student');
 
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,20 +11,11 @@
        "timeline": Object {},
        "title": "Test Event",

[Killed] MethodExpression
controllers/search.controller.js:39:22
     // Separate users into different categories
     const sponsors = users.filter(u => u.role === 'sponsor');
     const organizers = users.filter(u => u.role === 'organizer');
-    const students = users.filter(u => u.role === 'student');
+    const students = users;
 
     res.status(200).json({
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -41,7 +41,24 @@
        "profile": Object {
          "name": "Test User",

[Killed] ArrowFunction
controllers/search.controller.js:39:35
     // Separate users into different categories
     const sponsors = users.filter(u => u.role === 'sponsor');
     const organizers = users.filter(u => u.role === 'organizer');
-    const students = users.filter(u => u.role === 'student');
+    const students = users.filter(() => undefined);
 
     res.status(200).json({
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -32,16 +32,7 @@
        },
        "role": "sponsor",

[Killed] ObjectLiteral
controllers/search.controller.js:41:26
     const organizers = users.filter(u => u.role === 'organizer');
     const students = users.filter(u => u.role === 'student');
 
-    res.status(200).json({
-      events,
-      sponsors,
-      organizers,
-      users: students, // Renaming for clarity on the frontend
-    });
+    res.status(200).json({});
 
   } catch (error) {
killedBy: Search Controller globalSearch should search events and users successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "events": Array [
-     Object {

[Killed] BlockStatement
controllers/search.controller.js:48:19
       users: students, // Renaming for clarity on the frontend
     });
 
-  } catch (error) {
-    console.error("Global search error:", error);
-    res.status(500).json({
-      message: "Server error during search.",
-      error: error.message,
-    });
-  }
+  } catch (error) {}
 };
killedBy: Search Controller globalSearch should handle database error from Event.find
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Global search error:", [Error: Event database error]

Number of calls: 0

[Killed] StringLiteral
controllers/search.controller.js:49:19
     });
 
   } catch (error) {
-    console.error("Global search error:", error);
+    console.error("", error);
     res.status(500).json({
       message: "Server error during search.",
killedBy: Search Controller globalSearch should handle database error from Event.find
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Global search error:", [Error: Event database error]
Received: "", [Error: Event database error]

Number of calls: 1
