[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:5:46
 import Event from "../../models/event.model.js"
 import StudentTeam from "../../models/studentTeam.model.js";
 
-const getStudentEventIds = async (userId) => {
-  // Find teams where the user is a leader or an approved member
-  const userTeams = await StudentTeam.find({
-    $or: [
-      { leader: userId },
-      { members: { $elemMatch: { member: userId, status: 'Approved' } } }
-    ]
-  }).select('_id');
-  const teamIds = userTeams.map(t => t._id);
-
-  // Find registrations for the user directly or for any of their teams
-  const registrations = await Registration.find({
-    $or: [
-      { userId: userId },
-      { teamName: { $in: teamIds } }
-    ]
-  }).select('eventId');
-
-  return registrations.map(r => r.eventId);
-};
+const getStudentEventIds = async (userId) => {};
 
 export const FetchTheListOfRegisteredEventsByPID = async ( req , res ) => {
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "_id": Object {
-     "$in": Array [

[Killed] ArrayDeclaration
controllers/student_controller/student.dashboard.controller.js:8:10
 const getStudentEventIds = async (userId) => {
   // Find teams where the user is a leader or an approved member
   const userTeams = await StudentTeam.find({
-    $or: [
-      { leader: userId },
-      { members: { $elemMatch: { member: userId, status: 'Approved' } } }
-    ]
+    $or: []
   }).select('_id');
   const teamIds = userTeams.map(t => t._id);
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:9:7
   // Find teams where the user is a leader or an approved member
   const userTeams = await StudentTeam.find({
     $or: [
-      { leader: userId },
+      {},
       { members: { $elemMatch: { member: userId, status: 'Approved' } } }
     ]
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "leader"
Received path: []

Expected value: "user123"
Received value: {}

[Killed] StringLiteral
controllers/student_controller/student.dashboard.controller.js:10:58
   const userTeams = await StudentTeam.find({
     $or: [
       { leader: userId },
-      { members: { $elemMatch: { member: userId, status: 'Approved' } } }
+      { members: { $elemMatch: { member: userId, status: "" } } }
     ]
   }).select('_id');
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "member": "user123",
-   "status": "Approved",

[Killed] ArrowFunction
controllers/student_controller/student.dashboard.controller.js:13:33
       { members: { $elemMatch: { member: userId, status: 'Approved' } } }
     ]
   }).select('_id');
-  const teamIds = userTeams.map(t => t._id);
+  const teamIds = userTeams.map(() => undefined);
 
   // Find registrations for the user directly or for any of their teams
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "teamName": Object {
      "$in": Array [

[Killed] ArrowFunction
controllers/student_controller/student.dashboard.controller.js:23:28
     ]
   }).select('eventId');
 
-  return registrations.map(r => r.eventId);
+  return registrations.map(() => undefined);
 };
 
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "_id": Object {
      "$in": Array [

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:26:75
   return registrations.map(r => r.eventId);
 };
 
-export const FetchTheListOfRegisteredEventsByPID = async ( req , res ) => {
-    try {
-        const userId = req.user.id;
-        const eventIds = await getStudentEventIds(userId);
-
-        const eventList = await Event.find({
-            _id: { $in: eventIds },
-            status: 'published'
-        }).lean();
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched registered events.",
-            count: eventList.length,
-            data: eventList
-        });
-    } catch (err) {
-        console.error(err);
-        return res.status(500).json({
-            success: false,
-            message: "Server error while fetching registered events.",
-            error: err.message
-        });
-    }
-};
+export const FetchTheListOfRegisteredEventsByPID = async ( req , res ) => {};
 
 export const FetchTheListOfCompletedEventsByPID = async ( req , res ) => {
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"$or": Any<Array>}

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:27:9
 };
 
 export const FetchTheListOfRegisteredEventsByPID = async ( req , res ) => {
-    try {
-        const userId = req.user.id;
-        const eventIds = await getStudentEventIds(userId);
-
-        const eventList = await Event.find({
-            _id: { $in: eventIds },
-            status: 'published'
-        }).lean();
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched registered events.",
-            count: eventList.length,
-            data: eventList
-        });
-    } catch (err) {
+    try {} catch (err) {
         console.error(err);
         return res.status(500).json({
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"$or": Any<Array>}

Number of calls: 0

[Killed] BooleanLiteral
controllers/student_controller/student.dashboard.controller.js:36:22
             status: 'published'
         }).lean();
         return res.status(200).json({
-            success: true,
+            success: false,
             message: "Successfully fetched registered events.",
             count: eventList.length,
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,7 +9,7 @@
        "_id": "event2",
        "title": "Workshop",

[Killed] StringLiteral
controllers/student_controller/student.dashboard.controller.js:37:22
         }).lean();
         return res.status(200).json({
             success: true,
-            message: "Successfully fetched registered events.",
+            message: "",
             count: eventList.length,
             data: eventList
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should successfully return a list of registered events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,8 +8,8 @@
      Object {
        "_id": "event2",

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:41:19
             count: eventList.length,
             data: eventList
         });
-    } catch (err) {
-        console.error(err);
-        return res.status(500).json({
-            success: false,
-            message: "Server error while fetching registered events.",
-            error: err.message
-        });
-    }
+    } catch (err) {}
 };
 
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should return 500 if an error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/student_controller/student.dashboard.controller.js:44:22
     } catch (err) {
         console.error(err);
         return res.status(500).json({
-            success: false,
+            success: true,
             message: "Server error while fetching registered events.",
             error: err.message
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should return 500 if an error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database failure",
    "message": "Server error while fetching registered events.",

[Killed] StringLiteral
controllers/student_controller/student.dashboard.controller.js:45:22
         console.error(err);
         return res.status(500).json({
             success: false,
-            message: "Server error while fetching registered events.",
+            message: "",
             error: err.message
         });
killedBy: Student Controller - FetchTheListOfRegisteredEventsByPID should return 500 if an error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Database failure",
-   "message": "Server error while fetching registered events.",

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:51:74
     }
 };
 
-export const FetchTheListOfCompletedEventsByPID = async ( req , res ) => {
-    try {
-        const userId = req.user.id;
-        const eventIds = await getStudentEventIds(userId);
-
-        const eventList = await Event.find({
-            _id: { $in: eventIds },
-            status: "completed"
-        }).lean();
-        
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched registered events.",
-            count: eventList.length,
-            data: eventList
-        });
-    } catch (err) {
-        console.error(err);
-        return res.status(500).json({
-            success: false,
-            message: "Server error while fetching registered events.",
-            error: err.message
-        });
-    }
-};
+export const FetchTheListOfCompletedEventsByPID = async ( req , res ) => {};
 
 export const GetTheTimeLineReminders = async(req , res) => {
killedBy: Student Controller - FetchTheListOfCompletedEventsByPID should successfully return a list of completed events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": {"$in": ["eventComp1"]}, "status": "completed"}

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:52:9
 };
 
 export const FetchTheListOfCompletedEventsByPID = async ( req , res ) => {
-    try {
-        const userId = req.user.id;
-        const eventIds = await getStudentEventIds(userId);
-
-        const eventList = await Event.find({
-            _id: { $in: eventIds },
-            status: "completed"
-        }).lean();
-        
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched registered events.",
-            count: eventList.length,
-            data: eventList
-        });
-    } catch (err) {
+    try {} catch (err) {
         console.error(err);
         return res.status(500).json({
killedBy: Student Controller - FetchTheListOfCompletedEventsByPID should successfully return a list of completed events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": {"$in": ["eventComp1"]}, "status": "completed"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:61:37
             status: "completed"
         }).lean();
         
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched registered events.",
-            count: eventList.length,
-            data: eventList
-        });
+        return res.status(200).json({});
     } catch (err) {
         console.error(err);
killedBy: Student Controller - FetchTheListOfCompletedEventsByPID should successfully return a list of completed events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "count": 1,
-   "data": Array [

[Survived] MethodExpression
controllers/student_controller/student.dashboard.controller.js:83:9
         const eventIds = await getStudentEventIds(userId);
 
         const today = new Date();
-        today.setHours(0, 0, 0, 0);
+        today.setMinutes(0, 0, 0, 0);
 
         const oneWeekFromNow = new Date(today);

[Survived] MethodExpression
controllers/student_controller/student.dashboard.controller.js:86:9
         today.setHours(0, 0, 0, 0);
 
         const oneWeekFromNow = new Date(today);
-        oneWeekFromNow.setDate(today.getDate() + 7);
+        oneWeekFromNow.setTime(today.getDate() + 7);
 
         const query = {

[Survived] ArithmeticOperator
controllers/student_controller/student.dashboard.controller.js:86:32
         today.setHours(0, 0, 0, 0);
 
         const oneWeekFromNow = new Date(today);
-        oneWeekFromNow.setDate(today.getDate() + 7);
+        oneWeekFromNow.setDate(today.getDate() - 7);
 
         const query = {

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:89:18
         oneWeekFromNow.setDate(today.getDate() + 7);
 
         const query = {
-            _id: { $in: eventIds },
+            _id: {},
             status: "published",
             
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"_id": {"$in": ["ev1"]}, "status": "published", "timeline": Any<Object>}
Received: {"_id": {}, "status": "published", "timeline": {"$elemMatch": {"$or": [{"date": {"$gte": 2025-11-27T18:30:00.000Z, "$lte": 2025-12-04T18:30:00.000Z}}, {"duration.from": {"$gte": 2025-11-27T18:30:00.000Z, "$lte": 2025-12-04T18:30:

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:93:29
             status: "published",
             
             timeline: {
-                $elemMatch: {
-                    $or: [
-                        { date: { $gte: today, $lte: oneWeekFromNow } },
-                        { "duration.from": { $gte: today, $lte: oneWeekFromNow } }
-                    ]
-                }
+                $elemMatch: {}
             }
         };
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "$or"
Received path: []

Received value: {}

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:96:44
                 $elemMatch: {
                     $or: [
                         { date: { $gte: today, $lte: oneWeekFromNow } },
-                        { "duration.from": { $gte: today, $lte: oneWeekFromNow } }
+                        { "duration.from": {} }
                     ]
                 }
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "$gte"
Received path: []

Received value: {}

[Killed] MethodExpression
controllers/student_controller/student.dashboard.controller.js:102:33
             }
         };
 
-        const eventList = await Event.find(query)
-            .select("title description posterUrl categoryTags timeline")
-            .sort({ publishedAt: -1 })
+        const eventList = await Event.find(query).select("title description posterUrl categoryTags timeline")
             .lean();
 
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"publishedAt": -1}

Number of calls: 0

[Killed] UnaryOperator
controllers/student_controller/student.dashboard.controller.js:104:34
 
         const eventList = await Event.find(query)
             .select("title description posterUrl categoryTags timeline")
-            .sort({ publishedAt: -1 })
+            .sort({ publishedAt: +1 })
             .lean();
 
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "publishedAt": -1,
+   "publishedAt": 1,

[Killed] EqualityOperator
controllers/student_controller/student.dashboard.controller.js:107:13
             .sort({ publishedAt: -1 })
             .lean();
 
-        if (eventList.length === 0) {
+        if (eventList.length !== 0) {
             return res.status(200).json({
                 success: true,
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 1,
-   "data": Array [

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:107:13
             .sort({ publishedAt: -1 })
             .lean();
 
-        if (eventList.length === 0) {
+        if (false) {
             return res.status(200).json({
                 success: true,
killedBy: Student Controller - GetTheTimeLineReminders should return a specific message if no upcoming events are found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 0,
    "data": Array [],

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:108:41
             .lean();
 
         if (eventList.length === 0) {
-            return res.status(200).json({
-                success: true,
-                message: "No upcoming events found for this week.",
-                count: 0,
-                data: []
-            });
+            return res.status(200).json({});
         }
         
killedBy: Student Controller - GetTheTimeLineReminders should return a specific message if no upcoming events are found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "count": 0,
-   "data": Array [],

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:116:37
             });
         }
         
-        return res.status(200).json({
-            success: true,
-            message: "Successfully fetched upcoming events.",
-            count: eventList.length,
-            data: eventList
-        });
+        return res.status(200).json({});
     } catch (err) {
         console.error(err);
killedBy: Student Controller - GetTheTimeLineReminders should return events when upcoming deadlines exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "count": 1,
-   "data": Array [

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:122:19
             count: eventList.length,
             data: eventList
         });
-    } catch (err) {
-        console.error(err);
-        return res.status(500).json({
-            success: false,
-            message: "Server error while fetching upcoming events.",
-            error: err.message
-        });
-    }
+    } catch (err) {}
 };
 
killedBy: Student Controller - GetTheTimeLineReminders should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:124:37
         });
     } catch (err) {
         console.error(err);
-        return res.status(500).json({
-            success: false,
-            message: "Server error while fetching upcoming events.",
-            error: err.message
-        });
+        return res.status(500).json({});
     }
 };
killedBy: Student Controller - GetTheTimeLineReminders should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Fail",
-   "message": "Server error while fetching upcoming events.",

[Killed] ObjectLiteral
controllers/student_controller/student.dashboard.controller.js:137:54
   try {
     const userId = req.user.id;
     const eventIds = await getStudentEventIds(userId);
-    const registeredEvents = await Event.find({ _id: { $in: eventIds }, status: 'published' }).select("title timeline").lean();
+    const registeredEvents = await Event.find({ _id: {}, status: 'published' }).select("title timeline").lean();
 
     const timeSlots = [];
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "_id": Object {
-     "$in": Array [

[Killed] StringLiteral
controllers/student_controller/student.dashboard.controller.js:137:81
   try {
     const userId = req.user.id;
     const eventIds = await getStudentEventIds(userId);
-    const registeredEvents = await Event.find({ _id: { $in: eventIds }, status: 'published' }).select("title timeline").lean();
+    const registeredEvents = await Event.find({ _id: { $in: eventIds }, status: "" }).select("title timeline").lean();
 
     const timeSlots = [];
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,7 +3,7 @@
      "$in": Array [
        "1",

[Survived] ArrayDeclaration
controllers/student_controller/student.dashboard.controller.js:139:23
     const eventIds = await getStudentEventIds(userId);
     const registeredEvents = await Event.find({ _id: { $in: eventIds }, status: 'published' }).select("title timeline").lean();
 
-    const timeSlots = [];
+    const timeSlots = ["Stryker was here"];
 
     registeredEvents.forEach((event) => {

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:141:41
 
     const timeSlots = [];
 
-    registeredEvents.forEach((event) => {
-
-      event.timeline.forEach((entry) => {
-        if (entry.duration && entry.duration.from && entry.duration.to) {
-          timeSlots.push({
-            eventId: event._id,
-            eventTitle: event.title,
-            timelineTitle: entry.title || "Event Period",
-            startTime: new Date(entry.duration.from),
-            endTime: new Date(entry.duration.to),
-          });
-        }
-      });
-    });
+    registeredEvents.forEach((event) => {});
 
     const clashes = [];
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:143:41
 
     registeredEvents.forEach((event) => {
 
-      event.timeline.forEach((entry) => {
-        if (entry.duration && entry.duration.from && entry.duration.to) {
-          timeSlots.push({
-            eventId: event._id,
-            eventTitle: event.title,
-            timelineTitle: entry.title || "Event Period",
-            startTime: new Date(entry.duration.from),
-            endTime: new Date(entry.duration.to),
-          });
-        }
-      });
+      event.timeline.forEach((entry) => {});
     });
 
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:144:73
     registeredEvents.forEach((event) => {
 
       event.timeline.forEach((entry) => {
-        if (entry.duration && entry.duration.from && entry.duration.to) {
-          timeSlots.push({
-            eventId: event._id,
-            eventTitle: event.title,
-            timelineTitle: entry.title || "Event Period",
-            startTime: new Date(entry.duration.from),
-            endTime: new Date(entry.duration.to),
-          });
-        }
+        if (entry.duration && entry.duration.from && entry.duration.to) {}
       });
     });
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] LogicalOperator
controllers/student_controller/student.dashboard.controller.js:144:13
     registeredEvents.forEach((event) => {
 
       event.timeline.forEach((entry) => {
-        if (entry.duration && entry.duration.from && entry.duration.to) {
+        if (entry.duration || entry.duration.from && entry.duration.to) {
           timeSlots.push({
             eventId: event._id,
killedBy: Student Controller - GetClashDetectionWarnings should handle timeline entries with missing duration (Edge case coverage)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No schedule clashes found in your registered events."}
Received: {"error": "Cannot read properties of undefined (reading 'from')", "message": "Server error while detecting schedule clashes.", "success": false}

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:148:28
           timeSlots.push({
             eventId: event._id,
             eventTitle: event.title,
-            timelineTitle: entry.title || "Event Period",
+            timelineTitle: false,
             startTime: new Date(entry.duration.from),
             endTime: new Date(entry.duration.to),
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Round 1"
Received: false

[Killed] LogicalOperator
controllers/student_controller/student.dashboard.controller.js:148:28
           timeSlots.push({
             eventId: event._id,
             eventTitle: event.title,
-            timelineTitle: entry.title || "Event Period",
+            timelineTitle: entry.title && "Event Period",
             startTime: new Date(entry.duration.from),
             endTime: new Date(entry.duration.to),
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Round 1"
Received: "Event Period"

[Killed] ArrayDeclaration
controllers/student_controller/student.dashboard.controller.js:156:21
       });
     });
 
-    const clashes = [];
+    const clashes = ["Stryker was here"];
 
     for (let i = 0; i < timeSlots.length; i++) {
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}

Number of calls: 1

[Killed] UpdateOperator
controllers/student_controller/student.dashboard.controller.js:158:43
 
     const clashes = [];
 
-    for (let i = 0; i < timeSlots.length; i++) {
+    for (let i = 0; i < timeSlots.length; i--) {
       const slotA = timeSlots[i];
 
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1
