[Killed] EqualityOperator
controllers/student_controller/student.dashboard.controller.js:158:21
 
     const clashes = [];
 
-    for (let i = 0; i < timeSlots.length; i++) {
+    for (let i = 0; i >= timeSlots.length; i++) {
       const slotA = timeSlots[i];
 
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] ArithmeticOperator
controllers/student_controller/student.dashboard.controller.js:161:20
     for (let i = 0; i < timeSlots.length; i++) {
       const slotA = timeSlots[i];
 
-      for (let j = i + 1; j < timeSlots.length; j++) {
+      for (let j = i - 1; j < timeSlots.length; j++) {
         const slotB = timeSlots[j];
 
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.dashboard.controller.js:161:27
     for (let i = 0; i < timeSlots.length; i++) {
       const slotA = timeSlots[i];
 
-      for (let j = i + 1; j < timeSlots.length; j++) {
+      for (let j = i + 1; j <= timeSlots.length; j++) {
         const slotB = timeSlots[j];
 
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.dashboard.controller.js:165:47
         const slotB = timeSlots[j];
 
         const isOverlap =
-          slotA.startTime <= slotB.endTime && slotB.startTime <= slotA.endTime;
+          slotA.startTime <= slotB.endTime && slotB.startTime > slotA.endTime;
 
         if (isOverlap && slotA.eventId.toString() !== slotB.eventId.toString()) {
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:165:47
         const slotB = timeSlots[j];
 
         const isOverlap =
-          slotA.startTime <= slotB.endTime && slotB.startTime <= slotA.endTime;
+          slotA.startTime <= slotB.endTime && true;
 
         if (isOverlap && slotA.eventId.toString() !== slotB.eventId.toString()) {
killedBy: Student Controller - GetClashDetectionWarnings should return success message when no clashes exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 0,
-   "data": Array [],

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:167:13
         const isOverlap =
           slotA.startTime <= slotB.endTime && slotB.startTime <= slotA.endTime;
 
-        if (isOverlap && slotA.eventId.toString() !== slotB.eventId.toString()) {
+        if (false) {
           clashes.push({
             message: `CLASH DETECTED: Your event "${slotA.eventTitle}" (${slotA.timelineTitle}) conflicts with "${slotB.eventTitle}" (${slotB.timelineTitle}).`,
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:167:13
         const isOverlap =
           slotA.startTime <= slotB.endTime && slotB.startTime <= slotA.endTime;
 
-        if (isOverlap && slotA.eventId.toString() !== slotB.eventId.toString()) {
+        if (true) {
           clashes.push({
             message: `CLASH DETECTED: Your event "${slotA.eventTitle}" (${slotA.timelineTitle}) conflicts with "${slotB.eventTitle}" (${slotB.timelineTitle}).`,
killedBy: Student Controller - GetClashDetectionWarnings should return success message when no clashes exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 0,
-   "data": Array [],

[Killed] EqualityOperator
controllers/student_controller/student.dashboard.controller.js:187:9
       }
     }
 
-    if (clashes.length === 0) {
+    if (clashes.length !== 0) {
       return res.status(200).json({
         success: true,
killedBy: Student Controller - GetClashDetectionWarnings should return warnings when two events overlap
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ArrayContaining [ObjectContaining {"message": StringContaining "conflicts with"}], "message": StringContaining "1 schedule clash(es) detected", "success": true}
Received: {"count": 0, "data": [], "message": "No schedule clashes found in your registered events.", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.dashboard.controller.js:187:9
       }
     }
 
-    if (clashes.length === 0) {
+    if (false) {
       return res.status(200).json({
         success: true,
killedBy: Student Controller - GetClashDetectionWarnings should return success message when no clashes exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 0,
    "data": Array [],

[Killed] BlockStatement
controllers/student_controller/student.dashboard.controller.js:202:17
       count: clashes.length,
       data: clashes,
     });
-  } catch (err) {
-    console.error(err);
-    return res.status(500).json({
-      success: false,
-      message: "Server error while detecting schedule clashes.",
-      error: err.message,
-    });
-  }
+  } catch (err) {}
 };
killedBy: Student Controller - GetClashDetectionWarnings should return 500 on server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
