[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:11:9
     const { teamName, members } = req.body; // Expect members array with student IDs
     const leaderId = req.user.id;
 
-    if (!teamName?.trim()) {
+    if (false) {
       return res.status(400).json({ message: "Team name is required" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 400 if team name is missing or empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 201

Number of calls: 1

[Killed] MethodExpression
controllers/student_controller/student.team.controller.js:11:10
     const { teamName, members } = req.body; // Expect members array with student IDs
     const leaderId = req.user.id;
 
-    if (!teamName?.trim()) {
+    if (!teamName) {
       return res.status(400).json({ message: "Team name is required" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 400 if team name is missing or empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 201

Number of calls: 1

[Killed] ObjectLiteral
controllers/student_controller/student.team.controller.js:12:35
     const leaderId = req.user.id;
 
     if (!teamName?.trim()) {
-      return res.status(400).json({ message: "Team name is required" });
+      return res.status(400).json({});
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 400 if team name is missing or empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Team name is required",
- }

[Killed] StringLiteral
controllers/student_controller/student.team.controller.js:12:46
     const leaderId = req.user.id;
 
     if (!teamName?.trim()) {
-      return res.status(400).json({ message: "Team name is required" });
+      return res.status(400).json({ message: "" });
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 400 if team name is missing or empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Team name is required",
+   "message": "",

[Survived] MethodExpression
controllers/student_controller/student.team.controller.js:16:31
     }
 
     const existingTeam = await StudentTeam.findOne({
-      teamName: { $regex: `^${teamName.trim()}$`, $options: "i" },
+      teamName: { $regex: `^${teamName}$`, $options: "i" },
     });
     if (existingTeam) {

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:16:27
     }
 
     const existingTeam = await StudentTeam.findOne({
-      teamName: { $regex: `^${teamName.trim()}$`, $options: "i" },
+      teamName: { $regex: ``, $options: "i" },
     });
     if (existingTeam) {

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:18:23
     const existingTeam = await StudentTeam.findOne({
       teamName: { $regex: `^${teamName.trim()}$`, $options: "i" },
     });
-    if (existingTeam) {
-      return res.status(409).json({ message: "Team name already exists" });
-    }
+    if (existingTeam) {}
 
     const newTeam = new StudentTeam({ teamName: teamName.trim(), leader: leaderId, members: [] });
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 409 if team name already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:18:9
     const existingTeam = await StudentTeam.findOne({
       teamName: { $regex: `^${teamName.trim()}$`, $options: "i" },
     });
-    if (existingTeam) {
+    if (false) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 409 if team name already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Survived] MethodExpression
controllers/student_controller/student.team.controller.js:22:49
       return res.status(409).json({ message: "Team name already exists" });
     }
 
-    const newTeam = new StudentTeam({ teamName: teamName.trim(), leader: leaderId, members: [] });
+    const newTeam = new StudentTeam({ teamName: teamName, leader: leaderId, members: [] });
 
     // If members are provided, add them with "Pending" status and send invites

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:25:9
     const newTeam = new StudentTeam({ teamName: teamName.trim(), leader: leaderId, members: [] });
 
     // If members are provided, add them with "Pending" status and send invites
-    if (members && Array.isArray(members)) {
+    if (false) {
       for (const memberId of members) {
         // Add member to team with "Pending" status
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should create a team successfully with invitations (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:25:44
     const newTeam = new StudentTeam({ teamName: teamName.trim(), leader: leaderId, members: [] });
 
     // If members are provided, add them with "Pending" status and send invites
-    if (members && Array.isArray(members)) {
-      for (const memberId of members) {
-        // Add member to team with "Pending" status
-        newTeam.members.push({ member: memberId, status: "Pending" });
-
-        // Create an invitation in the inbox for the new member
-        await InboxEntity.create({
-          type: "team_invite",
-          title: `Invitation to join team: ${newTeam.teamName}`,
-          description: `You have been invited by ${req.user.name} to join the team "${newTeam.teamName}".`,
-          from: leaderId,
-          to: memberId,
-          status: "Pending",
-          relatedTeam: newTeam._id,
-          relatedTeamModel: "StudentTeam",
-        });
-      }
-    }
+    if (members && Array.isArray(members)) {}
 
     await newTeam.save();
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should create a team successfully with invitations (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:26:39
 
     // If members are provided, add them with "Pending" status and send invites
     if (members && Array.isArray(members)) {
-      for (const memberId of members) {
-        // Add member to team with "Pending" status
-        newTeam.members.push({ member: memberId, status: "Pending" });
-
-        // Create an invitation in the inbox for the new member
-        await InboxEntity.create({
-          type: "team_invite",
-          title: `Invitation to join team: ${newTeam.teamName}`,
-          description: `You have been invited by ${req.user.name} to join the team "${newTeam.teamName}".`,
-          from: leaderId,
-          to: memberId,
-          status: "Pending",
-          relatedTeam: newTeam._id,
-          relatedTeamModel: "StudentTeam",
-        });
-      }
+      for (const memberId of members) {}
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should create a team successfully with invitations (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:28:30
     if (members && Array.isArray(members)) {
       for (const memberId of members) {
         // Add member to team with "Pending" status
-        newTeam.members.push({ member: memberId, status: "Pending" });
+        newTeam.members.push({});
 
         // Create an invitation in the inbox for the new member

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:33:18
         // Create an invitation in the inbox for the new member
         await InboxEntity.create({
           type: "team_invite",
-          title: `Invitation to join team: ${newTeam.teamName}`,
+          title: ``,
           description: `You have been invited by ${req.user.name} to join the team "${newTeam.teamName}".`,
           from: leaderId,

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:48:17
 
     const populatedTeam = await StudentTeam.findById(newTeam._id)
       .populate('leader', 'profile.name email')
-      .populate('members.member', 'profile.name email')
+      .populate("", 'profile.name email')
       .lean();
 

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:51:37
       .populate('members.member', 'profile.name email')
       .lean();
 
-    res.status(201).json({ message: "Student team created and invites sent successfully", team: populatedTeam });
+    res.status(201).json({ message: "", team: populatedTeam });
   } catch (error) {
     console.error("Error creating student team:", error);

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:51:26
       .populate('members.member', 'profile.name email')
       .lean();
 
-    res.status(201).json({ message: "Student team created and invites sent successfully", team: populatedTeam });
+    res.status(201).json({});
   } catch (error) {
     console.error("Error creating student team:", error);

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:52:19
       .lean();
 
     res.status(201).json({ message: "Student team created and invites sent successfully", team: populatedTeam });
-  } catch (error) {
-    console.error("Error creating student team:", error);
-    res.status(500).json({ message: "Failed to create student team", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite createStudentTeam should return 500 on database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:58:54
   }
 };
 
-export const deleteStudentTeam = async (req, res) => {
-    try {
-        const { teamId } = req.params;
-
-        const team = await StudentTeam.findById(teamId);
-        if (!team) {
-            return res.status(404).json({ message: "Team not found" });
-        }
-
-        if (team.leader.toString() !== req.user.id) {
-            return res.status(403).json({ message: "Only the team leader can delete the team" });
-        }
-
-        await StudentTeam.findByIdAndDelete(teamId);
-
-        res.status(200).json({ message: "Student team deleted successfully" });
-    } catch (error) {
-        console.error("Error deleting student team:", error);
-        res.status(500).json({ message: "Failed to delete student team", error: error.message });
-    }
-};
+export const deleteStudentTeam = async (req, res) => {};
 
 export const getStudentTeams = async (req, res) => {
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should delete team if requester is leader (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123"

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:59:9
 };
 
 export const deleteStudentTeam = async (req, res) => {
-    try {
-        const { teamId } = req.params;
-
-        const team = await StudentTeam.findById(teamId);
-        if (!team) {
-            return res.status(404).json({ message: "Team not found" });
-        }
-
-        if (team.leader.toString() !== req.user.id) {
-            return res.status(403).json({ message: "Only the team leader can delete the team" });
-        }
-
-        await StudentTeam.findByIdAndDelete(teamId);
-
-        res.status(200).json({ message: "Student team deleted successfully" });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error deleting student team:", error);
         res.status(500).json({ message: "Failed to delete student team", error: error.message });
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should delete team if requester is leader (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123"

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:63:20
         const { teamId } = req.params;
 
         const team = await StudentTeam.findById(teamId);
-        if (!team) {
-            return res.status(404).json({ message: "Team not found" });
-        }
+        if (!team) {}
 
         if (team.leader.toString() !== req.user.id) {
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should return 404 if team not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:63:13
         const { teamId } = req.params;
 
         const team = await StudentTeam.findById(teamId);
-        if (!team) {
+        if (true) {
             return res.status(404).json({ message: "Team not found" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should delete team if requester is leader (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123"

Number of calls: 0

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:64:52
 
         const team = await StudentTeam.findById(teamId);
         if (!team) {
-            return res.status(404).json({ message: "Team not found" });
+            return res.status(404).json({ message: "" });
         }
 

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:67:13
             return res.status(404).json({ message: "Team not found" });
         }
 
-        if (team.leader.toString() !== req.user.id) {
+        if (false) {
             return res.status(403).json({ message: "Only the team leader can delete the team" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should return 403 if requester is not leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:67:13
             return res.status(404).json({ message: "Team not found" });
         }
 
-        if (team.leader.toString() !== req.user.id) {
+        if (team.leader.toString() === req.user.id) {
             return res.status(403).json({ message: "Only the team leader can delete the team" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should delete team if requester is leader (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "team123"

Number of calls: 0

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:73:41
 
         await StudentTeam.findByIdAndDelete(teamId);
 
-        res.status(200).json({ message: "Student team deleted successfully" });
+        res.status(200).json({ message: "" });
     } catch (error) {
         console.error("Error deleting student team:", error);

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:74:21
         await StudentTeam.findByIdAndDelete(teamId);
 
         res.status(200).json({ message: "Student team deleted successfully" });
-    } catch (error) {
-        console.error("Error deleting student team:", error);
-        res.status(500).json({ message: "Failed to delete student team", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite deleteStudentTeam should return 500 on generic error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:95:19
                 { 'members.member': userId }
             ]
         })
-        .populate('leader', 'profile.name email')
+        .populate("", 'profile.name email')
         .populate('members.member', 'profile.name email')
         .lean();

[Killed] ArrowFunction
controllers/student_controller/student.team.controller.js:100:46
         .lean();
 
         // Add registration status to all found teams
-        const registrationChecks = teams.map(team => 
-            Registration.findOne({ teamName: team._id }).select('_id eventId').populate('eventId', 'title status createdAt').lean()
+        const registrationChecks = teams.map(() => undefined
         );
         const registrations = await Promise.all(registrationChecks);
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return all relevant teams with registration details (Happy Path)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:101:89
 
         // Add registration status to all found teams
         const registrationChecks = teams.map(team => 
-            Registration.findOne({ teamName: team._id }).select('_id eventId').populate('eventId', 'title status createdAt').lean()
+            Registration.findOne({ teamName: team._id }).select('_id eventId').populate("", 'title status createdAt').lean()
         );
         const registrations = await Promise.all(registrationChecks);

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:101:100
 
         // Add registration status to all found teams
         const registrationChecks = teams.map(team => 
-            Registration.findOne({ teamName: team._id }).select('_id eventId').populate('eventId', 'title status createdAt').lean()
+            Registration.findOne({ teamName: team._id }).select('_id eventId').populate('eventId', "").lean()
         );
         const registrations = await Promise.all(registrationChecks);

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:105:60
         );
         const registrations = await Promise.all(registrationChecks);
 
-        const teamsWithStatus = teams.map((team, index) => {
-            const registration = registrations[index];
-            const isRegisteredAndPublished = !!registration && registration.eventId?.status === 'published';
-
-            return {
-                ...team,
-                isRegisteredForEvent: isRegisteredAndPublished,
-                linkedEvent: isRegisteredAndPublished ? {
-                    title: registration.eventId?.title, // Use 'title' to match component
-                    _id: registration.eventId?._id,
-                    date: registration.eventId?.createdAt
-                } : null,
-            };
-        });
+        const teamsWithStatus = teams.map((team, index) => {});
     
         res.status(200).json({
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return all relevant teams with registration details (Happy Path)
statusReason: TypeError: Cannot read properties of undefined (reading 'isRegisteredForEvent')

[Killed] BooleanLiteral
controllers/student_controller/student.team.controller.js:107:47
 
         const teamsWithStatus = teams.map((team, index) => {
             const registration = registrations[index];
-            const isRegisteredAndPublished = !!registration && registration.eventId?.status === 'published';
+            const isRegisteredAndPublished = !registration && registration.eventId?.status === 'published';
 
             return {
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return all relevant teams with registration details (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:107:46
 
         const teamsWithStatus = teams.map((team, index) => {
             const registration = registrations[index];
-            const isRegisteredAndPublished = !!registration && registration.eventId?.status === 'published';
+            const isRegisteredAndPublished = true;
 
             return {
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return all relevant teams with registration details (Happy Path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Survived] OptionalChaining
controllers/student_controller/student.team.controller.js:113:28
                 ...team,
                 isRegisteredForEvent: isRegisteredAndPublished,
                 linkedEvent: isRegisteredAndPublished ? {
-                    title: registration.eventId?.title, // Use 'title' to match component
+                    title: registration.eventId.title, // Use 'title' to match component
                     _id: registration.eventId?._id,
                     date: registration.eventId?.createdAt

[Survived] OptionalChaining
controllers/student_controller/student.team.controller.js:114:26
                 isRegisteredForEvent: isRegisteredAndPublished,
                 linkedEvent: isRegisteredAndPublished ? {
                     title: registration.eventId?.title, // Use 'title' to match component
-                    _id: registration.eventId?._id,
+                    _id: registration.eventId._id,
                     date: registration.eventId?.createdAt
                 } : null,

[Survived] OptionalChaining
controllers/student_controller/student.team.controller.js:115:27
                 linkedEvent: isRegisteredAndPublished ? {
                     title: registration.eventId?.title, // Use 'title' to match component
                     _id: registration.eventId?._id,
-                    date: registration.eventId?.createdAt
+                    date: registration.eventId.createdAt
                 } : null,
             };

[Killed] ObjectLiteral
controllers/student_controller/student.team.controller.js:120:30
             };
         });
     
-        res.status(200).json({
-            success: true,
-            message: "Successfully retrieved your teams.",
-            count: teamsWithStatus.length,
-            data: teamsWithStatus
-        });
+        res.status(200).json({});
 
     } catch (error) {
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return all relevant teams with registration details (Happy Path)
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:122:22
     
         res.status(200).json({
             success: true,
-            message: "Successfully retrieved your teams.",
+            message: "",
             count: teamsWithStatus.length,
             data: teamsWithStatus

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:127:21
             data: teamsWithStatus
         });
 
-    } catch (error) {
-        console.error("Error fetching student teams:", error);
-        res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite getStudentTeams should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:128:23
         });
 
     } catch (error) {
-        console.error("Error fetching student teams:", error);
+        console.error("", error);
         res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
     }

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:129:41
 
     } catch (error) {
         console.error("Error fetching student teams:", error);
-        res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
+        res.status(500).json({ message: "", error: error.message });
     }
 };

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:141:52
         const team = await StudentTeam.findById(teamId);
         
         if (!team) {
-            return res.status(404).json({ message: "Team not found." });
+            return res.status(404).json({ message: "" });
         }
 

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:145:13
         }
 
         const leaderId = team.leader;
-        if (leaderId.toString() === requesterId) {
+        if (false) {
             return res.status(409).json({ message: "You are already the leader of this team." });
         }
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if requester is the leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:145:50
         }
 
         const leaderId = team.leader;
-        if (leaderId.toString() === requesterId) {
-            return res.status(409).json({ message: "You are already the leader of this team." });
-        }
+        if (leaderId.toString() === requesterId) {}
 
         const isAlreadyMember = team.members.some(
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if requester is the leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:146:52
 
         const leaderId = team.leader;
         if (leaderId.toString() === requesterId) {
-            return res.status(409).json({ message: "You are already the leader of this team." });
+            return res.status(409).json({ message: "" });
         }
 

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:146:41
 
         const leaderId = team.leader;
         if (leaderId.toString() === requesterId) {
-            return res.status(409).json({ message: "You are already the leader of this team." });
+            return res.status(409).json({});
         }
 

[Killed] MethodExpression
controllers/student_controller/student.team.controller.js:149:33
             return res.status(409).json({ message: "You are already the leader of this team." });
         }
 
-        const isAlreadyMember = team.members.some(
-            (m) => m.member.toString() === requesterId
-        );
+        const isAlreadyMember = team.members.every(m => m.member.toString() === requesterId);
         
         if (isAlreadyMember) {
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should send invitation successfully (Happy Path)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ArrowFunction
controllers/student_controller/student.team.controller.js:150:13
         }
 
         const isAlreadyMember = team.members.some(
-            (m) => m.member.toString() === requesterId
+            () => undefined
         );
         
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if requester is already a member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:150:20
         }
 
         const isAlreadyMember = team.members.some(
-            (m) => m.member.toString() === requesterId
+            (m) => false
         );
         
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if requester is already a member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:153:30
             (m) => m.member.toString() === requesterId
         );
         
-        if (isAlreadyMember) {
-            return res.status(409).json({ message: "You are already a member of this team." });
-        }
+        if (isAlreadyMember) {}
         
         const existingRequest = await InboxEntity.findOne({
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if requester is already a member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1
