[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:153:13
             (m) => m.member.toString() === requesterId
         );
         
-        if (isAlreadyMember) {
+        if (true) {
             return res.status(409).json({ message: "You are already a member of this team." });
         }
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should send invitation successfully (Happy Path)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:165:13
             status: "Sent",
         });
         
-        if (existingRequest) {
+        if (false) {
             return res.status(409).json({ message: "You have already sent a request to join this team." });
         }
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 409 if request is already pending
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 201

Number of calls: 1

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:166:41
         });
         
         if (existingRequest) {
-            return res.status(409).json({ message: "You have already sent a request to join this team." });
+            return res.status(409).json({});
         }
         const newRequest = new InboxEntity({

[Survived] ConditionalExpression
controllers/student_controller/student.team.controller.js:171:34
         const newRequest = new InboxEntity({
             type: "team_invite", 
             title: `Request to join ${team.teamName}`,
-            description: `User ${req.user.name || ''} wants to join your team.`, 
+            description: `User ${true} wants to join your team.`, 
             from: requesterId, 
             to: leaderId, 

[Survived] ConditionalExpression
controllers/student_controller/student.team.controller.js:171:34
         const newRequest = new InboxEntity({
             type: "team_invite", 
             title: `Request to join ${team.teamName}`,
-            description: `User ${req.user.name || ''} wants to join your team.`, 
+            description: `User ${false} wants to join your team.`, 
             from: requesterId, 
             to: leaderId, 

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:189:21
             request: newRequest 
         });
         
-    } catch (error) {
-        console.error("Error requesting to join team:", error);
-        res.status(500).json({ message: "Failed to send join request", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite sendInvitationToJoinTeam should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:195:51
     }
 };
 
-export const getAllStudents = async (req, res) => {
-  try {
-    const students = await User.find({ role: 'student' }).select('profile.name email college').lean();
-    res.status(200).json(students);
-  } catch (error) {
-    console.error("Error fetching all students:", error);
-    res.status(500).json({ message: "Failed to fetch students", error: error.message });
-  }
-};
+export const getAllStudents = async (req, res) => {};
 
 
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam getAllStudents: should return list of students
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:196:7
 };
 
 export const getAllStudents = async (req, res) => {
-  try {
-    const students = await User.find({ role: 'student' }).select('profile.name email college').lean();
-    res.status(200).json(students);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching all students:", error);
     res.status(500).json({ message: "Failed to fetch students", error: error.message });
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam getAllStudents: should return list of students
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:197:38
 
 export const getAllStudents = async (req, res) => {
   try {
-    const students = await User.find({ role: 'student' }).select('profile.name email college').lean();
+    const students = await User.find({}).select('profile.name email college').lean();
     res.status(200).json(students);
   } catch (error) {

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:199:19
   try {
     const students = await User.find({ role: 'student' }).select('profile.name email college').lean();
     res.status(200).json(students);
-  } catch (error) {
-    console.error("Error fetching all students:", error);
-    res.status(500).json({ message: "Failed to fetch students", error: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam getAllStudents: should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:200:19
     const students = await User.find({ role: 'student' }).select('profile.name email college').lean();
     res.status(200).json(students);
   } catch (error) {
-    console.error("Error fetching all students:", error);
+    console.error("", error);
     res.status(500).json({ message: "Failed to fetch students", error: error.message });
   }

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:206:55
 };
 
 
-export const showAllStudentTeam = async (req, res) => {
-    try {
-        const teams = await StudentTeam.find().populate('leader', 'profile.name email').populate('members.member', 'profile.name email');
-        res.status(200).json({ teams });
-    } catch (error) {
-        console.error("Error fetching student teams:", error);
-        res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
-    }
-};
+export const showAllStudentTeam = async (req, res) => {};
 
 export const updateStudentTeam = async (req, res) => {
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam showAllStudentTeam: should return list of teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:207:9
 
 
 export const showAllStudentTeam = async (req, res) => {
-    try {
-        const teams = await StudentTeam.find().populate('leader', 'profile.name email').populate('members.member', 'profile.name email');
-        res.status(200).json({ teams });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching student teams:", error);
         res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam showAllStudentTeam: should return list of teams
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:210:21
     try {
         const teams = await StudentTeam.find().populate('leader', 'profile.name email').populate('members.member', 'profile.name email');
         res.status(200).json({ teams });
-    } catch (error) {
-        console.error("Error fetching student teams:", error);
-        res.status(500).json({ message: "Failed to fetch student teams", error: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: Student Team Controller - Comprehensive Test Suite getAllStudents & showAllStudentTeam showAllStudentTeam: should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:227:9
       return res.status(404).json({ message: "Team not found" });
     }
 
-    if (team.leader.toString() !== leaderId.toString()) {
+    if (team.leader.toString() === leaderId.toString()) {
       return res.status(403).json({ message: "Only the team leader can edit the team" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 403 if user is not leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] ArrayDeclaration
controllers/student_controller/student.team.controller.js:232:27
     }
 
     let hasChanges = false;
-    const validStatuses = ["Approved", "Pending", "Rejected"];
+    const validStatuses = [];
 
     if (teamName !== undefined) {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:234:9
     let hasChanges = false;
     const validStatuses = ["Approved", "Pending", "Rejected"];
 
-    if (teamName !== undefined) {
+    if (teamName === undefined) {
       const trimmedName = teamName.trim();
       if (trimmedName === "") {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:234:9
     let hasChanges = false;
     const validStatuses = ["Approved", "Pending", "Rejected"];
 
-    if (teamName !== undefined) {
+    if (false) {
       const trimmedName = teamName.trim();
       if (trimmedName === "") {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original"

[Killed] MethodExpression
controllers/student_controller/student.team.controller.js:235:27
     const validStatuses = ["Approved", "Pending", "Rejected"];
 
     if (teamName !== undefined) {
-      const trimmedName = teamName.trim();
+      const trimmedName = teamName;
       if (trimmedName === "") {
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 400 if team name is empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:236:31
 
     if (teamName !== undefined) {
       const trimmedName = teamName.trim();
-      if (trimmedName === "") {
-        return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
-      }
+      if (trimmedName === "") {}
 
       if (team.teamName !== trimmedName) {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 400 if team name is empty string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:236:11
 
     if (teamName !== undefined) {
       const trimmedName = teamName.trim();
-      if (trimmedName === "") {
+      if (trimmedName !== "") {
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original"

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:237:48
     if (teamName !== undefined) {
       const trimmedName = teamName.trim();
       if (trimmedName === "") {
-        return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
+        return res.status(400).json({ message: "" });
       }
 

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:240:11
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
 
-      if (team.teamName !== trimmedName) {
+      if (false) {
         
         const existing = await StudentTeam.findOne({ teamName: trimmedName });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original"

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:240:42
         return res.status(400).json({ message: "Team name, if provided, cannot be empty" });
       }
 
-      if (team.teamName !== trimmedName) {
-        
-        const existing = await StudentTeam.findOne({ teamName: trimmedName });
-
-        if (existing) {
-          return res.status(409).json({ message: "That exact team name is already taken" });
-        }
-        team.teamName = trimmedName;
-        hasChanges = true;
-      }
+      if (team.teamName !== trimmedName) {}
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Name"
Received: "Original"

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:244:23
         
         const existing = await StudentTeam.findOne({ teamName: trimmedName });
 
-        if (existing) {
-          return res.status(409).json({ message: "That exact team name is already taken" });
-        }
+        if (existing) {}
         team.teamName = trimmedName;
         hasChanges = true;
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 409 if team name matches another existing team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:245:39
         const existing = await StudentTeam.findOne({ teamName: trimmedName });
 
         if (existing) {
-          return res.status(409).json({ message: "That exact team name is already taken" });
+          return res.status(409).json({});
         }
         team.teamName = trimmedName;

[Killed] BooleanLiteral
controllers/student_controller/student.team.controller.js:248:22
           return res.status(409).json({ message: "That exact team name is already taken" });
         }
         team.teamName = trimmedName;
-        hasChanges = true;
+        hasChanges = false;
       }
     }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:252:9
       }
     }
 
-    if (membersToRemove && Array.isArray(membersToRemove)) {
+    if (false) {
       if (membersToRemove.includes(leaderId.toString())) {
         return res.status(400).json({ message: "The team leader cannot be removed" });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should remove members successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}]

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:252:9
       }
     }
 
-    if (membersToRemove && Array.isArray(membersToRemove)) {
+    if (true) {
       if (membersToRemove.includes(leaderId.toString())) {
         return res.status(400).json({ message: "The team leader cannot be removed" });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:253:58
     }
 
     if (membersToRemove && Array.isArray(membersToRemove)) {
-      if (membersToRemove.includes(leaderId.toString())) {
-        return res.status(400).json({ message: "The team leader cannot be removed" });
-      }
+      if (membersToRemove.includes(leaderId.toString())) {}
       const originalCount = team.members.length;
       // Filter out members whose 'member' ID is in the membersToRemove array.
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 400 if attempting to remove the leader
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:254:37
 
     if (membersToRemove && Array.isArray(membersToRemove)) {
       if (membersToRemove.includes(leaderId.toString())) {
-        return res.status(400).json({ message: "The team leader cannot be removed" });
+        return res.status(400).json({});
       }
       const originalCount = team.members.length;

[Killed] ArrowFunction
controllers/student_controller/student.team.controller.js:258:42
       }
       const originalCount = team.members.length;
       // Filter out members whose 'member' ID is in the membersToRemove array.
-      team.members = team.members.filter(m => !membersToRemove.includes(m.member.toString()));
+      team.members = team.members.filter(() => undefined);
 
       if (team.members.length < originalCount) {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should remove members successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] MethodExpression
controllers/student_controller/student.team.controller.js:258:22
       }
       const originalCount = team.members.length;
       // Filter out members whose 'member' ID is in the membersToRemove array.
-      team.members = team.members.filter(m => !membersToRemove.includes(m.member.toString()));
+      team.members = team.members;
 
       if (team.members.length < originalCount) {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should remove members successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}]

[Survived] BlockStatement
controllers/student_controller/student.team.controller.js:260:48
       // Filter out members whose 'member' ID is in the membersToRemove array.
       team.members = team.members.filter(m => !membersToRemove.includes(m.member.toString()));
 
-      if (team.members.length < originalCount) {
-        hasChanges = true;
-      }
+      if (team.members.length < originalCount) {}
     }
 

[Survived] ConditionalExpression
controllers/student_controller/student.team.controller.js:260:11
       // Filter out members whose 'member' ID is in the membersToRemove array.
       team.members = team.members.filter(m => !membersToRemove.includes(m.member.toString()));
 
-      if (team.members.length < originalCount) {
+      if (false) {
         hasChanges = true;
       }

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:265:72
       }
     }
 
-    if (membersToUpdateStatus && Array.isArray(membersToUpdateStatus)) {
-      for (const update of membersToUpdateStatus) {
-        const { memberId, newStatus } = update;
-
-        if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
-          return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
-        }
-        if (memberId === leaderId.toString()) {
-           return res.status(400).json({ message: "Cannot change the leader's status" });
-        }
-
-        const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
-        if (!memberToUpdate) {
-          return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
-        }
-
-        if (memberToUpdate.status !== newStatus) {
-          memberToUpdate.status = newStatus;
-          hasChanges = true;
-        }
-      }
-    }
+    if (membersToUpdateStatus && Array.isArray(membersToUpdateStatus)) {}
 
     if (membersToAdd && Array.isArray(membersToAdd)) {
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:265:9
       }
     }
 
-    if (membersToUpdateStatus && Array.isArray(membersToUpdateStatus)) {
+    if (false) {
       for (const update of membersToUpdateStatus) {
         const { memberId, newStatus } = update;
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:266:51
     }
 
     if (membersToUpdateStatus && Array.isArray(membersToUpdateStatus)) {
-      for (const update of membersToUpdateStatus) {
-        const { memberId, newStatus } = update;
-
-        if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
-          return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
-        }
-        if (memberId === leaderId.toString()) {
-           return res.status(400).json({ message: "Cannot change the leader's status" });
-        }
-
-        const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
-        if (!memberToUpdate) {
-          return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
-        }
-
-        if (memberToUpdate.status !== newStatus) {
-          memberToUpdate.status = newStatus;
-          hasChanges = true;
-        }
-      }
+      for (const update of membersToUpdateStatus) {}
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BooleanLiteral
controllers/student_controller/student.team.controller.js:269:13
       for (const update of membersToUpdateStatus) {
         const { memberId, newStatus } = update;
 
-        if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
+        if (memberId || !newStatus || !validStatuses.includes(newStatus)) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:269:13
       for (const update of membersToUpdateStatus) {
         const { memberId, newStatus } = update;
 
-        if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
+        if (true) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:272:13
         if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
         }
-        if (memberId === leaderId.toString()) {
+        if (false) {
            return res.status(400).json({ message: "Cannot change the leader's status" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 400 if attempting to change leader status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:272:13
         if (!memberId || !newStatus || !validStatuses.includes(newStatus)) {
           return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
         }
-        if (memberId === leaderId.toString()) {
+        if (memberId !== leaderId.toString()) {
            return res.status(400).json({ message: "Cannot change the leader's status" });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:273:51
           return res.status(400).json({ message: "Invalid payload for membersToUpdateStatus" });
         }
         if (memberId === leaderId.toString()) {
-           return res.status(400).json({ message: "Cannot change the leader's status" });
+           return res.status(400).json({ message: "" });
         }
 

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:276:55
            return res.status(400).json({ message: "Cannot change the leader's status" });
         }
 
-        const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
+        const memberToUpdate = team.members.find(m => true);
         if (!memberToUpdate) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 404 if member to update is not in team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:276:55
            return res.status(400).json({ message: "Cannot change the leader's status" });
         }
 
-        const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
+        const memberToUpdate = team.members.find(m => false);
         if (!memberToUpdate) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] BooleanLiteral
controllers/student_controller/student.team.controller.js:277:13
         }
 
         const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
-        if (!memberToUpdate) {
+        if (memberToUpdate) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:277:13
         }
 
         const memberToUpdate = team.members.find(m => m.member.toString() === memberId);
-        if (!memberToUpdate) {
+        if (false) {
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should return 404 if member to update is not in team
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1
