[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:281:13
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
 
-        if (memberToUpdate.status !== newStatus) {
+        if (memberToUpdate.status === newStatus) {
           memberToUpdate.status = newStatus;
           hasChanges = true;
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:281:13
           return res.status(404).json({ message: `Member with ID ${memberId} not found in this team` });
         }
 
-        if (memberToUpdate.status !== newStatus) {
+        if (false) {
           memberToUpdate.status = newStatus;
           hasChanges = true;
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update member status successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Approved"
Received: "Pending"

[Survived] BooleanLiteral
controllers/student_controller/student.team.controller.js:283:24
 
         if (memberToUpdate.status !== newStatus) {
           memberToUpdate.status = newStatus;
-          hasChanges = true;
+          hasChanges = false;
         }
       }

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:290:56
 
     if (membersToAdd && Array.isArray(membersToAdd)) {
       for (const memberId of membersToAdd) {
-        const isAlreadyMember = team.members.some(m => m.member.toString() === memberId);
+        const isAlreadyMember = team.members.some(m => m.member.toString() !== memberId);
         if (!isAlreadyMember) {
           // Check if an invitation is already pending for this user to avoid duplicates
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should add new members and send invites
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}]

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:290:56
 
     if (membersToAdd && Array.isArray(membersToAdd)) {
       for (const memberId of membersToAdd) {
-        const isAlreadyMember = team.members.some(m => m.member.toString() === memberId);
+        const isAlreadyMember = team.members.some(m => false);
         if (!isAlreadyMember) {
           // Check if an invitation is already pending for this user to avoid duplicates
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should skip adding if member already exists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}, {"member": "member1", "status": "Pending"}]

[Killed] BooleanLiteral
controllers/student_controller/student.team.controller.js:291:13
     if (membersToAdd && Array.isArray(membersToAdd)) {
       for (const memberId of membersToAdd) {
         const isAlreadyMember = team.members.some(m => m.member.toString() === memberId);
-        if (!isAlreadyMember) {
+        if (isAlreadyMember) {
           // Check if an invitation is already pending for this user to avoid duplicates
           const existingInvitation = await InboxEntity.findOne({
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should add new members and send invites
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}]

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:291:13
     if (membersToAdd && Array.isArray(membersToAdd)) {
       for (const memberId of membersToAdd) {
         const isAlreadyMember = team.members.some(m => m.member.toString() === memberId);
-        if (!isAlreadyMember) {
+        if (true) {
           // Check if an invitation is already pending for this user to avoid duplicates
           const existingInvitation = await InboxEntity.findOne({
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should skip adding if member already exists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"member": {"toString": [Function toString]}, "status": "Pending"}, {"member": {"toString": [Function toString]}, "status": "Approved"}, {"member": "member1", "status": "Pending"}]

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:293:64
         const isAlreadyMember = team.members.some(m => m.member.toString() === memberId);
         if (!isAlreadyMember) {
           // Check if an invitation is already pending for this user to avoid duplicates
-          const existingInvitation = await InboxEntity.findOne({
-            relatedTeam: team._id,
-            to: memberId,
-            status: "Pending",
-            type: "team_invite"
-          });
+          const existingInvitation = await InboxEntity.findOne({});
 
           if (existingInvitation) {

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:304:57
             continue; // Skip this user, an invite is already out.
           }
           // Add member to team with "Pending" status and send an invite.
-          team.members.push({ member: memberId, status: "Pending" });
+          team.members.push({ member: memberId, status: "" });
 
           // Create an invitation in the inbox for the new member.

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:307:36
           team.members.push({ member: memberId, status: "Pending" });
 
           // Create an invitation in the inbox for the new member.
-          await InboxEntity.create({
-            type: "team_invite",
-            title: `Invitation to join team: ${team.teamName}`,
-            description: `You have been invited by ${req.user.name} to join the team "${team.teamName}".`,
-            from: leaderId,
-            to: memberId,
-            status: "Pending",
-            relatedTeam: team._id,
-            relatedTeamModel: "StudentTeam",
-          });
+          await InboxEntity.create({});
 
           hasChanges = true;

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:323:22
       }
     }
 
-    if (!hasChanges) {
-      return res.status(200).json({ message: "No changes provided", team });
-    }
+    if (!hasChanges) {}
 
     await team.save();
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should skip adding if member already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {"error": "StudentTeam.findById(...).populate is not a function", "message": "Failed to update team details"}

Number of calls: 1

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:323:9
       }
     }
 
-    if (!hasChanges) {
+    if (true) {
       return res.status(200).json({ message: "No changes provided", team });
     }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should update team name successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
controllers/student_controller/student.team.controller.js:324:35
     }
 
     if (!hasChanges) {
-      return res.status(200).json({ message: "No changes provided", team });
+      return res.status(200).json({});
     }
 
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should skip adding if member already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "No changes provided"}
Received: {}

Number of calls: 1

[Survived] StringLiteral
controllers/student_controller/student.team.controller.js:331:27
 
     // Re-populate the team before sending it back to the client
     const populatedTeam = await StudentTeam.findById(team._id)
-      .populate('leader', 'profile.name email')
+      .populate('leader', "")
       .populate('members.member', 'profile.name email')
       .lean();

[Survived] ObjectLiteral
controllers/student_controller/student.team.controller.js:335:26
       .populate('members.member', 'profile.name email')
       .lean();
 
-    res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
+    res.status(200).json({});
   } catch (err) {
     if (err.code === 11000) {

[Killed] BlockStatement
controllers/student_controller/student.team.controller.js:336:17
       .lean();
 
     res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
-  } catch (err) {
-    if (err.code === 11000) {
-      return res.status(409).json({ message: "Team name already exists" });
-    }
-    console.error(err);
-    res.status(500).json({ message: "Failed to update team details", error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should handle MongoDB duplicate key error (code 11000)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] ConditionalExpression
controllers/student_controller/student.team.controller.js:337:9
 
     res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
   } catch (err) {
-    if (err.code === 11000) {
+    if (false) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should handle MongoDB duplicate key error (code 11000)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/student_controller/student.team.controller.js:337:9
 
     res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
   } catch (err) {
-    if (err.code === 11000) {
+    if (err.code !== 11000) {
       return res.status(409).json({ message: "Team name already exists" });
     }
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should handle MongoDB duplicate key error (code 11000)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] StringLiteral
controllers/student_controller/student.team.controller.js:338:46
     res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
   } catch (err) {
     if (err.code === 11000) {
-      return res.status(409).json({ message: "Team name already exists" });
+      return res.status(409).json({ message: "" });
     }
     console.error(err);
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should handle MongoDB duplicate key error (code 11000)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Team name already exists",
+   "message": "",

[Killed] ObjectLiteral
controllers/student_controller/student.team.controller.js:338:35
     res.status(200).json({ message: "Team details updated successfully", team: populatedTeam });
   } catch (err) {
     if (err.code === 11000) {
-      return res.status(409).json({ message: "Team name already exists" });
+      return res.status(409).json({});
     }
     console.error(err);
killedBy: Student Team Controller - Comprehensive Test Suite updateStudentTeam should handle MongoDB duplicate key error (code 11000)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Team name already exists",
- }
